const { promises: fsp } = require('fs');
const fs = require("fs");
var words = require('./words');

var path = require('path');
let str = '';

const addNewWords = ["бат", "курна", "даман", "ветрило", "тинг", "армада", "геркон",
    "глефа", "подлет", "постник", "кавер", "унция", "манкурт", "хостел", "тарзанка",
    "гранж", "фрикасе", "симулятор", "судоку", "штекер", "наработка", "модник",
    "киноман", "пекинес", "проглот", "пастилка", "выточка", "плашка", "поке", "сальдо",
    "простенок", "паинька", "мусорка", "сметанник", "холя", "пульсар", "переизбыток", "гренадин",
    "кетон", "луговина", "хряпа", "нулевка", "слипание", "тестомес", "копань", "спуд", "хилер", "панство",
    "нужность", "голь", "бродилка", "золотинка", "борзость", "доживание", "ровница", "пестрина",
    "босота", "замета", "облов", "особость", "моветон", "бонтон", "снование", "зеница", "обирать", "анх",
    "ступица", "мигрантка", "фаркоп", "дофина", "фриланс", "либидо", "пиратка", "тапиока", "реникса",
    "скотница", "бипер", "ворсина", "кечуа", "стрекало", "одеон", "типс", "унтер", "сателлит",
    "соба", "лагер", "хинди", "пинакль", "лопатник", "лидар", "этология", "паркинг", "окорка", "солитер",
    "стрим", "калига", "варикоз", "парсуна", "сипуха", "косоур", "первач", "калика", "малярка",
    "лачка", "оммаж", "жирование", "пежина", "тенге", "тригон", "обирание", "пирование", "вирион", "путание",
    "бриль", "бигль", "поилец", "исподнее", "консорт", "парфе", "оплетание", "топление", "каст",
    "профит", "срывание", "заварник", "запил", "тремоло", "пиано", "марлин", "паддок", "раклист",
    "саудит", "штундист", "орленок", "маскот", "понт", "пародонт", "сизарь", "страйк", "рамен",
    "мотня", "реяние", "проскок", "тимус", "американо",
    "росс", "хитринка", "рванина", "первак", "клатрат",
    "тензор", "сечь", "точение", "стаза", "азат", "капча",
    "закос", "сюрко", "консоме", "щуренок", "адонис",
    "квиток", "ревун", "макрос", "фейхоа", "милота",
    "дойка", "троакар", "палочник", "аят", "вьет", "навивка", "натурист",
    "кеа", "очин", "горилка", "автоним", "маронит", "тирс", "минорат", "коати", "орикс", "распялка", "рядность",
    "омфал", "арамид", "тимол", "этолог", "томос", "релакс", "балт", "кисмет", "кашевар", "чуни",
    "мустье", "лопотание","гратен", "пугание", "гротеск", "горст", "грабен", "нормаль", "киборг",
    "пикинер", "киш", "артикул", "интроверт", "маммограф", "биск", "саам", "вади",
    "плинт", "слезник", "тейп", "сомик", "таролог", "вредина", "варна", "опалина", "гамета",
    "почивание", "взывание", "отекание", "саам", "саамка", "стигмат", "имитатор", "штрафование",
    "паление", "кование", "небыль", "верстание", "свертывание", "брют", "жвало", "ботокс",
    "напыление", "ведание", "душность", "радушность", "саночница", "культист", "учительница",
    "отряхивание", "лавирование", "снукер", "тат", "офиура", "опарыш", "скрепление",
    "казуальность", "одергивание", "патоген", "покидание", "отпаривание", "отпаивание",
    "зависание", "трепание", "потягивание", "спирание", "валение", "влезание", "дельность", "стазис",
    "мешание", "заживание", "подрывание", "резидентура", "цессия", "видеоурок", "порывание",
    "донация", "очерчивание", "втискивание", "выискивание", "находка", "лабильность", "дергание",
    "отбывание", "жировка", "аваль", "игнор", "нахлест", "хант", "снек", "релаксант", "мукор",
    "ипатка", "реимпорт", "биом", "перс", "тщание", "смирна", "пломбировка", "ладность", "стригаль",
    "плясание", "латте", "мемуарист", "дофамин", "переток", "бонист", "бонистика",
    "тискание", "руление", "шорка", "каналья", "выпаривание", "бретер", "окрашивание",
    "потакание", "скакание", "задаривание", "зверолов", "безделица", "безделка", "плоение", "чили",
    "пинание", "денница", "окопник", "мантикора", "аниматор", "шуан", "малийка", "лыжница",
    "гастроскоп", "шлейка", "опад", "буррито", "журналистка", "аким", "операнд", "варган",
    "вебинар", "тетеря", "металлик", "заворот", "четь", "опаление", "рыскание"];
words = [...words, ...addNewWords];

words = words.sort((a, b) => a.localeCompare(b));
for(let i = 0; i < words.length; i++){
    str += words[i] + '\n';
}


let newWords;
// fs.readFile("newWords.txt", "utf8",
//     function(error,data){
//         newWords = data.split('\n');
//         let deleted = 0;
//         for(let i = 0; i < words.length; i++){
//             if(!newWords.includes(words[i])) deleted++;
//         }
//         console.log('Удалено слов: ', deleted);
//         let added = 0;
//         for(let i = 0; i < newWords.length; i++){
//             if(!words.includes(newWords[i])) added++;
//         }
//         console.log('Добавлено слов: ', added);
//         fsp.writeFile(path.join(__dirname, 'newAllWords.js'), JSON.stringify(newWords));
//     });

fsp.writeFile(path.join(__dirname, 'words.txt'), str)