const { promises: fsp } = require('fs');
const fs = require("fs");
var words = require('./words');

var path = require('path');
let str = '';

const addNewWords = ["татарка", "кокпит", "булат", "люд", "оргалит", "фенек", "ополоски", "отломок", "сыть", "вырост", "тофу", "ершик", "нэцке", "виверна", "готовка", "буча", "скибка", "кликун", "инуит", "купаты", "долив", "разор", "нуар", "бланш", "темник", "трекинг", "лаоска", "сквот",
    "рикотта", "сегун", "вехотка", "додо", "дронт", "рондад", "охламон", "тестер", "тростина", "барчук",
    "шалот", "навахо", "бальи", "йомен", "дегу", "мако", "ясак", "барре", "рема", "риал", "шпунт", "пашот", "поножи",
    "капо", "межень", "кильсон", "гоплит", "чумак", "шванк", "путанка", "стент", "гренка", "гренок", "срочник",
    "носач", "лада", "спот", "старица", "ронин", "икс", "арк", "стряпание", "поноска", "перси", "глясе", "хаб", "мурал", "перевоз",
    "сметка", "постук", "кровник", "сенник", "ледянка", "пылание", "пенаты", "латы", "афония", "путница", "плие",
    "авокадо", "выкат", "булат", "фолк", "метиз", "шкет", "заброс", "морилка", "ливанец", "ливанка", "орегано",
    "сван", "тетрада", "дрил", "струг", "рейв", "робуста", "лобстер", "бластер", "тарт", "саронг", "легато", "катыш", "подсеть",
    "размет", "маркет", "акцепт", "бонна", "гофр", "орт", "пионерка", "горал", "скрупул", "равиоли", "торока", "акроним", "лепота",
    "коуч", "ригодон", "триада", "байкер", "винтаж", "браузер", "диджей", "дедлайн", "портфолио", "синквейн",
    "роуминг", "ресепшен", "скриншот", "фейк", "франшиза", "опцион", "гаджет", "рингтон", "караоке", "кутюрье",
    "смайл", "промоутер", "ремикс", "дайвинг", "дайвер", "скиатлон", "подкаст", "глюк",
    "пиния", "ворог", "арабистка", "най", "шерп", "кутила", "пергола", "конкубина", "убоина",
    "кантина", "стотинка", "мотовка", "ионит", "мироед", "зоман", "сенна", "пикт", "микадо", "мурава", "намол", "сапун",
    "синапс", "сионистка", "криоген", "перчинка", "шмат", "кади", "морфин", "фавела", "актор", "мутизм",
    "огарь", "чокер", "литота", "кадавр", "сентаво", "девиант", "кержак", "годе", "лакец", "обиняк", "галеон", "мандала",
    "дреды", "гард", "дорама", "феромон", "ростер", "бзик", "сквош", "куверт", "токен", "берцы", "шутер", "фортель",
    "данник", "нитрон", "картель", "кан", "шелом", "смолье", "цевка", "кокни", "картель", "кораль", "дробина",
    "лисенок", "ежонок", "мастиф", "кавист", "шудра", "зоил", "тизер", "ерзание", "оверлок", "атриум", "глиф", "шавка",
    "цадик", "ливийка", "ортез", "графен", "тушка", "ткачик", "кортесы", "салун", "лапотник", "очинка",
    "цинка", "ведовство", "световод", "драм"];
words = [...words, ...addNewWords];

words = words.sort((a, b) => a.localeCompare(b));
for(let i = 0; i < words.length; i++){
    str += words[i] + '\n';
}


let newWords;
// fs.readFile("newWords.txt", "utf8",
//     function(error,data){
//         newWords = data.split('\n');
//         let deleted = 0;
//         for(let i = 0; i < words.length; i++){
//             if(!newWords.includes(words[i])) deleted++;
//         }
//         console.log('Удалено слов: ', deleted);
//         let added = 0;
//         for(let i = 0; i < newWords.length; i++){
//             if(!words.includes(newWords[i])) added++;
//         }
//         console.log('Добавлено слов: ', added);
//         fsp.writeFile(path.join(__dirname, 'newAllWords.js'), JSON.stringify(newWords));
//     });

fsp.writeFile(path.join(__dirname, 'words.txt'), str)