<template>
  <div id="app">
<!--    <div class="close-level-help prev-location next-location"></div>-->
    <div class="levels"
         @updateAll="updateAll()"
         v-show="levels" :class="[levelsAnim ? 'levelsAnim' : '']">
      <div class="blur"></div>
      <div class="opacity"></div>
      <div class="levelsTop">
        <div class="switchRules" @click="toggleRules()">?</div>
        <div class="levelsTop__allStars">
          {{allStars}}/{{numOfLevels*3}}
        </div>
        <div class="menu-star"></div>
        <div class="sounds" @click="switchSounds" :class="isSounds ? 'sounds-on' : ''"></div>
      </div>
      <div class="levels__property">
        <div class="levels-wrapper">
          <div class="level" v-for="level in 21" :key="getLevelByLevelAndLocation(level)"
          @click="getLevel(getLevelByLevelAndLocation(level)-1)" :class="stars[getLevelByLevelAndLocation(level)-1] > 0 ? 'level-done' : ''">
            <div v-show="isLevelNumberShow(getLevelByLevelAndLocation(level))">{{getLevelByLevelAndLocation(level)}}</div>
            <div class="menu__level_stars">
              <div class="level_star" v-for="star in 3" :key="star"
                   :class="star <= stars[getLevelByLevelAndLocation(level)-1] ? 'menu-star' : ''"></div>
            </div>
            <div class="close-level" v-if="isCloseLevelShow(getLevelByLevelAndLocation(level))"></div>
          </div>
          <div class="prev-location" @click="prevLocation()" v-if="location > 0"></div>
          <div class="next-location" @click="nextLocation()" v-if="location < allLocations-1"></div>


        </div>
        <div class="close-location" v-show="allStars < location*32">
          <div class="big-close"></div>
          <div class="close-stars">
            {{allStars}}/{{location*33}}
            <div class="level_star"></div>
          </div>
        </div>
      </div>
      <div class="rules-blackout" v-show="rules" @click="toggleRules()"></div>
      <div class="rules" v-show="rules">
        <div class="rules__cross" @click="toggleRules()"></div>
        <h2 class="rules__menu">
          Управление
        </h2>
        Добро пожаловать в игру "Слова из слова".
          Цель игры - составлять всевозможные слова из выданных вам слов.
          Нажимайте на буквы снизу, чтобы добавить или убрать эту букву из слова.
          Когда слово будет собрано - нажмите на стрелку, чтобы проверить, есть ли такое слово.
          Если у вас закончились идеи, нажмите на подсказку.
          Подсказки можно получить за звёзды, а также за просмотр рекламы.
          Уровень пройден на 33% - 1 звезда, 66% - 2 звезды, 100% - 3 звезды.
          Удачной игры!
      </div>
    </div>



    <div class="game" v-show="content">
      <div class="blur"></div>
      <div class="opacity"></div>


      <header class="menu">
        <button class="menu__button-back" @click="backMenu"></button>
        <div class="menu__words-amount">
          {{doneWords.length}}/{{nowWords.length}}
        </div>
        <div class="menu__level">
          УРОВЕНЬ {{lvl+1}}
          <div class="menu__level_stars">
            <div class="level_star" v-for="star in 3" :key="star"
                 :class="[star <= stars[lvl] ? 'level_full-star' : '',
                      getStar === star ? 'getStar' : '']"></div>
          </div>
        </div>
        <div class="menu__tip" @click="getTip()">
          <div class="advert" v-if="advTip() && !advShowNow"></div>
          <div class="menu__tip_count" v-else>{{tipCount}}</div>
        </div>
        <button class="menu__button-next-level"
                :class="[testShowNextLevel() ? 'menu__button-next-level_active' : '']"
                @click="nextLevel()">
        </button>
      </header>



      <div class="property">
        <div></div>






        <div class="words">
          <div class="words__letters-block"
               v-for="word in nowWords" :key = "word"
               :class="[doneWords.includes(word) ? 'words__letters-block_done' : '',
               animWord === word ? 'animWord' : '',
                animWordStart === word ? 'animWordStart' : '',
                newWord === word ? 'newWord' : '']">
            <div class="words__letter"
                 v-for="letter in word" :key = "letter + Math.random()"
                >{{doneWords.includes(word) ? letter : '' }}</div>
          </div>

        </div>





        <div class="action-block">
          <div class="action-block__done-word">
              <div class="done-word" :class="[isBadWord ? 'badWord' : '']" >{{wordFromLetter}}</div>
          </div>
          <div class="action-block__letters">
            <div class="action-block__letter"
                 @click="selectLetter(index)"
                 :class="[selectedLetters.includes(index) ?
                  'action-block__letter_selected' : '']"
                 v-for="(letter,index) in letters" :key="letter + Math.random()">{{letter}}
            </div>
            <button class="action-block__button-send" @click="sendWord"></button>
          </div>
        </div>
      </div>
    </div>

  </div>

</template>

<script>
  let advTime = true;
  let showAdv, playerGame;
  let allWords = [
    "милость", "формула", "арматура", "телёнок", "записка", "дизайнер", "пипетка", "животное", "желтозём", "буржуазия", "диаграмма", "хромосома", "щитовидка", "архаизм", "шизофрения", "яйцеклетка", "антоним", "бедняга", "трактат", "сожитель", "корчёвка",
    "жаркое", "рутина", "комедия", "ломбард", "анатомия", "баталист", "косточка", "экономия", "эвкалипт", "барашек", "боярышник", "двигатель", "гидрология", "голограмма", "громоотвод", "свиристель", "устройство", "ультиматум", "этимология", "юрисдикция", "абордаж",
    "подруга", "продукт", "единорог", "писатель", "вермишель", "язычество", "богатство", "стоматолог", "ускорение", "уничтожение", "заклёпка", "картёжник", "надёжность", "авиасалон", "аквариум", "арматурщица", "безматок", "блиндаж", "вафельщица", "горбуша", "джокер",
    "автор", "повесть", "жестокость", "мартышка", "жаворонок", "чернослив", "вафельница", "целомудрие", "блокнот", "буквоед", "нахлёстка", "боксит", "боровик", "брусок", "валькирия", "выкаливание", "деноминация", "инобытие", "корифей", "кульман", "надсечка",
    "блузка", "гвардия", "отслоение", "бездельник", "батиплан", "гортензия", "задевание", "ископаемое", "квашнин", "коллапс", "концессия", "лексика", "мединститут", "написание", "отблеск", "паутинка", "прорезка", "пугало", "синева", "синтепон", "смелость",
    "шарлотка", "агрономия", "эвристика", "авиамодель", "художество", "архаист", "воеводство", "выразитель", "купюра", "наложение", "обращение", "осознание", "поднебесная", "прелесть", "призвание", "прямота", "самозащита", "сроднение", "стенопись", "термометр", "фальшивка",
    "аэросъёмка", "вакуумметр", "ворсильщик", "забавник", "раздор", "сифонофора", "склёпщица", "стрела", "трешкоут", "щеглёнок", "студень", "томагавк", "абрикос", "боеголовка", "мармеладка", "декстрин", "кукарекание", "развозчица", "сценичность", "телебашня", "хлорка",
    "автомобиль", "ассиметрия", "газопровод", "сейсмограф", "бесшумность", "минутка", "подбородок", "подросток", "прообраз", "флорист", "штурмовик", "самоанализ", "кассатор", "проволока", "растирание", "хохотание", "пульсация", "самородок", "вентилятор", "амортизатор", "родник",
    "маркетинг", "инкубатор", "малахит", "паровоз", "русалочка", "валерьянка", "поломка", "двустволка", "гранатомёт", "программист", "потолок", "кооператив", "суходол", "забастовка", "странствие", "туземка", "снегурочка", "цесарка", "экскаватор", "напёрсток", "фиаско",
    "автомеханик", "адсорбент", "абажур", "всемирность", "глухонемота", "интрига", "адмирал", "крематорий", "монетарист", "коленка", "отстранение", "критика", "прибалтика", "разработка", "распилка", "костёр", "эмират", "удабривание", "федералист", "требование", "молодчина"

  ];
  let wordsFromWords = {
    "подруга": ["ад", "ар", "арго", "гад", "го", "год", "гора", "град", "груда", "гурда", "дар", "даур", "до", "дог", "дора", "драп", "дрога", "друг", "дуга", "огпу", "ода", "одр", "ор", "орда", "па", "пар", "подгар", "пора", "пруд", "пуд", "пудра", "пурга", "рагу", "рог", "род", "руда", "угар", "угода", "удар", "упад", "упор", "урод"],
    "автомобиль": ["авто", "автол", "аил", "альбом", "альт", "атом", "бал", "било", "бит", "бита", "битва", "блат", "боа", "бола", "болт", "боль", "бот", "ботва", "вал", "виола", "вобла", "вол", "вольта", "ива", "ил", "илот", "ильм", "лимб", "лоб", "лов", "лом", "ломота", "ломоть", "лот", "лото", "малов", "мат", "мать", "ми", "мол", "молва", "молитва", "молот", "молотьба", "моль", "мольба", "мольва", "мот", "мотив", "обвал", "облов", "облом", "обмол", "обои", "обол", "овал", "олива", "ом", "отбив", "отвал", "отлив", "отлов", "табло", "тал", "талиб", "тимол", "тол", "толь", "том", "тьма"],
    "маркетинг": ["агент", "акт", "анкер", "ант", "ар", "артем", "гаер", "гектар", "ген", "герма", "гетман", "гиена", "гит", "гитан", "гран", "гранит", "грант", "грек", "греки", "гренки", "игра", "игрек", "ик", "икра", "иман", "каин", "камин", "кантри", "каре", "кармин", "карт", "кат", "катрен", "кератин", "керн", "кета", "кит", "кран", "крем", "кретин", "маг", "мак", "макет", "маки", "манер", "мари", "март", "мартен", "мат", "мена", "мент", "мерин", "мерка", "метан", "метр", "метрика", "миг", "мигрант", "мир", "мирта", "митенка", "митра", "натр", "нега", "нектар", "немка", "нитка", "рак", "рант", "ратин", "ратник", "рема", "рента", "ринг", "ринк", "ритм", "танк", "танкер", "теин", "тени", "термин", "тигр", "тик", "тина", "тир", "тире", "трагик", "трак", "трек", "трен"],
    "автор": ["авто", "ар", "вар", "вор", "втора", "ор", "орт", "отвар", "рвота", "ров", "рот", "рота", "тавр", "тавро", "товар", "тора"],
    "блузка": ["азу", "аул", "бак", "бал", "баул", "блуза", "буза", "бук", "бука", "булка", "зал", "злак", "зуб", "кал", "клуб", "куб", "лак", "луб", "лук", "лука", "указ"],
    "жаркое": ["акр", "ар", "арк", "жар", "жарок", "жор", "кар", "каре", "кожа", "кора", "корж", "ор", "орк", "рак", "ре", "река", "рожа", "рок"],
    "рутина": ["анри", "ант", "ар", "аут", "натр", "нут", "рант", "ратин", "раут", "руина", "руна", "рута", "тина", "тир", "тиран", "тиун", "тун", "туна", "тур", "тура", "турин", "униат", "уран", "урина", "урна"],
    "абрикос": ["абрис", "акр", "ар", "арк", "ас", "бак", "бар", "барк", "барс", "бас", "баск", "баски", "басок", "бикс", "бирка", "боа", "бок", "бокс", "бора", "бра", "брак", "брас", "брик", "ик", "икра", "икс", "иск", "искра", "кар", "кариб", "киса", "кобра", "кора", "коса", "краб", "окрас", "ор", "орк", "орс", "оса", "оскар", "раб", "раис", "рак", "рис", "риск", "риска", "роба", "рок", "роса", "сабо", "саиб", "сбор", "сбора", "сборка", "сборки", "си", "скарб", "скоба", "сок", "сор", "срок", "бор"],
    "гвардия": ["ад", "ар", "ария", "вар", "варяг", "варяги", "виг", "вид", "вира", "враг", "гад", "гид", "гидра", "гиря", "град", "грива", "гряда", "дар", "ива", "игра", "ирга", "ряд", "яд", "яр", "ярд"],
    "записка": ["апис", "ас", "заика", "запас", "ик", "икс", "иск", "кипа", "киса", "па", "паз", "пак", "пас", "паск", "пик", "пика", "писака", "писк", "саз", "сапа", "сапка", "си", "сип", "сказ", "скип"],
    "комедия": ["дек", "до", "док", "дом", "домик", "едок", "идея", "ик", "имя", "иод", "код", "ком", "коми", "медик", "медяк", "ми", "ом", "яд", "як"],
    "ломбард": ["ад", "ар", "бал", "бар", "бард", "боа", "бола", "бора", "бра", "брод", "бром", "дар", "до", "дол", "дом", "домбра", "домра", "дора", "лад", "ладо", "лар", "лоб", "лом", "лор", "лорд", "мода", "мол", "мор", "морда", "ода", "одр", "ом", "омар", "ор", "орда", "раб", "роба", "род", "рол", "ром", "ромб", "бор"],
    "милость": ["ил", "илот", "ильм", "лист", "лом", "лис", "лось", "лот", "ми", "мол", "моль", "мост", "мот", "ом", "ост", "ость", "ось", "си", "силь", "сито", "слом", "слот", "смоль", "соли", "соль", "сом", "стиль", "стол", "тимол", "тис", "тол", "толь", "том"],
    "продукт": ["до", "док", "дот", "дрок", "код", "копт", "корд", "корт", "кот", "крот", "круп", "курд", "одр", "опт", "ор", "орк", "орт", "откуп", "подкур", "порт", "пот", "прок", "пруд", "прут", "пуд", "пук", "род", "рок", "рот", "ток", "топ", "торк", "трок", "троп", "труд", "труп", "тур", "турок", "укор", "укроп", "упор", "урод", "урок", "уток", "утор", "утро"],
    "повесть": ["вепс", "вес", "вест", "весть", "весь", "вето", "опт", "ост", "ость", "ось", "отвес", "отсев", "песо", "пест", "повет", "поветь", "посев", "пост", "пот", "потесь", "свет", "сев", "сет", "сеть", "совет", "степ", "степь", "топ", "топь"],
    "пипетка": ["акт", "ик", "кат", "кепи", "кета", "кипа", "кит", "па", "пак", "пакет", "пакт", "пат", "пек", "пик", "пика", "пикап", "пике", "пикет", "пипка", "тик", "тип"],
    "трактат": ["акр", "акт", "ар", "арак", "арат", "арк", "арка", "кар", "кара", "карат", "карт", "карта", "кат", "крат", "рак", "рака", "такт", "тат", "тата", "татка", "трак", "тракт", "трата", "тратта", "тара"],
    "формула": ["амур", "ар", "аул", "лар", "лом", "лор", "мол", "мор", "морф", "муар", "мул", "мура", "ом", "омар", "ор", "рол", "ром", "улар", "ум", "умора", "фа", "фал", "флора", "фол", "фора", "форма", "форум", "фрау", "фура", "фурма"],
    "анатомия": ["анатом", "ант", "атом", "атония", "иман", "имя", "ион", "мана", "мания", "мант", "мантия", "манто", "мат", "ми", "мина", "мот", "мята", "нома", "нота", "ом", "тина", "тмин", "том", "томан", "тон", "тоня", "яма"],
    "арматура": ["амур", "ар", "арарат", "арат", "аура", "аут", "мара", "март", "мат", "муар", "мура", "рама", "раут", "рута", "тарарам", "траур", "тур", "тура", "ум", "тара"],
    "баталист": ["аил", "аист", "ас", "астат", "атлас", "бал", "бас", "батат", "батист", "бит", "бита", "блат", "ил", "ласа", "ласт", "лата", "лиса", "лист", "саба", "саиб", "салат", "си", "сила", "тал", "талиб", "тат", "тата", "тис"],
    "дизайнер": ["ад", "анри", "ар", "дан", "дар", "диез", "дизайн", "дина", "динар", "дрезина", "дрена", "еда", "езда", "зад", "здание", "иена", "иней", "надир", "надрез", "наезд", "нард", "недра", "низ", "радий", "раз", "рай", "ре", "редан", "резина", "рей", "рейд", "рений", "риза"],
    "единорог": ["ген", "героин", "гид", "го", "год", "гон", "гонор", "гордон", "горе", "горин", "горн", "город", "динго", "дно", "до", "дог", "донг", "донор", "дорн", "иго", "иод", "ион", "негр", "негроид", "норд", "одр", "ор", "орден", "ре", "регион", "ринг", "рог", "род", "родео", "рондо"],
    "животное": ["вено", "вето", "вино", "винт", "воин", "енот", "жетон", "живот", "ион", "нож", "овен", "овин", "твин", "теин", "тени", "тон"],
    "жестокость": ["жест", "жесть", "косость", "кость", "кот", "око", "окот", "октет", "осек", "осос", "осот", "ост", "ость", "ось", "откос", "отсек", "отсос", "отток", "сет", "сеть", "скот", "сок", "сосок", "стежок", "стек", "сток", "текст", "тест", "тесто", "тесть", "ток", "тост"],
    "косточка": ["акт", "ас", "кат", "каток", "кок", "кока", "кокос", "кокс", "коса", "косач", "косок", "кот", "кочка", "око", "окот", "оса", "осока", "осот", "осочка", "ост", "откос", "очко", "сачок", "скак", "скат", "скачок", "скок", "скот", "скотч", "сок", "сотка", "сток", "сточка", "тако", "ткач", "ток", "тоска", "точка", "час", "часок"],
    "мартышка": ["акр", "акт", "ар", "арак", "арат", "арк", "арка", "арык", "ашрам", "камыш", "кар", "кара", "карат", "карма", "карт", "карта", "карты", "кат", "каша", "крат", "крыша", "мак", "мара", "марка", "март", "марш", "мат", "матка", "маштак", "мрак", "мышка", "рак", "рака", "ракша", "рама", "рамка", "рык", "рым", "такыр", "трак", "шар", "шарм", "шрам", "штык", "штыка", "тара"],
    "писатель": ["аил", "аист", "альт", "апис", "ас", "ель", "ил", "лапти", "ласт", "лепта", "лес", "леса", "лесть", "липа", "лиса", "лист", "па", "пас", "пастель", "пасть", "пат", "пест", "пила", "плат", "платье", "плеть", "плис", "плита", "пьеса", "сель", "сет", "сеть", "си", "сиаль", "сила", "силь", "сип", "слип", "спель", "спил", "сталь", "стапель", "стела", "степ", "степь", "стиль", "тал", "талес", "тип", "тис"],
    "сожитель": ["ель", "жест", "жесть", "жилет", "житель", "ил", "илот", "лес", "лесть", "лето", "лист", "ложе", "ложь", "лось", "лот", "ост", "ость", "ось", "отель", "село", "сель", "сет", "сеть", "си", "силь", "сито", "слот", "соли", "соль", "стиль", "стол", "тело", "тесло", "тис", "тол", "толь"],
    "экономия": ["ик", "имя", "инок", "ион", "кимоно", "кино", "ком", "коми", "кон", "ми", "нок", "окно", "око", "ом", "эконом", "эмо", "як", "янки"],
    "эвкалипт": ["аил", "акт", "актив", "вал", "валик", "вилка", "ива", "ик", "ил", "кал", "кат", "кил", "кила", "кипа", "кит", "клип", "лак", "лаки", "лапти", "лик", "липа", "липка", "литвак", "литка", "па", "пак", "пакт", "пат", "пик", "пика", "пила", "пилав", "пилка", "плав", "плавки", "плат", "плита", "плитка", "тал", "талик", "тик", "тип", "тэк", "элита", "эпика", "этап", "этика", "этил"],
    "шарлотка": ["акр", "акт", "аорта", "ар", "арак", "арат", "арк", "арка", "кал", "калоша", "кар", "кара", "карат", "карт", "карта", "кат", "каша", "кашалот", "клот", "коала", "кол", "кора", "корт", "кот", "кошара", "крат", "кроат", "крот", "лак", "лар", "лата", "лор", "лот", "лошак", "ор", "орк", "орт", "отара", "рак", "рака", "ракша", "рок", "рол", "рот", "рота", "тако", "тал", "ток", "тол", "толк", "тора", "торк", "трак", "трал", "трок", "шакал", "шала", "шар", "шарлот", "шкала", "шкало", "школа", "шкот", "шлак", "шок", "шрот", "штакор", "штора", "шторка", "тара"],
    "барашек": ["абрек", "акр", "ар", "араб", "арак", "арба", "арека", "арк", "арка", "бак", "бар", "барак", "барк", "барка", "башка", "бек", "бекар", "бра", "брак", "кабаре", "кар", "кара", "каре", "каша", "кеб", "кеш", "краб", "раб", "раба", "рак", "рака", "ракша", "ре", "река", "решка", "шар"],
    "агрономия": ["агония", "агроном", "анри", "ар", "арго", "аргон", "ария", "армия", "гармония", "гимн", "гиря", "гном", "гнома", "го", "гомон", "гон", "гонор", "гора", "горин", "гормон", "горн", "гран", "грим", "гром", "иго", "игра", "иман", "имя", "ион", "ирга", "ирма", "маг", "магия", "манго", "мания", "марго", "мари", "ми", "миг", "мина", "минога", "минор", "мир", "миро", "мирон", "могар", "мор", "морг", "моряна", "нога", "нома", "нора", "нория", "норма", "ом", "омар", "онагр", "ор", "орган", "оргия", "ранг", "ринг", "рог", "ром", "роман", "рона", "яма", "яр"],
    "буржуазия": ["ажур", "азия", "азу", "азур", "ар", "арбуз", "ария", "бар", "биржа", "бра", "бриз", "буж", "буза", "бур", "бура", "буржуа", "буря", "жар", "жир", "заря", "зуб", "зубр", "изба", "раб", "раз", "риза", "ряж", "уж", "яр", "яуза"],
    "боярышник": ["бок", "бон", "боны", "боярин", "брик", "броня", "бык", "ик", "икры", "инок", "ион", "кино", "кон", "корн", "нок", "нория", "нырок", "ор", "орк", "ринк", "рок", "рыбник", "рык", "рынок", "ши", "шик", "шок", "шорник", "як", "янки", "яр", "ярок", "бор"],
    "вермишель": ["веер", "евреи", "ель", "ерь", "ил", "ильм", "лев", "леер", "ливер", "ливр", "мел", "мель", "ми", "мир", "ре", "шерл", "ши", "ширь", "шлем", "шлир", "шмель"],
    "двигатель": ["авгит", "ад", "аил", "альт", "вал", "валет", "вега", "веда", "ветла", "виг", "вид", "гад", "галиев", "гать", "гвалт", "гель", "гид", "гиль", "гит", "гладь", "даль", "дева", "дельта", "деталь", "детва", "дети", "диета", "еда", "ель", "ива", "игла", "идеал", "ил", "лаг", "лад", "лев", "левит", "легат", "леди", "лига", "тал", "тальвег", "твид", "тильда"],
    "диаграмма": ["агама", "агар", "ад", "ар", "армада", "гад", "гамма", "гарда", "гид", "гидра", "град", "грамм", "грим", "дама", "дар", "драга", "драма", "игра", "имам", "ирга", "ирма", "маг", "магма", "мадам", "мама", "мара", "мари", "ми", "миг", "мим", "мир", "рада", "рама"],
    "жаворонок": ["акр", "ар", "арк", "важ", "вар", "вожак", "вона", "вор", "ворон", "ворона", "воронка", "воронко", "жанр", "жар", "жарок", "жор", "кан", "кар", "ков", "кожа", "кон", "кора", "коран", "корж", "корн", "корова", "корона", "кран", "кров", "крона", "нож", "ножка", "ножовка", "нок", "нора", "норка", "норов", "нрав", "окно", "око", "окова", "ор", "орк", "оркан", "орок", "рак", "ров", "рожа", "рожок", "рожон", "рок", "рона", "ронжа"],
    "инкубатор": ["аборт", "акр", "акт", "ар", "банкир", "банкрот", "бантик", "бар", "барит", "барк", "батон", "бита", "боа", "бона", "борт", "бортик", "бортник", "бра", "брак", "брик", "бука", "бурак", "бурат", "бут", "бутик", "ик", "ион", "каин", "кантор", "кантри", "кариб", "каротин", "кина", "киот", "кит", "кон", "контра", "конура", "коран", "котурн", "крат", "крит", "кроат", "кура", "куртина", "наиб", "нокаут", "нора", "нотка", "нутро", "обкат", "обтирка", "ор", "орк", "оркан", "работник", "рак", "ратник", "раут", "ринк", "рок", "рона", "рубин", "рубка", "рута", "табор", "табу", "тако", "танбур", "тик", "тиун", "ток", "тоник", "торк", "трибун", "трибуна", "трон", "труба", "трубка", "туна", "турбина", "турки", "убор", "укор", "урна", "урон", "утка", "утор", "утро", "утроба", "бор"],
    "отслоение": ["енот", "ил", "илот", "ион", "лес", "летие", "лето", "линт", "лист", "лоно", "лот", "лото", "лотос", "неолит", "нилот", "нос", "нотис", "олеин", "осетин", "осот", "ост", "остин", "относ", "селен", "селенит", "селин", "село", "сени", "сено", "сет", "си", "силен", "силон", "сито", "слоение", "слон", "слот", "соление", "соли", "соло", "сон", "сонет", "стен", "стол", "столон", "стон", "теин", "тело", "тени", "тесло", "тис", "тлен", "тление", "тол", "тон"],
    "русалочка": ["акр", "акула", "арак", "арк", "арча", "аул", "аура", "кал", "кар", "кара", "караул", "коала", "кол", "кора", "корча", "коса", "краса", "кура", "курс", "куча", "лак", "лар", "ласа", "ласка", "лачка", "лоск", "лука", "луч", "лучок", "окрас", "ор", "оракул", "орк", "орс", "оса", "осака", "оскал", "оскар", "рак", "рака", "раса", "раскол", "раус", "рок", "рол", "роса", "рука", "русак", "русалка", "русло", "ручка", "сакура", "сало", "сачок", "скала", "скало", "скол", "скула", "случка", "сок", "солка", "сор", "срок", "сук", "сура", "сурок", "сучок", "счал", "счалка", "укол", "укор", "укос", "улар", "улочка", "урка", "урок", "ус", "усач", "чакра", "чал", "чалка", "чара", "чарка", "час", "часок", "чаус", "чулок", "чурка"],
    "самородок": ["ад", "акр", "ар", "арк", "ас", "даос", "дар", "до", "док", "дока", "дом", "домра", "дора", "доска", "дрок", "кадр", "кар", "код", "кода", "ком", "кома", "комар", "комод", "кора", "корд", "корда", "корм", "корма", "коса", "мак", "марс", "мода", "мор", "морда", "морок", "морока", "морс", "мрак", "ода", "одр", "око", "окрас", "ом", "омар", "ор", "орда", "орк", "орок", "орс", "оса", "осадок", "оскар", "осока", "рак", "рамс", "род", "родос", "рок", "ром", "роса", "сад", "садок", "сард", "скорм", "смак", "смрад", "сода", "сок", "сом", "сома", "сор", "сорока", "срам", "срок"],
    "хромосома": ["ар", "ас", "марс", "мах", "мор", "морс", "мох", "ом", "омар", "ор", "орс", "оса", "охра", "рамс", "ром", "роса", "сом", "сома", "сор", "соха", "срам", "хам", "хаос", "хор", "храм", "хром"],
    "чернослив": ["вено", "вес", "весло", "вино", "вис", "воин", "вол", "вор", "ворс", "ил", "ион", "лев", "ленч", "лес", "ливер", "ливр", "лич", "лов", "лор", "лори", "нерв", "нос", "овен", "овин", "олеин", "ор", "орс", "ре", "рис", "ров", "рол", "сверло", "сев", "севр", "селин", "село", "сени", "сено", "серв", "си", "силен", "силон", "сирен", "слив", "слон", "соли", "сон", "сор", "сочлен", "чело", "чин", "число", "член", "чрево"],
    "штурмовик": ["виток", "вор", "вотум", "ик", "кворум", "киот", "кит", "ков", "ковш", "ком", "коми", "корм", "корт", "кот", "крит", "кров", "крот", "кум", "кумир", "куш", "ми", "мир", "миро", "мирок", "мирт", "мор", "мот", "мотив", "ом", "омут", "ор", "орк", "орт", "ритм", "ров", "ровик", "рок", "ром", "рот", "ротик", "тик", "тир", "ток", "том", "томик", "торк", "трико", "трио", "трок", "тур", "турки", "турок", "туш", "укор", "ум", "умишко", "урок", "уток", "утор", "утро", "ушко", "ши", "шик", "шкив", "шкот", "шмотки", "шов", "шок", "шоу", "шрот", "шторм", "штурм", "шум", "шумовик", "шумок", "шут"],
    "щитовидка": ["авто", "ад", "акт", "актив", "вид", "виток", "вода", "водка", "диво", "до", "док", "дока", "дот", "ива", "идиот", "идиотка", "ик", "икота", "иод", "кат", "катод", "квота", "киот", "кит", "ков", "код", "кода", "кот", "ода", "тако", "твид", "тик", "ток", "щи", "щит", "щитовка", "щиток"],
    "эвристика": ["аист", "акр", "акт", "актив", "ар", "арк", "ас", "вар", "вира", "вис", "виски", "враки", "ива", "иваси", "иврит", "ик", "икра", "икс", "ирис", "иск", "искра", "кар", "карст", "карт", "кат", "квас", "квирит", "киса", "киста", "кит", "крат", "крит", "раис", "рак", "рис", "риск", "риска", "сатир", "сатирик", "сват", "свита", "свитка", "си", "ситар", "сити", "скат", "скит", "старик", "стирка", "сэр", "тавр", "такси", "тик", "тир", "тирс", "тис", "тиски", "трак", "триас", "тэк", "экстра", "эра", "эрика", "эристика", "этика"],
    "язычество": ["вес", "вест", "вето", "воз", "вычет", "вяз", "зев", "зет", "зов", "ост", "отвес", "отзыв", "отсев", "свет", "светоч", "своз", "сев", "сет", "совет", "созыв", "соты", "соя", "стезя", "счеты", "сыч", "яс", "яство"],
    "авиамодель": ["ад", "аил", "альма", "вал", "веда", "ведьма", "вид", "видео", "виола", "вода", "водь", "вол", "давило", "даль", "дама", "дева", "дело", "диво", "до", "дол", "дом", "еда", "ель", "ива", "идеал", "идол", "ил", "ильм", "иод", "лава", "лад", "лада", "ладо", "лама", "лев", "левада", "леди", "лов", "лом", "мала", "малов", "мальва", "медаль", "медиа", "медь", "мел", "мель", "ми", "мода", "модель", "мол", "молва", "моль", "мольва", "овал", "ода", "оладьи", "олива", "оливье", "ом", "омела"],
    "ассиметрия": ["аист", "ар", "арест", "аритмия", "ария", "армия", "артем", "ас", "имя", "ирис", "ирма", "истерия", "маис", "мари", "марс", "март", "мастер", "мат", "материя", "мера", "меря", "месса", "мессия", "мета", "метр", "ми", "мир", "мирт", "мирта", "мисс", "миссия", "мистер", "мистерия", "митра", "мята", "раис", "рамс", "расист", "ре", "рема", "ремиссия", "рея", "рис", "ритм", "ряса", "сатир", "сема", "семит", "семя", "сера", "серия", "сестра", "сет", "си", "сиеста", "система", "систр", "ситар", "сити", "смета", "смятие", "срам", "стая", "стер", "стремя", "тасс", "тема", "темя", "тир", "тире", "тирс", "тис", "трасс", "триас", "яма", "яр", "яс"],
    "боеголовка": ["бак", "бал", "балок", "бег", "бега", "бек", "бел", "белка", "белок", "благо", "блок", "боа", "бог", "бок", "бокал", "бола", "вал", "вега", "век", "веко", "вобла", "вокал", "вол", "волга", "волк", "волок", "главк", "го", "гол", "голова", "головка", "кал", "кеб", "ков", "кол", "колба", "колоб", "лаг", "лак", "лев", "левак", "лек", "лоб", "лобок", "лов", "лог", "логово", "обвал", "облако", "облов", "облог", "обол", "овал", "око", "окова", "олово"],
    "бездельник": ["бдение", "безе", "бек", "бел", "белки", "бель", "блик", "блин", "дебил", "дек", "день", "диез", "дизель", "ель", "ельник", "зек", "зелень", "зелье", "зенки", "ик", "ил", "кеб", "кельн", "кил", "киль", "лебедь", "леди", "ледник", "лек", "лень", "лик", "линь", "низ", "никель"],
    "богатство": ["авто", "ас", "бас", "батог", "боа", "бог", "бот", "ботва", "ватт", "гавот", "го", "гост", "оса", "особа", "осот", "ост", "остов", "сабо", "саго", "сват", "сова", "стог", "тавот", "тат", "тога", "тост"],
    "валерьянка": ["аврал", "акварель", "алан", "анвар", "анклав", "ар", "арак", "ареал", "арека", "арк", "арка", "аркан", "аянка", "вал", "валерьяна", "варан", "варка", "варнак", "веня", "вера", "верк", "верняк", "веялка", "враль", "ель", "ерь", "кавалер", "кавальер", "кал", "калан", "кальян", "кан", "канал", "кар", "кара", "келарня", "келарь", "кельн", "керн", "клан", "краля", "крен", "лава", "лавр", "лавра", "лак", "ланка", "лань", "лар", "ларь", "лев", "левак", "лек", "лекарь", "лень", "лерка", "лея", "ля", "лярва", "навал", "навар", "навель", "навь", "накал", "накра", "нарва", "нарвал", "нева", "нерв", "нерка", "неявка", "нрав", "рак", "рака", "рана", "ранка", "рань", "рвань", "ре", "реал", "река", "рея", "яванка", "явка", "явь", "як", "ял", "январь", "яр", "ярка"],
    "вафельница": ["аил", "алан", "альфа", "вал", "валец", "ваниль", "вина", "вица", "ель", "ива", "иена", "ил", "лава", "лавина", "лань", "лафа", "лев", "левиафан", "ленца", "лень", "лиана", "ливанец", "ливень", "линь", "лиф", "львица", "навал", "навель", "навь", "налив", "нева", "неф", "нива", "фа", "фавн", "фал", "фалинь", "фальц", "фиал", "фила", "филе", "фильц", "финал", "финаль", "финвал", "фланец", "цвель", "целина", "цель", "цена", "циан"],
    "вентилятор": ["вено", "веня", "вето", "вино", "винт", "воин", "вол", "воля", "вор", "енот", "ил", "илот", "ион", "лев", "левит", "лето", "лея", "ливер", "ливр", "ливрея", "линт", "литер", "литорея", "литр", "лов", "лор", "лори", "лорнет", "лот", "ля", "неволя", "неврит", "неолит", "нерв", "нилот", "нория", "овен", "овин", "олеин", "ор", "орт", "ответ", "отит", "отлив", "отнятие", "ре", "рея", "ров", "рол", "рот", "твин", "теин", "тело", "тени", "тенор", "тент", "теория", "тетрил", "тир", "тире", "титло", "титр", "тлен", "тля", "тол", "тон", "тоня", "торит", "торт", "трен", "трио", "триолет", "тритон", "трон", "трот", "тротил", "явор", "ял", "яр"],
    "двустволка": ["авто", "автол", "акт", "ас", "аут", "ввод", "вклад", "вкус", "влас", "водка", "вокал", "волк", "втулка", "даос", "док", "дол", "доска", "дот", "дувал", "дукат", "дуло", "дуст", "кат", "квас", "квота", "клот", "код", "кода", "кодла", "коса", "кот", "куст", "лад", "лак", "ласт", "латук", "лов", "лодка", "лоск", "лоскут", "лук", "лукавство", "овал", "одул", "оклад", "оскал", "откус", "сад", "сало", "сват", "свод", "сводка", "скало", "скат", "скаут", "склад", "скол", "скула", "словак", "сова", "совка", "сода", "сок", "солка", "сотка", "стадо", "ствол", "сток", "стол", "стук", "стул", "судак", "сук", "тако", "ток", "тол", "толк", "тусовка", "увал", "удав", "удол", "уклад", "укол", "укос", "уловка", "ус", "устав", "утка", "уток"],
    "газопровод": ["ад", "ар", "арго", "вар", "вздор", "взор", "вода", "воз", "вор", "враг", "гад", "газ", "го", "говор", "год", "гора", "город", "град", "гроза", "грозд", "дар", "двор", "до", "дог", "договор", "доза", "дозор", "дора", "дорога", "драп", "дрова", "дрога", "завод", "заговор", "зад", "задор", "запор", "зов", "оаз", "овод", "овраг", "оговор", "огород", "ода", "одр", "опор", "опора", "ор", "орда", "па", "паз", "пар", "паровоз", "повар", "повод", "погода", "подвоз", "подгар", "подговор", "подзор", "поза", "позор", "пора", "порог", "порода", "право", "провод", "провоз", "проза", "раз", "развод", "ров", "рог", "рогоз", "рогоза", "род", "роза", "розга"],
    "гидрология": ["гид", "гидролог", "гирло", "гиря", "глория", "го", "год", "гол", "голод", "горло", "город", "грог", "дилогия", "до", "дог", "дол", "долг", "доля", "дояр", "игил", "иго", "идол", "ил", "иод", "лог", "лор", "лорд", "лори", "ля", "лярд", "одр", "ор", "оргия", "рог", "род", "рол", "ряд", "яд", "ядро", "ял", "яр", "ярд"],
    "голограмма": ["агар", "аларм", "ар", "арго", "гага", "гагра", "гамма", "го", "гол", "гора", "горло", "грамм", "грог", "гром", "лаг", "лама", "лар", "лог", "лом", "лор", "маг", "магма", "мала", "мама", "мара", "марал", "марго", "мгла", "могар", "могол", "мол", "мор", "морг", "ом", "омар", "ор", "рама", "рог", "рол", "ром"],
    "гранатомёт": ["агар", "агнат", "ангар", "аорта", "ар", "арат", "арго", "аромат", "атом", "гарант", "гарт", "гном", "гнома", "го", "гон", "гонт", "гора", "горн", "гран", "гранат", "гром", "грот", "маг", "магнат", "мана", "манго", "мант", "манто", "мара", "маран", "марго", "март", "мат", "матрона", "могар", "монтёр", "мор", "морг", "мот", "нагар", "нагота", "наём", "намёт", "нарта", "натр", "нога", "ногата", "нома", "нора", "норма", "нота", "ом", "омар", "омёт", "онагр", "онёр", "ор", "орган", "орт", "отара", "рама", "рана", "ранг", "рант", "рог", "ром", "роман", "рона", "рот", "рота", "ротанг", "таган", "тамга", "танго", "таран", "тат", "тата", "тёрн", "тога", "том", "томан", "томат", "тон", "тора", "торг", "торт", "трата", "трог", "трон", "трот", "тара"],
    "громоотвод": ["вор", "ворот", "го", "говор", "год", "город", "гром", "грот", "двор", "до", "дог", "договор", "дом", "дот", "мор", "морг", "мот", "мотор", "овод", "оговор", "огород", "одр", "ом", "ор", "орт", "отвод", "отговор", "отрог", "ров", "рог", "род", "ром", "рот", "творог", "том", "торг", "трог"],
    "кооператив": ["авто", "арк", "ваер", "век", "вектор", "вето", "вира", "вор", "враки", "ива", "икра", "ипотека", "капер", "кар", "карт", "катер", "квота", "кета", "киот", "копа", "копт", "корт", "креп", "крипта", "кров", "окова", "окоп", "опак", "опоек", "опора", "опт", "оптовик", "орк", "орок", "отпор", "па", "пак", "пакт", "пар", "парик", "парок", "патерик", "петровка", "пиар", "пиво", "пик", "пике", "пират", "питер", "повар", "повет", "покер", "пора", "порка", "порок", "портик", "портовик", "потир", "поток", "право", "проект", "прокат", "рак", "ре", "река", "репа", "репка", "ров", "ровик", "рок", "ропак", "рота", "ротик", "тавр", "тако", "тиверка", "тик", "товар", "топик", "топика", "топор", "тора", "трак", "трап", "трек", "трепак", "трико", "трип", "троп", "тропка"],
    "забастовка": ["абаз", "абака", "авто", "автобаза", "азот", "акт", "аозт", "ас", "атака", "база", "бак", "бас", "баск", "баска", "басок", "боа", "бок", "бокс", "бот", "ботва", "ваза", "вакса", "вата", "ватка", "воз", "возка", "воск", "забава", "забота", "закат", "засов", "застава", "заставка", "заток", "зоб", "зов", "каста", "кат", "квас", "квота", "кобза", "ков", "коза", "коса", "кот", "оаз", "обкат", "октава", "оса", "осака", "ост", "отава", "отказ", "саба", "сабза", "сабо", "савка", "саз", "саква", "сват", "своз", "сказ", "скат", "скоба", "скот", "собака", "сова", "совка", "сок", "сотка", "ставка", "сток", "табак", "таз", "тако", "такса", "тасовка", "ток", "тоска"],
    "мармеладка": ["ад", "акр", "аларм", "ар", "арак", "ареал", "арека", "арк", "арка", "аркада", "армада", "дама", "дамка", "дар", "дек", "дека", "дерма", "драка", "драма", "дрек", "еда", "кадр", "кал", "камера", "кар", "кара", "карда", "каре", "карма", "кедр", "клад", "клемма", "крем", "лад", "лада", "лак", "лама", "лар", "лек", "лемма", "лерка", "мадам", "мадера", "мак", "маклер", "макраме", "мала", "мама", "мамка", "мара", "марал", "марка", "мармелад", "мел", "мем", "мера", "мерка", "мрак", "рада", "рак", "рака", "рама", "рамка", "ре", "реал", "река", "реклама", "рема"],
    "странствие": ["анис", "анри", "ант", "ар", "арест", "ас", "ваер", "васин", "верста", "вес", "весна", "вина", "вис", "ива", "инвар", "навис", "натр", "нева", "нерв", "нива", "нитрат", "нрав", "раис", "ранет", "расист", "рассвет", "ре", "рента", "рис", "сани", "сатир", "сван", "сват", "свес", "свет", "свист", "свита", "сеанс", "сев", "севр", "сенат", "сени", "сера", "серв", "сервант", "сервис", "серна", "сестра", "сет", "си", "сиена", "сиеста", "синева", "сирен", "систр", "ситар", "станс", "старт", "стеарин", "стен", "стер", "стерва", "стерин", "стрит", "тарист", "тасс", "тат", "твин", "твист", "театр", "теин", "теист", "тени", "тент", "тесина", "тета", "тетива", "тина", "тир", "тире", "тис", "титан", "титр", "травести", "трасс", "траст", "трен", "трест", "треста", "триест"],
    "свиристель": ["вес", "вест", "весть", "весь", "вис", "ель", "ерь", "иврит", "ил", "ирис", "лев", "левит", "лес", "лесть", "ливер", "ливр", "лист", "литер", "литр", "ре", "рельс", "рис", "свес", "свет", "свиль", "свирель", "свист", "свитер", "сев", "севр", "сель", "серв", "сервис", "сет", "сеть", "си", "силь", "систр", "сити", "слив", "слитие", "стер", "стиль", "тир", "тире", "тирс", "тис", "трель", "трисель"],
    "стоматолог": ["ас", "атом", "галс", "глас", "глот", "го", "гол", "голос", "гост", "лаг", "ласт", "лог", "лом", "ломота", "лот", "лото", "лотос", "маг", "масло", "мат", "мгла", "могол", "мол", "молот", "мосол", "мост", "мот", "ом", "оса", "осмол", "осот", "ост", "отлог", "саго", "сало", "слог", "слом", "слот", "смог", "смола", "соло", "солома", "сом", "сома", "стог", "стол", "тал", "тат", "тога", "тол", "том", "томат", "тост"],
    "сейсмограф": ["айсор", "ар", "арго", "ас", "гаер", "гарем", "гей", "гейм", "герма", "герой", "го", "гомера", "гора", "горе", "гофр", "гофре", "граф", "гром", "гросс", "йог", "йога", "маг", "май", "майор", "марго", "марс", "мера", "месса", "могар", "мор", "морг", "море", "морс", "морф", "морфей", "ом", "омар", "омег", "омега", "ор", "орс", "оса", "рай", "рамс", "ре", "рей", "рейс", "рема", "рог", "рой", "ром", "роса", "саго", "сейм", "сейф", "сема", "семафор", "сера", "смог", "сойма", "сом", "сома", "сор", "софа", "срам", "ссора", "сфера", "фа", "фарс", "ферма", "фес", "фойе", "фора", "форма", "форс"],
    "снегурочка": ["аксон", "анус", "ар", "ас", "гаер", "ген", "гон", "гончар", "гора", "горка", "горчак", "гран", "грач", "грена", "гренок", "гуран", "кагор", "кар", "конура", "конус", "корча", "кочерга", "крона", "круг", "куга", "кунг", "курс", "нега", "негус", "нога", "нора", "ночка", "нуга", "нукер", "океан", "окрас", "округ", "округа", "онагр", "ор", "орган", "орк", "оркан", "оса", "осек", "осечка", "рагу", "ранг", "раус", "ре", "река", "речка", "речонка", "рог", "рок", "рона", "руна", "русак", "ручка", "ручонка", "саенко", "саке", "сгонка", "сено", "сера", "серна", "сеунч", "сечка", "сканер", "скарн", "снег", "сок", "сон", "сук", "сукно", "сурна", "сурок", "угон", "укос", "уран", "урка", "урок", "ус", "учан", "чан", "часок", "чека", "чеснок", "чурка"],
    "устройство": ["вой", "войт", "вор", "ворот", "ворс", "йот", "ойрот", "ор", "орс", "орт", "осос", "осот", "ост", "остов", "отсос", "отстой", "ров", "рой", "рост", "рот", "руст", "сор", "сорос", "сорт", "сорус", "соус", "створ", "строй", "той", "торос", "торс", "торт", "тост", "трос", "трот", "трус", "тур", "тут", "тутор", "ус", "устой", "устрой", "утор", "утро"],
    "ускорение": ["ик", "икс", "инок", "ион", "иск", "керн", "керосин", "кино", "кон", "конус", "корн", "крен", "кроение", "кун", "курение", "курс", "нок", "нос", "носик", "нукер", "оникс", "ор", "орк", "орс", "осек", "ре", "ринк", "рис", "риск", "рисунок", "роение", "рок", "русин", "сени", "сено", "серко", "си", "сирен", "сок", "сон", "сор", "срок", "сук", "сукно", "сурик", "сурок", "укор", "укос", "урок", "урон", "ус", "усик"],
    "ультиматум": ["аил", "альт", "аул", "аут", "ил", "ильм", "имам", "ламут", "мат", "мать", "ми", "мим", "мул", "мулат", "муть", "тал", "тат", "тать", "титул", "туаль", "тут", "тута", "тьма", "улит", "ум", "утиль"],
    "программист": ["ар", "арго", "артос", "ас", "гарт", "гит", "грамм", "грим", "гром", "грот", "иго", "ирга", "ирма", "истома", "маг", "маис", "март", "матрос", "ми", "мир", "миро", "мирра", "митра", "мопс", "морг", "мортира", "ом", "омар", "оса", "ост", "па", "пари", "паром", "парс", "парторг", "пас", "пастор", "пиар", "пим", "пират", "пирог", "пора", "порт", "портсигар", "потир", "пригар", "прима", "примас", "примат", "приор", "прирост", "присмотр", "прогар", "псаммит", "рапс", "распор", "рог", "ростра", "рот", "саго", "сатир", "сигма", "сипота", "сироп", "сирота", "ситар", "ситро", "смог", "сом", "сопа", "сорт", "сортир", "спор", "спора", "спорт", "срам", "стопа", "строп", "стропа", "тапир", "тигр", "тирс", "том", "топ", "тора", "торс", "триас", "трип", "тромп", "троп"],
    "уничтожение": ["енот", "жетон", "житие", "ион", "нежин", "неон", "неуч", "нож", "нонет", "нут", "теин", "тени", "тиун", "тон", "тун", "уж", "ужение", "ужин", "унижение", "унион", "утончение", "уточнение", "учение", "учинение", "чиж", "чин", "чтение"],
    "целомудрие": ["делец", "делимое", "дело", "дилер", "до", "дол", "дом", "дуло", "думец", "идол", "ил", "иод", "леди", "леер", "лемур", "лидер", "лицемер", "лицо", "лом", "лор", "лорд", "лори", "луидор", "мел", "ми", "милорд", "мир", "миро", "мол", "мор", "море", "мудрец", "мул", "одр", "одул", "олеум", "ом", "ор", "орлец", "орудие", "ре", "род", "рол", "ром", "удел", "удило", "удол", "улем", "ум", "умелец", "урод", "уродец", "целое"],
    "художество": ["вдох", "вес", "вест", "вето", "вех", "восход", "всход", "вход", "джут", "до", "дож", "досев", "дот", "дуст", "дух", "жест", "овод", "осоед", "осот", "ост", "остов", "отвес", "отвод", "отдух", "отсев", "отход", "свет", "свод", "сев", "сет", "совет", "суд", "сход", "тодес", "туес", "увод", "уж", "ус", "ухо", "уход", "хвост", "ход", "хост", "худо"],
    "шизофрения": ["ерошин", "зерно", "зоря", "ион", "иония", "ирония", "неф", "низ", "нория", "ор", "офеня", "ре", "резня", "резон", "рея", "риф", "фея", "финиш", "фирн", "фиш", "фон", "фреон", "шен", "шериф", "шеф", "шея", "ши", "шифер", "шифон", "шифр", "яр"],
    "экскаватор": ["авар", "авто", "автокар", "автор", "аорта", "ар", "арат", "ас", "астра", "вакса", "варка", "ватка", "ворс", "воск", "втора", "какао", "кар", "кара", "каратэ", "карт", "каска", "каста", "касторка", "кат", "каток", "кварк", "квота", "кок", "кока", "кора", "корка", "корсак", "коса", "костра", "краков", "краса", "красота", "красотка", "крат", "кроат", "кроатка", "кров", "крот", "окраска", "октава", "ор", "орава", "орк", "орс", "орт", "оса", "осака", "оскар", "отава", "отрава", "рака", "раскат", "рвота", "рок", "рота", "савка", "саква", "сват", "скак", "скат", "сковка", "скот", "совка", "сор", "сорт", "сотка", "старка", "створ", "сток", "строка", "тавр", "тавро", "такса", "тасовка", "ток", "торк", "торс", "трава", "травка", "трок", "трос", "тэк", "экватор", "эрот", "эскорт", "тара"],
    "этимология": ["гит", "глот", "го", "гол", "игил", "иго", "ил", "илот", "имя", "итог", "лимит", "лития", "лог", "лом", "лот", "лото", "ля", "ми", "миг", "миля", "миолог", "миология", "могол", "мол", "молот", "мот", "мяло", "ом", "отлог", "тимол", "тля", "тол", "том", "тягло", "эго", "эмо", "этил", "этимолог", "этиология", "ял"],
    "юрисдикция": ["дикция", "диск", "ик", "икс", "ирис", "иск", "рис", "риск", "ряд", "си", "сидр", "скирд", "цирк", "юр", "юс", "яд", "як", "яр", "ярд", "яс"],
    "яйцеклетка": ["акт", "алтей", "ацтек", "елей", "кал", "кат", "каяк", "кета", "клей", "клетка", "лай", "лак", "лакей", "лей", "лейка", "лек", "лея", "ля", "таец", "тал", "телек", "телец", "тля", "яйла", "як", "ял"],
    "антоним": ["анион", "аноним", "ант", "атом", "иман", "ион", "мант", "манто", "мат", "ми", "мина", "мот", "наин", "намин", "нома", "нона", "нота", "ом", "танин", "тина", "тмин", "том", "томан", "тон", "тонина", "тонна"],
    "абордаж": ["ад", "ар", "араб", "арба", "бар", "бард", "баржа", "боа", "бора", "бра", "брод", "даба", "дар", "до", "дож", "дора", "жаба", "жабо", "жабра", "жад", "жар", "жара", "жор", "ода", "одр", "ор", "орда", "раб", "раба", "рада", "раджа", "роба", "род", "рожа", "бор"],
    "архаизм": ["ар", "замах", "ирма", "мазар", "мара", "мари", "мах", "махра", "ми", "мир", "мирза", "раз", "размах", "рама", "риза", "хазар", "хам", "харизма", "хиазма", "храм", "зима"],
    "бедняга": ["ад", "баден", "баня", "баян", "бег", "бега", "беда", "гад", "ген", "дан", "еда", "набег", "нега", "ябеда", "яд"],
    "блокнот": ["блок", "бок", "болт", "бон", "бот", "клон", "клот", "кол", "колоб", "кон", "кот", "лоб", "лобок", "локон", "лоно", "лот", "лото", "лоток", "нок", "обол", "окно", "око", "окот", "откол", "ток", "тол", "толк", "тон"],
    "буквоед": ["бек", "бок", "бук", "век", "веко", "дек", "до", "док", "дуб", "дубок", "едок", "кеб", "ков", "код", "куб", "обдув", "обед", "увод"],
    "телёнок": ["енот", "клён", "клон", "клот", "кол", "кон", "кот", "котёл", "лек", "лён", "лёт", "лето", "леток", "лот", "нок", "отёк", "отёл", "тело", "телок", "тенёк", "тлен", "ток", "тол", "толк", "тон"],
    "желтозём": ["ёж", "жезл", "жмот", "зет", "зло", "лёт", "лето", "ложе", "лом", "лот", "мел", "метол", "мол", "мот", "ом", "омёт", "омлет", "отёл", "тело", "тол", "том"],
    "заклёпка": ["ёлка", "зал", "зала", "залп", "запал", "злак", "казак", "кал", "клака", "клёпка", "лазка", "лак", "лапа", "лапка", "па", "паёк", "паз", "пак", "палка", "плаз"],
    "картёжник": ["акр", "акт", "актёр", "анри", "ант", "ар", "арк", "ёж", "ёжик", "жанр", "жар", "жёнка", "жинка", "жир", "ик", "икра", "каик", "каин", "кан", "кант", "кантри", "кар", "карт", "кат", "кика", "кина", "кирка", "кит", "книжка", "кран", "краник", "крат", "крик", "кринка", "крит", "натёк", "натр", "нитка", "раёк", "рак", "рант", "ратин", "ратник", "ринк", "таёжник", "танк", "тёрка", "тёрн", "тик", "тина", "тир", "тираж", "тиран", "трак"],
    "корчёвка": ["акр", "ар", "арк", "вар", "вор", "врач", "кар", "кварк", "ков", "ковёр", "ковка", "кок", "кока", "кора", "корка", "корча", "кочёвка", "кочка", "краков", "кров", "овчар", "ор", "орк", "раёк", "рак", "рёв", "ров", "рок", "чаво", "чаёк"],
    "надёжность": ["ад", "анод", "анонс", "ант", "ас", "дан", "данность", "дань", "даос", "дно", "до", "дож", "донна", "дот", "ёж", "жад", "жадность", "нанос", "наст", "натёс", "нож", "нона", "нос", "нота", "ода", "одёжа", "оса", "ост", "ость", "ось", "сад", "сан", "сода", "сон", "сонант", "стадо", "стаж", "стан", "стон", "тёс", "тон", "тонна", "тоннаж"],
    "напёрсток": ["акр", "аксон", "акт", "арк", "ас", "капот", "карст", "кон", "контра", "копна", "копт", "коса", "костра", "кот", "кран", "крап", "кроат", "крона", "напор", "натёк", "натр", "норка", "нос", "нотка", "онёр", "опт", "орк", "орт", "осётр", "оскар", "оспа", "ост", "отёк", "отёска", "пак", "пакт", "панёр", "парк", "парок", "паск", "пастор", "пат", "патрон", "пёс", "понтёр", "порка", "порт", "пост", "потёк", "прок", "прокат", "простак", "псёнок", "рак", "рант", "рона", "роса", "рота", "сапёр", "скарн", "скопа", "скот", "скрап", "сок", "сопка", "сор", "сорт", "спор", "спорт", "срок", "станок", "стопка", "строка", "стропа", "танк", "тёрн", "тёс", "тёска", "ток", "тон", "топ", "топка", "тора", "тоска", "трак", "транс", "трап", "трон", "тропа", "тропка"],
    "нахлёстка": ["акант", "акт", "алан", "ант", "ас", "атлас", "ёлка", "кал", "калан", "кан", "канал", "канат", "кант", "каста", "кат", "клан", "клён", "клёст", "лак", "ланка", "ласа", "ласка", "ласт", "лата", "лахтак", "лён", "лёт", "накал", "накат", "налёт", "наст", "натёк", "натёс", "натёска", "нахал", "саёк", "салат", "сан", "скала", "скат", "слёт", "стакан", "стан", "такса", "тал", "танк", "тёлка", "тёс", "тёска", "хакас", "хала", "халат", "хан", "хасан", "хата", "хна"],
    "аэросъёмка": ["акр", "ар", "арак", "арк", "арка", "ас", "камса", "кар", "кара", "карма", "ком", "кома", "комар", "комара", "кора", "корм", "корма", "коса", "краса", "мак", "мара", "марка", "марс", "маска", "мор", "морс", "мрак", "мэр", "окрас", "ом", "омар", "ор", "орк", "орс", "оса", "осака", "оскар", "раёк", "рак", "рака", "рама", "рамка", "рамс", "раса", "рок", "ром", "роса", "саам", "саёк", "самар", "самка", "саркома", "скорм", "смак", "сок", "сом", "сома", "сор", "срам", "срок", "съём", "съёмка", "сэр", "эмо", "эра"],
    "авиасалон": ["аванс", "аил", "алан", "анис", "ас", "вал", "васин", "вина", "вино", "виола", "вис", "влас", "воин", "вол", "волан", "волна", "вона", "ива", "ил", "ион", "лава", "лавина", "лавсан", "ласа", "лиана", "лиса", "лов", "лосина", "навал", "навис", "налив", "нива", "нос", "овал", "овин", "олива", "оса", "осина", "саван", "сало", "салон", "сан", "сани", "сван", "си", "сила", "силон", "слава", "слив", "слива", "слон", "сова", "соли", "сон"],
    "автомеханик": ["акание", "актив", "анкета", "антиква", "атомник", "ванта", "вата", "ватин", "ватник", "век", "веник", "венок", "ветка", "веткин", "вех", "вино", "воин", "вона", "енот", "иена", "икота", "ион", "канат", "кант", "катион", "квота", "кина", "кино", "кнехт", "кома", "комната", "мак", "мана", "манатки", "маниок", "манка", "мант", "мат", "мах", "махан", "махаон", "маховик", "мена", "мета", "мех", "меха", "механика", "ми", "мина", "монетка", "мотив", "мохнатка", "навиток", "нева", "немка", "немота", "нехватка", "нивх", "новик", "нота", "овен", "окание", "октава", "отмах", "отмена", "охание", "тако", "танк", "твин", "тема", "тени", "техника", "тик", "тмин", "ток", "томик", "тон", "тоник", "хаки", "хамит", "хамка", "хан", "хата", "хват", "хватка", "хвоинка", "хина", "хит", "хон"],
    "адсорбент": ["абсент", "ант", "арест", "баден", "бар", "барон", "бас", "батон", "беда", "беднота", "бедра", "бердан", "бетон", "боа", "бон", "бора", "бот", "брас", "бред", "дан", "даос", "десант", "десна", "днестр", "дора", "еда", "набор", "нард", "народ", "нарост", "натр", "недра", "нора", "норд", "нос", "обед", "обрат", "ода", "одр", "ор", "орда", "орден", "орс", "орт", "оса", "ост", "раб", "ранет", "рант", "ре", "редан", "рента", "род", "роса", "рот", "сабо", "сад", "сан", "сард", "сбора", "сброд", "сдоба", "сена", "сенат", "сено", "серб", "серна", "сет", "собрат", "сода", "сонет", "сорт", "сотерн", "среда", "стадо", "стан", "стен", "стенд", "стер", "стон", "тенор", "тон", "тора", "торба", "торбан", "торс", "транс", "треба", "трен", "трос", "бор"],
    "аквариум": ["авар", "акр", "амур", "ар", "арак", "арк", "арка", "аура", "вар", "варка", "вира", "враки", "ива", "ик", "икра", "ирма", "кар", "кара", "караим", "карма", "кум", "кума", "кумир", "кура", "курва", "мавр", "мак", "маки", "мара", "мари", "марка", "ми", "мир", "мрак", "муар", "мука", "мура", "рак", "рака", "рама", "рамка", "рука", "рукав", "увар", "уварка", "ум", "урка"],
    "амортизатор": ["азарт", "азиат", "азот", "аозт", "аорта", "ар", "арат", "ариозо", "аромат", "артрит", "артроз", "атом", "замор", "затор", "ирма", "мазар", "мара", "мари", "март", "мат", "ми", "мир", "мирза", "миро", "мирр", "мирра", "мирт", "мирта", "митоз", "митра", "мор", "мороз", "мортира", "мот", "мотор", "оаз", "ом", "омар", "ор", "оратор", "орт", "отара", "отит", "раз", "рама", "риза", "ритм", "ритор", "роза", "ром", "рот", "рота", "ротатор", "ротор", "таз", "тат", "тата", "тиара", "тир", "титр", "том", "томат", "тора", "торизм", "торит", "тормоз", "торт", "трата", "трио", "трот", "зима", "тара"],
    "арматурщица": ["амур", "ар", "арарат", "арат", "арматура", "аура", "аут", "ирма", "мара", "мари", "март", "мат", "матица", "матрац", "матрица", "маца", "ми", "мир", "мирр", "мирра", "мирт", "мирта", "митра", "муар", "мура", "рама", "раут", "ритм", "рута", "тарарам", "тиара", "тир", "траур", "тур", "тура", "турица", "ум", "цитра", "щи", "щит", "щур", "тара"],
    "архаист": ["аист", "ар", "арат", "арахис", "ас", "астра", "раис", "раса", "рахит", "рис", "сатир", "сатира", "сахар", "си", "ситар", "стих", "страх", "тиара", "тир", "тирс", "тис", "триас", "хата", "хит", "тара"],
    "батиплан": ["аил", "алан", "ант", "бал", "бант", "бинт", "биплан", "бит", "бита", "блат", "блин", "блинт", "ил", "ланита", "лапа", "лапина", "лапта", "лапти", "лата", "лиана", "линт", "липа", "набат", "наиб", "па", "паб", "палатин", "пан", "пани", "пат", "патан", "пиала", "пила", "пина", "пинта", "план", "плат", "плата", "платан", "платина", "плита", "тал", "талиб", "тина", "тип"],
    "безматок": ["азот", "акт", "аозт", "атом", "бак", "бек", "бета", "боа", "бок", "бот", "замок", "заток", "зек", "зет", "зоб", "кат", "кеб", "кета", "кобза", "коза", "ком", "кома", "комбат", "комета", "кот", "мазок", "мак", "макет", "мат", "мета", "мот", "мотка", "оаз", "обет", "обкат", "ом", "отказ", "таз", "тако", "тема", "ток", "том"],
    "бесшумность": ["бентос", "бес", "бетон", "бон", "босс", "бот", "бум", "бунт", "бут", "бутон", "бушмен", "енот", "мент", "место", "месть", "мост", "мосье", "мот", "мсье", "мусс", "муссон", "муст", "мутон", "муть", "нос", "нут", "обет", "обмен", "ом", "омут", "осень", "ост", "ость", "ось", "семь", "сено", "сень", "сет", "сеть", "смесь", "сноб", "снос", "собес", "сом", "сон", "сонет", "сонм", "соус", "стен", "стон", "суть", "сушь", "темь", "тень", "том", "тон", "тонус", "туес", "тун", "туш", "тушь", "ум", "ус", "устье", "шен", "шест", "шмон", "шоссе", "шоу", "шоумен", "штос", "штосс", "шум", "шуст", "шут"],
    "блиндаж": ["ад", "аил", "бадин", "бал", "блин", "дан", "джин", "дина", "длина", "жад", "жбан", "жила", "ил", "лад", "лаж", "наиб"],
    "боксит": ["бикс", "бит", "биток", "бок", "бокс", "бот", "ботик", "ик", "икс", "иск", "исток", "киот", "кит", "кости", "кот", "ост", "си", "сито", "скит", "скот", "сок", "сток", "тик", "тис", "ток"],
    "боровик": ["бок", "боров", "брик", "вор", "ик", "ков", "короб", "кров", "обои", "оброк", "око", "ор", "орк", "орок", "ров", "ровик", "рок", "бор"],
    "брусок": ["бок", "бокс", "брус", "бук", "букс", "бур", "куб", "курс", "ор", "орк", "орс", "рок", "сбор", "сок", "сор", "срок", "сруб", "сук", "сурок", "убор", "укор", "укос", "урок", "ус", "бор"],
    "вакуумметр": ["акр", "акт", "амур", "ар", "арк", "артем", "аут", "ваер", "вакуум", "вар", "век", "вера", "верк", "вермут", "ветка", "кар", "каре", "карт", "кат", "катер", "кета", "крат", "крем", "кум", "кума", "кура", "курва", "курта", "кутум", "мавр", "мак", "макет", "март", "мат", "мем", "мемуар", "мера", "мерка", "мета", "метр", "мрак", "муар", "мука", "мура", "рак", "раут", "ре", "река", "рема", "рука", "рукав", "рута", "тавр", "тема", "трак", "трек", "туер", "тумак", "тур", "тура", "турка", "увар", "ум", "урка", "утка"],
    "валькирия": ["аил", "акр", "акрил", "ар", "ария", "арк", "вал", "валик", "вар", "вилка", "вира", "враки", "враль", "ива", "ик", "икра", "ил", "илька", "кал", "кар", "кил", "кила", "киль", "клавир", "клир", "краля", "криль", "лавр", "лак", "лаки", "лар", "ларь", "ливр", "лик", "лира", "лирик", "лирика", "ля", "лярва", "рак", "ракия", "риал", "явка", "явь", "як", "ял", "ялик", "яр", "ярка"],
    "вафельщица": ["аил", "альфа", "вал", "валец", "вещица", "вещь", "вица", "ель", "ива", "ил", "лава", "лафа", "лев", "лещ", "лиф", "львица", "фа", "фал", "фальц", "фиал", "фила", "филе", "фильц", "цвель", "цель", "щавель", "щель", "щи"],
    "воеводство": ["ввод", "вдовство", "вес", "вест", "вето", "до", "досев", "дот", "овод", "осоед", "осот", "ост", "остов", "отвес", "отвод", "отсев", "свет", "свод", "сев", "сет", "совет", "тодес"],
    "ворсильщик": ["вилок", "вис", "виски", "висок", "вол", "волк", "вор", "ворс", "воск", "ик", "икс", "ил", "ирис", "иск", "кил", "кило", "киль", "клир", "клирос", "ков", "кол", "корь", "криль", "кров", "кровь", "кроль", "ливр", "лик", "лирик", "лов", "лор", "лори", "лоск", "лось", "окись", "ор", "орк", "орс", "ослик", "ось", "рис", "риск", "ров", "ровик", "рок", "рол", "ролик", "роль", "рольщик", "свиль", "свищ", "си", "сикл", "силок", "силь", "скол", "слив", "сливки", "сливщик", "совик", "сок", "соли", "соль", "сор", "срок", "щи", "щорс"],
    "всемирность": ["верность", "вес", "вест", "весть", "вино", "винт", "вис", "воин", "вонь", "вор", "ворс", "енот", "инвестор", "ион", "мент", "меринос", "месиво", "месть", "метро", "ми", "минор", "мирность", "мирон", "мирт", "мисс", "мистер", "монист", "монстр", "море", "морс", "мосье", "мсье", "неврит", "нить", "номер", "овин", "ор", "осень", "осетин", "остин", "ость", "отсев", "ревность", "ремонт", "рис", "ритм", "ром", "рот", "свес", "свист", "сев", "севр", "сено", "сень", "сеньор", "серв", "серость", "сеть", "синь", "синьор", "сирость", "систр", "сито", "смерть", "смесь", "смотр", "снос", "сом", "сонет", "сонм", "сор", "сорт", "стен", "стерин", "теин", "темь", "тени", "тенор", "тень", "термос", "тир", "тирс", "тис", "том", "тон", "трен", "трином", "трон", "трос"],
    "выкаливание": ["аил", "акание", "акын", "алан", "анклав", "вал", "валенки", "валик", "век", "великан", "веник", "вилка", "вилы", "вина", "вливание", "вывал", "выливание", "ива", "иена", "ик", "икание", "ил", "инки", "каин", "кал", "калан", "калин", "калина", "кан", "канал", "канва", "кивание", "кил", "кила", "кина", "клан", "лава", "лавина", "лавка", "лак", "лаки", "ланка", "лев", "левак", "лек", "лиана", "ливанка", "ливы", "лик", "навал", "навивка", "навык", "накал", "налив", "наливка", "нева", "нива"],
    "выразитель": ["аил", "альт", "ар", "артель", "ваер", "вал", "валет", "вар", "вера", "верзила", "ветла", "виза", "вилы", "вира", "враль", "врез", "вылет", "вырез", "выть", "ель", "ерь", "завет", "зал", "залив", "зверь", "зев", "зева", "зет", "зритель", "ива", "ил", "лавр", "лазер", "лар", "ларь", "латы", "лев", "левират", "левит", "ливер", "ливр", "ливы", "лира", "литавры", "литер", "литера", "литр", "раз", "разлив", "рать", "ре", "реал", "резь", "релиз", "риал", "риза", "тавр", "таз", "тал", "талер", "тварь", "тир", "тире", "трал", "трель", "тыл"],
    "глухонемота": ["алеут", "ант", "аул", "аут", "ген", "глум", "го", "гомон", "гонт", "гул", "гумно", "гута", "енот", "лагун", "легат", "летун", "лом", "лоно", "лох", "луна", "мант", "манту", "мат", "мгла", "мена", "ментол", "мета", "метла", "метол", "меха", "могол", "мол", "молот", "монах", "монгол", "монета", "мот", "мох", "мул", "мулат", "мутаген", "муха", "мхат", "нагул", "намол", "нега", "немота", "нога", "нома", "нуга", "нут", "оленуха", "олеум", "олух", "омег", "омега", "омела", "омут", "отгон", "отлог", "отмах", "отмена", "охота", "тал", "талон", "танго", "тело", "теолог", "технолог", "тога", "тол", "том", "томан", "тон", "туман", "туна", "тунг", "угон", "улан", "улем", "умолот", "уха", "ухо", "хам", "хан", "хна", "хомут", "хон", "хота", "хунта"],
    "горбуша": ["ар", "арго", "ашуг", "багор", "бар", "боа", "бог", "бора", "бра", "бугор", "бур", "бура", "бург", "го", "гора", "горб", "граб", "гроб", "грош", "груша", "губа", "ор", "раб", "рагу", "роба", "рог", "убор", "угар", "шаг", "шар", "шоу", "шуба", "шуга", "бор"],
    "гортензия": ["ген", "героин", "героиня", "гинея", "гиря", "гит", "го", "гон", "гонт", "горе", "горин", "горн", "грот", "енот", "зенит", "зерно", "зет", "зонт", "зоря", "иго", "ион", "итог", "негр", "низ", "нория", "ор", "оргия", "орт", "отрез", "ре", "регион", "резня", "резон", "рея", "ринг", "рог", "рот", "теин", "тени", "тенор", "теория", "тигр", "тир", "тире", "тон", "тоня", "торг", "торги", "трен", "трио", "трог", "трон", "яр"],
    "декстрин": ["деист", "дек", "дети", "диск", "днестр", "дрек", "ик", "икс", "индекс", "иск", "кедр", "керн", "кисет", "кит", "кредит", "крен", "крест", "кретин", "крит", "рдест", "ре", "редис", "ринк", "рис", "риск", "сеид", "сени", "сет", "си", "сидр", "сирен", "скирд", "скит", "стек", "стен", "стенд", "стер", "стерин", "теин", "тени", "тик", "тир", "тире", "тирс", "тис", "трек", "трен", "треск"],
    "деноминация": ["ад", "анемия", "анемон", "анион", "анод", "аноним", "дан", "демон", "дина", "динамо", "дно", "до", "дом", "домен", "домна", "донна", "еда", "единица", "идея", "идиома", "иена", "иман", "имя", "индиец", "иод", "ион", "иония", "мания", "медиа", "медиация", "медицина", "мена", "ми", "мидия", "мина", "мини", "миоцен", "мода", "модница", "наин", "намин", "нация", "неон", "нома", "номад", "номинация", "нона", "ода", "ом", "цена", "циан", "цинния", "яд", "яма"],
    "джокер": ["дек", "декор", "джок", "до", "дож", "док", "докер", "дрек", "дрок", "едок", "жор", "кедр", "код", "корд", "корж", "кредо", "одр", "ор", "орк", "ре", "род", "рок"],
    "забавник": ["абаз", "абазин", "азан", "база", "бак", "банк", "банка", "бивак", "вабик", "ваза", "виза", "вина", "забивка", "заика", "знак", "ива", "изба", "ик", "кабан", "кабина", "казна", "каин", "кан", "канва", "кина", "кинза", "набивка", "наиб", "наказ", "нива", "низ", "низка"],
    "задевание": ["ад", "азан", "ваза", "веда", "вид", "виза", "вина", "дан", "дева", "девиз", "девиза", "деев", "диана", "диван", "диез", "дина", "еда", "езда", "зад", "задание", "заедание", "звание", "здание", "зев", "зева", "зевание", "ива", "иена", "наезд", "нева", "нива", "низ"],
    "инобытие": ["бетон", "бинт", "бит", "бон", "боны", "бот", "быт", "бытие", "енот", "ион", "обет", "теин", "тени", "тон", "тын"],
    "ископаемое": ["апис", "ас", "ик", "икс", "иск", "искомое", "кепи", "кипа", "киса", "ком", "кома", "коми", "компас", "копа", "коса", "маис", "мак", "маки", "ми", "миска", "мопс", "око", "окоп", "ом", "опак", "опека", "описка", "опоек", "оса", "осек", "осока", "оспа", "па", "пак", "пас", "паск", "пасмо", "пек", "пески", "песо", "песок", "пик", "пика", "пике", "пим", "писк", "поем", "поимка", "поиск", "покос", "помои", "саке", "сема", "си", "сип", "скип", "скоп", "скопа", "смак", "сок", "сом", "сома", "сопа", "сопка"],
    "кассатор": ["акр", "акт", "аорта", "ар", "арак", "арат", "арк", "арка", "артос", "ас", "астра", "кар", "кара", "карат", "карст", "карт", "карта", "касса", "каста", "кастор", "кат", "кора", "корт", "коса", "костра", "кот", "краса", "красота", "крат", "кроат", "кросс", "крот", "окрас", "ор", "орк", "орс", "орт", "оса", "осака", "оскар", "ост", "отара", "рак", "рака", "раса", "раскат", "раскос", "рок", "роса", "рост", "рот", "рота", "сакс", "скат", "скот", "сок", "сор", "сорт", "соска", "сотка", "срок", "ссора", "старка", "сток", "строка", "тако", "такса", "тасс", "ток", "тора", "торк", "торс", "тоска", "трак", "трасс", "трасса", "трок", "трос", "тара"],
    "квашнин": ["вина", "ива", "ик", "ишак", "каин", "кан", "кина", "наин", "нива", "ниша", "шванк", "ши", "шик", "шина", "шкив"],
    "коллапс": ["ас", "кал", "клоп", "кол", "копа", "копал", "коса", "лак", "лоск", "опак", "опал", "оса", "оскал", "оспа", "па", "пак", "пас", "паск", "пол", "пола", "полк", "полка", "сало", "салоп", "скало", "скол", "скоп", "скопа", "сок", "солка", "сопа", "сопка"],
    "концессия": ["ик", "икс", "инок", "ион", "иск", "кессон", "кино", "кисея", "кон", "конец", "косец", "нок", "нос", "носик", "оникс", "осек", "оссеин", "секция", "сени", "сено", "си", "синец", "синяк", "снос", "сок", "сон", "соня", "сосец", "сосняк", "соя", "цинк", "як", "янки", "яс"],
    "корифей": ["ик", "кефир", "кий", "кофе", "кофей", "кофр", "крой", "ор", "орк", "ре", "рей", "риф", "рой", "рок", "фойе"],
    "крематорий": ["акр", "ар", "арк", "атом", "ик", "икра", "йота", "каре", "карт", "кат", "катер", "кета", "киот", "кит", "ком", "кома", "комар", "комета", "коми", "кора", "корм", "корт", "кот", "край", "кратер", "крем", "кроат", "крот", "май", "майор", "мак", "макет", "маки", "март", "мат", "материк", "мера", "мерка", "метр", "метрика", "ми", "мир", "мирок", "мирр", "мирт", "митра", "мор", "море", "мортира", "мотка", "ом", "омар", "ор", "орт", "рай", "райком", "рак", "реактор", "рей", "рейтар", "река", "рема", "ритм", "рой", "рок", "ром", "рот", "рота", "ротик", "тайм", "таймер", "тако", "тема", "тик", "тир", "тире", "той", "ток", "токай", "томик", "тора", "торий", "торк", "трак", "трек", "тремор", "триера", "трио", "тройка", "трок"],
    "кукарекание": ["акание", "акр", "анкер", "анри", "ар", "арак", "арека", "арена", "арк", "арка", "аркан", "арника", "аура", "иена", "ик", "икра", "иранка", "каик", "каин", "кан", "кар", "кара", "каре", "каркание", "кенарка", "керн", "кика", "кина", "кирка", "кран", "краник", "крен", "крик", "крикун", "кринка", "кукан", "кун", "куна", "кунак", "кура", "курение", "накра", "наука", "нерка", "нукер", "раина", "рак", "рака", "рана", "ранка", "ре", "река", "ринк", "руина", "рука", "руна", "укание", "украинка", "уран", "урина", "урка", "урна"],
    "кульман": ["аул", "кал", "кан", "клан", "кулан", "куль", "кум", "кума", "кун", "куна", "лак", "лань", "лук", "лука", "луна", "лунка", "лунь", "мак", "манул", "мука", "мул", "нуль", "улан", "ум"],
    "купюра": ["акр", "ар", "арк", "кар", "карп", "каюр", "крап", "круп", "крупа", "купа", "кура", "па", "пак", "пар", "парк", "паук", "пук", "пурка", "рак", "рука", "урка", "урюк", "юр", "юра"],
    "лексика": ["аил", "ас", "ик", "икс", "ил", "иск", "каик", "кал", "кекс", "кика", "кикс", "кил", "кила", "киса", "киска", "клик", "клика", "лак", "лаки", "лек", "лес", "леса", "леска", "лик", "лиса", "лиска", "саке", "салки", "си", "сикл", "сила", "скак"],
    "мединститут": ["деист", "дети", "дунит", "дунст", "дуст", "индуист", "индус", "институт", "иудеи", "мент", "ми", "мини", "минус", "муст", "нудист", "нут", "сеид", "семит", "сени", "сет", "си", "сиенит", "сити", "стен", "стенд", "студент", "суд", "теин", "теист", "тени", "тент", "тест", "тис", "тиун", "тмин", "туес", "тун", "тут", "ум", "ус"],
    "минутка": ["акт", "ант", "аут", "ик", "иман", "каин", "камин", "кан", "кант", "кат", "кина", "кит", "кнут", "кум", "кума", "кун", "куна", "мак", "маки", "мант", "манту", "мат", "ми", "мина", "минута", "мука", "нитка", "нут", "танк", "тик", "тина", "тиун", "тмин", "тукан", "тумак", "туман", "тун", "туна", "туника", "ум", "умник", "униат", "утка"],
    "монетарист": ["анис", "арест", "аристон", "артем", "артос", "атеист", "атом", "атомист", "иман", "маис", "манси", "мант", "марс", "масон", "мастер", "мастит", "мат", "мена", "мета", "метр", "метро", "ми", "мир", "мирон", "мистер", "монист", "монтре", "мор", "морс", "мост", "наст", "натр", "нитрат", "нора", "нос", "омар", "орт", "осман", "ост", "отит", "рамс", "рант", "рента", "рис", "ром", "рост", "рота", "сан", "сантиметр", "сатинет", "семит", "сена", "сенат", "сет", "си", "сирота", "ситар", "смирна", "сон", "сонет", "сонм", "сортимент", "срам", "старт", "стеарин", "стена", "стер", "театр", "теист", "тенор", "термист", "термит", "термос", "тест", "тета", "тир", "тирс", "тис", "титан", "титр", "том", "томат", "тора", "торс", "тотем", "траст", "треста", "трио", "тритон", "трот"],
    "надсечка": ["ад", "ас", "дан", "дача", "дачка", "дек", "дека", "декан", "десна", "еда", "каданс", "кан", "кача", "насад", "наседка", "насечка", "сад", "саке", "сан", "сдача", "секач", "сена", "сечка", "скена", "чакан", "чан", "час", "чек", "чека"],
    "наложение": ["аил", "анион", "жало", "желание", "желе", "желна", "жена", "жила", "иена", "ил", "ион", "лаж", "лежание", "ложа", "ложе", "лонжа", "нажин", "наин", "нежин", "неон", "нож", "нона", "олеин", "оленина"],
    "написание": ["анис", "апис", "ас", "иена", "наин", "па", "пан", "пани", "панна", "пас", "пена", "пенис", "пенни", "пенс", "пина", "пинна", "писание", "писанина", "псина", "сан", "сани", "сапа", "сена", "сени", "си", "сиена", "синап", "сип", "спина"],
    "обращение": ["анри", "ар", "бар", "барин", "барон", "боа", "бон", "бона", "бора", "борение", "борщ", "бра", "ибер", "иена", "ион", "набор", "наиб", "нора", "обещание", "общение", "община", "ор", "раб", "ращение", "ре", "роба", "роение", "рона", "роща", "щербина", "щи", "бор"],
    "осознание": ["анион", "анис", "анонс", "ас", "занос", "знание", "зона", "иена", "износ", "ион", "наин", "нанос", "неон", "низ", "нона", "нос", "оаз", "оазис", "озон", "оса", "осина", "саз", "сан", "сани", "сезон", "сена", "сени", "сено", "си", "сиена", "сознание", "сон"],
    "отблеск": ["бек", "бел", "белок", "бес", "блеск", "блок", "бок", "бокс", "болт", "боскет", "бот", "кеб", "клот", "кол", "кот", "лек", "лес", "лесок", "лето", "леток", "лоб", "лоск", "лот", "обет", "осек", "ост", "отсек", "село", "сет", "скол", "скот", "слот", "сок", "стек", "стекло", "сток", "стол", "столб", "тело", "телок", "тесло", "ток", "тол", "толк"],
    "отстранение": ["анион", "анис", "анортит", "ант", "аорист", "арест", "артист", "атеист", "иена", "интерес", "интернат", "интернет", "наин", "наст", "настроение", "натрон", "нитрат", "нона", "нос", "ор", "орт", "осетрина", "осина", "остеит", "остин", "острение", "ратин", "ре", "рента", "реостат", "рис", "роение", "росинант", "рост", "сани", "сатинет", "сенат", "сера", "серна", "сет", "си", "сиена", "сирен", "сирена", "сирота", "сито", "сон", "сонант", "сонет", "сорит", "сорт", "сотерн", "стан", "старт", "статор", "стен", "стена", "стер", "стерин", "стрит", "танин", "тарист", "тат", "театр", "теин", "тени", "тент", "тесание", "теснота", "тест", "тесто", "тета", "тина", "тиран", "тирс", "титан", "тон", "тонна", "торит", "торс", "торт", "тостер", "транс", "трение", "трест", "триас", "трио", "троение", "трос", "трот"],
    "паутинка": ["акант", "акт", "актау", "ант", "аут", "ик", "каин", "кан", "канат", "кант", "капитан", "каптан", "капут", "кат", "кина", "кипа", "кипу", "кит", "кнут", "кун", "куна", "купа", "накат", "наука", "нитка", "нут", "па", "пак", "пакт", "пан", "пани", "паника", "панк", "пат", "патан", "паук", "паутина", "пик", "пика", "пикан", "пина", "пинта", "пуант", "пук", "пункт", "путина", "путник", "танк", "тапка", "тик", "тина", "тип", "типун", "тиун", "тукан", "тун", "туна", "туника", "тупик", "униат", "униатка", "утка"],
    "поднебесная": ["ад", "анод", "анонс", "ас", "баден", "баня", "бас", "басня", "басон", "баян", "беда", "бес", "беседа", "боа", "бон", "бона", "бонна", "дан", "даос", "депо", "десна", "дно", "до", "донна", "еда", "нанос", "неон", "непоседа", "нона", "нос", "обед", "обедня", "ода", "оса", "оспа", "па", "паб", "пан", "панно", "пас", "пена", "пенс", "пенсне", "пеня", "песня", "песо", "победа", "посад", "пояс", "сабо", "сад", "сан", "сдоба", "сена", "сено", "сеноед", "сноб", "сноп", "сода", "сон", "соня", "сопа", "соя", "спад", "ябеда", "яд", "яс"],
    "прелесть": ["ель", "ересь", "ерь", "леер", "лепет", "лес", "лесть", "перл", "перль", "перс", "перст", "пест", "плеер", "плеть", "прель", "ре", "рельс", "репс", "сель", "серп", "сет", "сеть", "спель", "степ", "степь", "стер", "трель", "треп", "трепел"],
    "прибалтика": ["аил", "акрил", "алиби", "апилак", "араб", "арак", "арба", "арбат", "арк", "арка", "бак", "балка", "балтика", "бар", "барит", "барк", "барка", "бирка", "бита", "битки", "блик", "бра", "брат", "братик", "икра", "ил", "иприт", "кал", "калибр", "капрал", "карат", "карп", "карта", "кил", "кила", "кипа", "клир", "крипта", "лаки", "лапка", "лапта", "лар", "лата", "липа", "липка", "лира", "лирик", "лирика", "литр", "пак", "пакт", "палитра", "пар", "параклит", "пари", "парик", "парк", "пат", "пиала", "пиар", "пик", "пика", "пила", "пилка", "пират", "пирит", "плакат", "плат", "плата", "плита", "плитка", "прибалт", "раб", "раба", "рака", "ракита", "рапа", "риал", "тал", "талиб", "талик", "тапир", "тапка", "тиара", "тип", "тир", "трал", "трап", "триба", "тара"],
    "призвание": ["анри", "ар", "ваер", "вар", "вера", "виза", "вина", "вира", "врез", "запев", "звание", "зев", "зева", "ива", "иена", "инвар", "напев", "нева", "нерв", "нерпа", "нива", "низ", "нрав", "па", "паз", "пан", "пани", "пар", "парез", "пари", "пена", "перина", "пиар", "пина", "пир", "приз", "раз", "ре", "резина", "репа", "репина", "риза"],
    "проволока": ["акр", "ар", "арк", "вал", "вар", "вокал", "вол", "волк", "волок", "вор", "кал", "капор", "кар", "карп", "клоп", "ков", "кол", "копа", "копал", "кора", "корова", "крап", "кров", "лавр", "лак", "лар", "лов", "лор", "овал", "око", "окова", "окоп", "окрол", "олово", "опак", "опал", "опор", "опора", "опорок", "ор", "орк", "орок", "па", "пак", "паоло", "пар", "парк", "парок", "плав", "плов", "повал", "повар", "поволока", "пол", "пола", "полк", "полка", "поло", "полок", "пора", "порка", "порок", "право", "провал", "прок", "прокол", "рак", "раколов", "ров", "рок", "рол", "ропак"],
    "прорезка": ["акр", "ар", "арк", "запор", "зарок", "зек", "капер", "капор", "кар", "каре", "карп", "коза", "копа", "кора", "крап", "крез", "креп", "оаз", "опак", "опека", "опера", "ор", "орк", "па", "паз", "пак", "пар", "парез", "парк", "парок", "пек", "перо", "поза", "показ", "покер", "пора", "порез", "порезка", "порка", "проза", "прок", "прорез", "раз", "разок", "рак", "ре", "резак", "резка", "река", "репа", "репка", "роза", "рок", "рокер", "ропак"],
    "прямота": ["ар", "атом", "март", "мат", "мор", "мот", "мята", "ом", "омар", "опт", "ор", "орт", "па", "пар", "паром", "паря", "пат", "пора", "порт", "пот", "пята", "ром", "рот", "рота", "том", "топ", "тора", "трап", "тромп", "троп", "тропа", "яма", "яр"],
    "пугало": ["агул", "аул", "галоп", "го", "гол", "гул", "лаг", "лог", "луг", "лупа", "огпу", "опал", "па", "плуг", "пол", "пола", "пул", "пула", "пуло", "угол"],
    "развозчица": ["авар", "ар", "арча", "ваза", "вар", "взор", "виза", "вира", "вица", "воз", "вор", "врач", "зазор", "зов", "зраза", "ива", "извоз", "оаз", "овца", "овчар", "ор", "орава", "раз", "развоз", "риза", "ров", "роза", "чаво", "чара"],
    "раздор": ["ад", "ар", "дар", "до", "доза", "дора", "зад", "задор", "оаз", "ода", "одр", "ор", "орда", "раз", "род", "роза"],
    "разработка": ["абаз", "абака", "азарт", "азот", "акароз", "акр", "акробат", "акт", "аозт", "аорта", "араб", "арабка", "арак", "арарат", "арат", "арбат", "арка", "артроз", "атака", "база", "базар", "бак", "бар", "барак", "барк", "барка", "батрак", "боа", "бора", "борт", "бот", "бра", "брат", "брокат", "забота", "закат", "заток", "затор", "зоб", "кар", "кара", "карат", "карра", "карт", "карта", "кат", "кобза", "кобра", "коза", "кора", "корт", "кот", "краб", "крат", "кроат", "крот", "оаз", "обкат", "образ", "обрат", "ор", "орк", "орт", "отара", "отказ", "раб", "раба", "работа", "работка", "раз", "разбор", "разборка", "разок", "рак", "рака", "роба", "роза", "рок", "рот", "рота", "табак", "табор", "таз", "тако", "ток", "тора", "торба", "торк", "трак", "трок", "тара", "бор"],
    "распилка": ["акр", "акрил", "апилак", "апис", "ар", "арап", "арк", "арка", "ас", "ик", "икра", "икс", "ил", "иск", "искра", "кал", "каприс", "кар", "карп", "кил", "кипа", "кираса", "киса", "клипс", "клир", "крап", "краса", "лак", "лаки", "лапа", "лапка", "лар", "ласа", "ласка", "лик", "липа", "липка", "лира", "лиса", "лиска", "па", "пак", "палас", "палка", "пар", "пара", "пари", "парик", "парилка", "парк", "парс", "пас", "паск", "пиала", "пиар", "пик", "пика", "пила", "пилка", "пир", "пирс", "писака", "писк", "плис", "плиска", "раис", "рак", "рака", "рапа", "рапс", "раса", "распил", "риал", "рис", "риск", "риска", "салки", "сапа", "сапка", "си", "сикл", "сила", "сип", "скала", "скип", "скрап", "скрип", "слип", "спил", "спилка"],
    "растирание": ["аист", "анис", "анри", "ант", "ар", "арат", "арена", "арест", "ас", "астра", "иена", "иранист", "ирис", "истина", "наитие", "нарта", "наст", "натр", "раина", "раис", "рана", "ранет", "рант", "раса", "растр", "ратин", "ре", "рената", "рента", "ретина", "ринит", "рис", "сан", "сани", "санитар", "сатин", "сатир", "сатира", "сена", "сенат", "сени", "сера", "серна", "сет", "си", "сиена", "сиенит", "сиерра", "сирен", "сирена", "ситар", "сити", "стан", "старание", "старина", "стеарин", "стен", "стена", "стер", "стерин", "страна", "таран", "теин", "тени", "терраса", "тесина", "тиара", "тина", "тир", "тиран", "тире", "тирс", "тис", "транс", "трен", "триас", "триер", "триера", "тара"],
    "самоанализ": ["азан", "аил", "алан", "алмаз", "анализ", "анис", "ас", "зал", "зала", "занос", "заслон", "засол", "зло", "зола", "зона", "излом", "измол", "износ", "ил", "иман", "ион", "ислам", "лама", "ласа", "лиана", "лиман", "лимон", "линза", "лиса", "лоза", "лозина", "лом", "лосина", "маис", "мала", "малина", "мана", "манси", "маслина", "масло", "масон", "ми", "милан", "мина", "мол", "налим", "намаз", "намол", "низ", "нома", "нос", "оаз", "оазис", "ом", "оса", "осина", "осман", "саам", "саами", "саз", "сазан", "сало", "салон", "саман", "сан", "сани", "си", "сила", "силон", "слом", "слон", "смола", "соли", "сом", "сома", "сон", "сонм", "зима"],
    "самозащита": ["азиат", "азот", "аист", "аозт", "ас", "астма", "атом", "защита", "истома", "маис", "маоист", "мат", "ми", "митоз", "мозаист", "мост", "мот", "моща", "оаз", "оазис", "ом", "оса", "ост", "саам", "саами", "саз", "си", "сито", "сом", "сома", "таз", "тис", "том", "щи", "щит", "зима"],
    "синева": ["анис", "ас", "васин", "вес", "весна", "вина", "вис", "ива", "иена", "навес", "навис", "нева", "нива", "сан", "сани", "сван", "сев", "сена", "сени", "си", "сиена"],
    "синтепон": ["енот", "ион", "неон", "нонет", "нос", "нотис", "опт", "осетин", "ост", "остин", "пенис", "пенни", "пенс", "песо", "пест", "петин", "пион", "пистон", "питон", "пони", "понт", "пост", "пот", "сени", "сено", "сет", "си", "сип", "сито", "сноп", "сон", "сонет", "спинет", "стен", "степ", "стон", "теин", "тени", "теннис", "тип", "тис", "тон", "топ"],
    "сифонофора": ["анис", "анри", "ар", "ас", "ион", "нора", "нос", "ор", "орс", "оса", "осина", "офис", "раис", "рис", "риф", "рона", "роса", "сан", "сани", "си", "сифон", "сон", "сор", "софа", "софора", "фа", "фарс", "фасон", "фирн", "фифа", "фон", "фора", "форс", "фосфор"],
    "склёпщица": ["аил", "апис", "ас", "ёлка", "ик", "икс", "ил", "иск", "кал", "кил", "кила", "кипа", "киса", "клип", "клипс", "клипса", "лак", "лаки", "лик", "липа", "липка", "лиса", "лиска", "па", "паёк", "пак", "пас", "паск", "пёс", "пёсик", "пик", "пика", "пила", "пилка", "писк", "пища", "плац", "плащ", "плащик", "плёс", "плис", "плиска", "плица", "саёк", "салки", "си", "сикл", "сила", "сип", "скип", "слип", "спил", "спилка", "спица", "цикл", "цска", "щи"],
    "смелость": ["ель", "лес", "лесть", "лето", "лом", "лось", "лот", "мел", "мелос", "мель", "место", "месть", "метол", "мол", "моль", "мост", "мосье", "мот", "мотель", "мсье", "ом", "омлет", "ост", "ость", "ось", "отель", "отмель", "село", "сель", "семь", "сет", "сеть", "слом", "слот", "смесь", "смоль", "соль", "сом", "стол", "тело", "темь", "тесло", "тол", "толь", "том"],
    "сроднение": ["дно", "до", "доение", "дорн", "иод", "ион", "неон", "норд", "нос", "одр", "ор", "орден", "орс", "рдение", "ре", "редис", "ренонс", "рис", "род", "роение", "сеид", "сени", "сено", "сеноед", "си", "сидр", "синод", "сирен", "сон", "сор"],
    "стенопись": ["енот", "ион", "иссоп", "нить", "нос", "нотис", "опись", "опт", "осень", "осетин", "оссеин", "ост", "остин", "ость", "ось", "пенис", "пенс", "пень", "песнь", "песо", "пест", "петин", "пион", "пистон", "питон", "пони", "понт", "пост", "пот", "потесь", "сени", "сено", "сень", "сет", "сеть", "си", "синь", "сип", "сито", "сноп", "снос", "сон", "сонет", "спесь", "спинет", "стен", "степ", "степс", "степь", "стон", "теин", "тени", "тень", "тип", "тис", "тон", "топ", "топь"],
    "стрела": ["ар", "арест", "ас", "лар", "ласт", "лес", "леса", "ре", "реал", "сера", "сет", "стела", "стер", "тал", "талер", "талес", "трал"],
    "сценичность": ["енот", "ион", "истец", "неон", "нечисть", "нить", "нонет", "нос", "нотис", "ночь", "осень", "осетин", "оссеин", "ост", "остин", "ость", "ось", "отец", "сени", "сено", "сень", "сет", "сеть", "си", "синец", "синь", "ситец", "сито", "снос", "сон", "сонет", "сосец", "сочень", "стен", "стон", "теин", "тени", "теннис", "тень", "течь", "тис", "тон", "ценность", "цент", "честь", "чин", "чинность", "чистец", "чтец"],
    "телебашня": ["ант", "бал", "балет", "бант", "баня", "батя", "башня", "баян", "бел", "белена", "беляна", "беляш", "бета", "блат", "лента", "лея", "ля", "тал", "тлен", "тля", "шатен", "шен", "шея", "шлея", "штаб", "ял"],
    "термометр": ["мем", "метеор", "метр", "метро", "мор", "море", "мот", "мотет", "ом", "омметр", "ор", "орт", "ре", "реометр", "ром", "рот", "терем", "том", "торт", "тотем", "тремор", "трот"],
    "требование": ["авто", "автор", "ант", "бант", "бар", "барин", "барит", "баронет", "батон", "берет", "бета", "бетон", "бит", "бита", "битва", "бон", "бона", "бора", "борение", "борт", "бот", "ботва", "брат", "бревно", "ваер", "варение", "ватин", "веер", "венера", "вера", "верба", "вербена", "ветер", "ветеран", "вина", "вино", "вира", "вона", "вор", "евреи", "енот", "ибер", "ива", "иена", "инвар", "ион", "набор", "навет", "натр", "нева", "неврит", "нерв", "нива", "нора", "нота", "нрав", "обрат", "овен", "овин", "ор", "орбита", "отбив", "отвар", "ранет", "ратин", "рвение", "ре", "ренет", "рента", "роба", "ров", "рона", "рот", "табор", "таврение", "тавро", "творение", "тени", "тенор", "тина", "тиран", "тире", "товар", "тон", "торба", "торбан", "трен", "трение", "триба", "троение", "бор"],
    "трешкоут": ["кеш", "кореш", "корт", "кот", "крот", "куш", "октет", "ор", "орк", "орт", "ре", "рок", "рот", "ток", "торк", "торт", "трек", "трешкот", "трок", "трот", "туер", "тур", "турок", "тут", "тутор", "туш", "укор", "урок", "уток", "утор", "утро", "ушко", "шкерт", "шкот", "шок", "шоу", "шрот", "штрек", "шут"],
    "удабривание": ["абвер", "абердин", "авар", "ад", "анвар", "ар", "арба", "арена", "аренда", "аура", "баден", "бадин", "банда", "бар", "баран", "бард", "барин", "беда", "бедуин", "бенуар", "бердан", "бивни", "бред", "бредни", "бренди", "будни", "буер", "бур", "бура", "буран", "бурда", "вар", "варан", "вбирание", "ведун", "веранда", "вид", "вира", "вруб", "врубание", "врун", "даба", "дар", "даур", "дебри", "диана", "диван", "дина", "дрена", "дубина", "дубрава", "дуриан", "ерунда", "ива", "иена", "инвар", "иуда", "иудеи", "надир", "надруб", "надув", "наиб", "нарва", "нард", "нева", "недра", "нерв", "нива", "нрав", "раб", "раба", "рада", "радиан", "раина", "рана", "раунд", "ре", "редан", "рубин", "руда", "руина", "руна", "увар", "удав", "удар", "уран", "урина", "урна"],
    "фальшивка": ["аил", "альфа", "афиша", "вал", "валик", "вилка", "ива", "ик", "ил", "илька", "ишак", "кал", "калиф", "каша", "кил", "кила", "киль", "клавиш", "клавиша", "лава", "лаваш", "лавка", "лак", "лаки", "лафа", "лик", "лиф", "фа", "фал", "фиал", "фиалка", "фила", "фиш", "фишка", "флик", "шавка", "шакал", "шала", "шаль", "шваль", "ши", "шик", "шкала", "шкаф", "шквал", "шкив", "шлак", "шлиф"],
    "федералист": ["ад", "аил", "аист", "ар", "арфист", "аферист", "дар", "десерт", "дефис", "диета", "еда", "идеал", "ил", "лад", "лар", "ласт", "лафет", "леди", "леер", "лес", "леса", "летие", "лидер", "лиса", "литер", "литера", "лиф", "лифт", "радист", "раис", "рдест", "ре", "реал", "реалист", "редис", "риал", "рис", "риф", "сад", "сард", "сатир", "сеид", "селитра", "селфи", "сера", "середа", "сериал", "сет", "си", "сидерат", "сидр", "сила", "ситар", "след", "среда", "стела", "стер", "стрела", "сфалерит", "сфера", "тал", "талер", "талес", "тариф", "тир", "тире", "тирс", "тис", "тиф", "трал", "триас", "фа", "фал", "фалерист", "фарс", "фарт", "фасет", "фат", "федерал", "федерат", "фес", "фетр", "фиал", "фиат", "фиеста", "фила", "филе", "фита", "флат", "флирт"],
    "хлорка": ["акр", "ар", "арк", "кал", "кар", "кол", "кора", "крах", "кроха", "лак", "лар", "лор", "лох", "ор", "орк", "охра", "рак", "рок", "рол", "хлор", "холка", "хор", "хорал"],
    "хохотание": ["ант", "енот", "иена", "ион", "неохота", "нота", "охание", "охота", "теин", "тени", "тина", "тон", "хан", "хина", "хит", "хитон", "хна", "хон", "хота", "хохот"],
    "щеглёнок": ["ген", "го", "гол", "гон", "клён", "клещ", "клон", "кол", "кон", "лек", "лён", "лещ", "лог", "нок", "щегол", "щелк", "щёлок", "щенок"],
    "эмират": ["ар", "ирма", "мари", "март", "мат", "ми", "мир", "мирт", "мирта", "митра", "мэр", "мэри", "мэтр", "ритм", "тир", "эмир", "эра"],
    "подбородок": ["бок", "брод", "до", "добор", "добро", "док", "дрок", "код", "корд", "короб", "обод", "ободок", "оброк", "одр", "око", "окоп", "опор", "опорок", "ор", "орк", "орок", "побор", "подбор", "порок", "прок", "род", "рок", "бор"],
    "подросток": ["до", "док", "доктор", "допрос", "дот", "дрок", "код", "копт", "корд", "корт", "кот", "крот", "одр", "око", "окоп", "окот", "опор", "опорок", "опорос", "опрос", "опт", "ор", "орк", "орок", "орс", "орт", "ортодокс", "осот", "ост", "откос", "отоскоп", "отпор", "отрок", "подток", "покос", "порок", "порт", "пост", "пот", "поток", "прок", "прокос", "просо", "проток", "род", "родос", "рок", "рокот", "ропот", "рост", "росток", "рот", "скоп", "скот", "сок", "сор", "сорт", "спор", "спорок", "спорт", "срок", "сток", "стопор", "строп", "ток", "топ", "топор", "торк", "торос", "торс", "трок", "троп", "трос"],
    "прообраз": ["ар", "бар", "боа", "бора", "бра", "забор", "запор", "зоб", "оаз", "обзор", "обоз", "образ", "опор", "опора", "ор", "па", "паб", "паз", "пар", "побор", "поза", "позор", "пора", "проба", "пробор", "проза", "прораб", "раб", "раз", "разбор", "роба", "роза", "бор"],
    "пульсация": ["аил", "апис", "ас", "аул", "ил", "липа", "лиса", "лупа", "ля", "ляп", "ляпис", "па", "палия", "пас", "паяц", "пила", "плац", "плис", "плица", "пляс", "пул", "пула", "пульс", "пуля", "пяла", "си", "сиаль", "сила", "силь", "сип", "слип", "спил", "спица", "сулица", "суп", "улица", "ус", "цапля", "ял", "яс", "ясли"],
    "родник": ["дно", "до", "док", "дорн", "дрок", "ик", "инок", "иод", "ион", "кино", "код", "кон", "корд", "корн", "нок", "норд", "одр", "ор", "орк", "ринк", "род", "рок"],
    "студень": ["день", "дунст", "дуст", "нут", "сень", "сет", "сеть", "снедь", "стен", "стенд", "суд", "суть", "тень", "туес", "тун", "ус", "устье"],
    "томагавк": ["авто", "агат", "акт", "атом", "вага", "вата", "ватка", "гавот", "гамак", "го", "кагат", "кат", "квота", "ков", "ком", "кома", "кот", "маг", "мак", "мат", "матка", "мот", "мотка", "октава", "ом", "отава", "отвага", "тако", "тамга", "тога", "ток", "том"],
    "флорист": ["ил", "илот", "лист", "литр", "лиф", "лифт", "лор", "лори", "лот", "ор", "орс", "орт", "орфист", "ост", "офис", "офит", "рис", "риф", "рол", "рост", "рот", "си", "сито", "ситро", "слот", "соли", "сор", "сорит", "сорт", "софит", "стирол", "стол", "тир", "тирс", "тис", "тиф", "тол", "торс", "торф", "трио", "трос", "флирт", "флот", "фол", "форс", "форт", "фот", "фтор"],
    "абажур": ["ажур", "ар", "араб", "арба", "аура", "бар", "баржа", "бра", "буж", "бур", "бура", "жаба", "жабра", "жар", "жара", "раб", "раба", "уж"],
    "адмирал": ["ад", "аил", "аларм", "ар", "дама", "дар", "драма", "ил", "ирма", "лад", "лада", "лама", "лар", "лира", "мала", "мара", "марал", "мари", "ми", "мир", "рада", "рама", "риал"],
    "интрига": ["анри", "ант", "ар", "гарт", "гит", "гитан", "гран", "гранит", "грант", "игра", "ирга", "натр", "ранг", "рант", "ратин", "ринг", "ринит", "тигр", "тина", "тир", "тиран"],
    "коленка": ["кал", "кан", "клан", "клок", "клон", "кок", "кока", "кол", "колена", "кон", "конка", "лак", "лек", "нок", "океан"],
    "костёр": ["корт", "кот", "крот", "ор", "орк", "орс", "орт", "осётр", "ост", "отёк", "рок", "рост", "рот", "скот", "сок", "сор", "сорт", "срок", "сток", "тёс", "ток", "торк", "торс", "трок", "трос"],
    "критика": ["акр", "акт", "ар", "арк", "ик", "икра", "каик", "кар", "карт", "кат", "кика", "кирка", "кит", "крат", "крик", "крит", "критик", "рак", "тик", "тир", "трак"],
    "малахит": ["аил", "ил", "лама", "ламаит", "лата", "мала", "мат", "мах", "ми", "мхат", "тал", "хала", "халат", "хам", "хамит", "хата", "хит", "хлам"],
    "паровоз": ["ар", "вар", "взор", "воз", "вор", "запор", "зов", "оаз", "опор", "опора", "ор", "па", "паз", "пар", "повар", "поза", "позор", "пора", "право", "провоз", "проза", "раз", "ров", "роза"],
    "поломка": ["кал", "клоп", "кол", "ком", "кома", "копа", "копал", "лак", "лом", "ломка", "мак", "мол", "молока", "око", "окоп", "ом", "опак", "опал", "па", "пак", "паоло", "пол", "пола", "полк", "полка", "поло", "полок", "помол"],
    "потолок": ["клоп", "клот", "кол", "копт", "кот", "лот", "лото", "лоток", "око", "окоп", "окот", "оплот", "опт", "откол", "плот", "пол", "полк", "поло", "полок", "пот", "поток", "ток", "тол", "толк", "топ"],
    "суходол": ["до", "дол", "досол", "дуло", "дух", "лох", "одул", "олух", "слух", "соло", "солод", "суд", "сход", "удол", "ус", "ухо", "уход", "ход", "холод", "худо"],
    "туземка": ["азу", "акт", "аут", "закут", "зек", "зет", "кат", "кета", "кум", "кума", "мазут", "мак", "макет", "мат", "мета", "муза", "мука", "таз", "тема", "туз", "тумак", "указ", "ум", "утка"],
    "фиаско": ["ас", "ик", "икс", "иск", "киса", "коса", "оса", "офис", "си", "скиф", "сок", "софа", "фа", "факс", "фикс"],
    "цесарка": ["акр", "ар", "арак", "арека", "арк", "арка", "ас", "аскер", "кар", "кара", "каре", "краса", "рак", "рака", "раса", "ре", "река", "саке", "сера", "цска"],
    "молодчина": ["ад", "аил", "анод", "дан", "дина", "динамо", "длина", "дно", "до", "дол", "долина", "доломан", "дом", "домино", "домна", "идол", "ил", "иман", "иод", "ион", "лад", "ладо", "лиман", "лимон", "лимонад", "лич", "лом", "лоно", "ми", "милан", "мина", "мода", "мол", "моча", "мочало", "мочило", "надлом", "налим", "намол", "нома", "номад", "ода", "ом", "чадо", "чал", "чан", "чин", "чина"]
  };

  let doDeleteBlock;
    let allDoneWords = localStorage.getItem('allDoneWords');
  let tips = localStorage.getItem('tips');
  let sounds = localStorage.getItem('sounds');
  let loc = 0;
  let allStars = [];
  let isRules = false;
  let allLocations = Math.floor(allWords.length / 21);
  if(allDoneWords){
    allDoneWords = JSON.parse(allDoneWords);
    tips = Number(tips);
    sounds = sounds === 'true';
    setLoc();
  }else{
    allDoneWords = {};
    tips = 3;
    isRules = true;
    sounds = true;
    localStorage.setItem('sounds', true);
    localStorage.setItem('allDoneWords', JSON.stringify(allDoneWords));
    localStorage.setItem('tips', 3);

    if (playerGame){
      playerGame.setData({tips: 3}).then((ignored) => {});
      playerGame.setData({sounds: true}).then((ignored) => {});
      playerGame.setData({allDoneWords: {}}).then((ignored) => {});
    }


    allWords.forEach((key => {
      allDoneWords[key] = [];
    }));
    for(let i = 0; i < allWords.length; i++){
      allStars.push(0);
    }
  }
  function setLoc() {
    allWords.forEach((key => {
      if(allDoneWords[key]){
        allStars.push(testStar(allDoneWords[key].length, wordsFromWords[key].length))
      }else{
        allDoneWords[key] = [];
        allStars.push(0);
      }
    }));
    localStorage.setItem('allDoneWords', JSON.stringify(allDoneWords));
    let lastLevel = allStars.length-1;
    for(let i = 0; i < allStars.length; i++){
      if(allStars[i] === 0){
        lastLevel = i;
        break;
      }
    }
    loc = Math.floor((lastLevel / 21));
    if(allStars.reduce((acc, st)=>{
      return acc + st;
    }, 0) < loc*33){
      loc--;
    }
    if(loc >= allLocations || loc < 0) loc = 0;
  }
  if(window.YaGames){
    window.YaGames.init({
      adv: {
        onAdvClose: wasShown => {
          if(!wasShown) advTime = true;
        }
      }
    }).then(ysdk => {
      initPlayer(ysdk);
      showAdv = () => {
        ysdk.adv.showFullscreenAdv({
          callbacks: {
            onClose: function() {
              advTime = false;
              setTimeout(()=>{
                advTime = true;
              }, 220000);
            }
          }
        });
      };
    });
  }else{
    doDeleteBlock = true;
  }
  function update() {
    if (document.querySelector('.levels')) {
      document.querySelector('.levels').dispatchEvent(new CustomEvent("updateAll"));
    }

  }
  function initPlayer(ysdk) {
    ysdk.getPlayer().then(_player => {
      // Игрок авторизован.
      playerGame = _player;
      playerGame.getData().then((dataObject) => {
        if (dataObject.allDoneWords) allDoneWords = dataObject.allDoneWords;
        if (dataObject.tips) tips = dataObject.tips;
        if (dataObject.sounds) sounds = dataObject.sounds;
        update();
      }).catch((e) => {
        console.log(e);
        update();
      });
    }).catch((e) => {
      console.log(e);
      update();
    });
  }







  function testStar(doneWordsLength, allWordsLength) {
    if(doneWordsLength === allWordsLength) return 3;
    let percent = Math.floor(doneWordsLength / allWordsLength * 100);
    if(percent >= 66) return 2;
    if(percent >= 33) return 1;
    return 0;
  }
  const NewAudioContext = (function() {

    try {
      window.AudioContext = window.AudioContext || window.webkitAudioContext;
      window.audioContext = new window.AudioContext();
    } catch (e) {
      console.log("No Web Audio API support");
    }
    /*
     * WebAudioAPISoundManager Constructor
     */
    var WebAudioAPISoundManager = function (context) {
      this.context = context;
      this.bufferList = {};
      this.playingSounds = {};
    };

    /*
     * WebAudioAPISoundManager Prototype
     */
    WebAudioAPISoundManager.prototype = {
      addSound: function (url) {
        // Load buffer asynchronously
        var request = new XMLHttpRequest();
        request.open("GET", url, true);
        request.responseType = "arraybuffer";

        var self = this;

        request.onload = function () {
          // Asynchronously decode the audio file data in request.response
          self.context.decodeAudioData(
                  request.response,

                  function (buffer) {
                    if (!buffer) {
                      console.log('error decoding file data: ' + url);
                      return;
                    }
                    self.bufferList[url] = buffer;
                  });
        };

        request.onerror = function () {
          console.log('BufferLoader: XHR error');
        };

        request.send();
      },
      stopSoundWithUrl: function(url) {
        if(this.playingSounds.hasOwnProperty(url)){
          for(var i in this.playingSounds[url]){
            if(this.playingSounds[url].hasOwnProperty(i)) {
              this.playingSounds[url][i].stop(0);
            }
          }
        }
      }
    };

    /*
     * WebAudioAPISound Constructor
     */
    var WebAudioAPISound = function (url, options) {
      this.settings = {
        loop: false
      };

      for(var i in options){
        if(options.hasOwnProperty(i)) {
          this.settings[i] = options[i];
        }
      }

      this.url = url + '.mp3';
      this.volume = 1;
      window.webAudioAPISoundManager = window.webAudioAPISoundManager || new WebAudioAPISoundManager(window.audioContext);
      this.manager = window.webAudioAPISoundManager;
      this.manager.addSound(this.url);
      // this.buffer = this.manager.bufferList[this.url];
    };

    /*
     * WebAudioAPISound Prototype
     */
    WebAudioAPISound.prototype = {
      play: function () {
        var buffer = this.manager.bufferList[this.url];
        //Only play if it loaded yet
        if (typeof buffer !== "undefined") {
          var source = this.makeSource(buffer);
          source.loop = this.settings.loop;
          source.start(0);

          if(!this.manager.playingSounds.hasOwnProperty(this.url)) {
            this.manager.playingSounds[this.url] = [];
          }
          this.manager.playingSounds[this.url].push(source);
        }
      },
      stop: function () {
        this.manager.stopSoundWithUrl(this.url);
      },
      getVolume: function () {
        return this.translateVolume(this.volume, true);
      },
      //Expect to receive in range 0-100
      setVolume: function (volume) {
        this.volume = this.translateVolume(volume);
      },
      translateVolume: function(volume, inverse){
        return inverse ? volume * 100 : volume / 100;
      },
      makeSource: function (buffer) {
        var source = this.manager.context.createBufferSource();
        var gainNode = this.manager.context.createGain();
        source.connect(gainNode);
        gainNode.gain.value = this.volume;
        source.buffer = buffer;
        // source.connect(gainNode);
        gainNode.connect(this.manager.context.destination);
        return source;
      }
    };

    return WebAudioAPISound;
  })();

  let wrongWordSound = new NewAudioContext('wrong-word2');
  let doneWordSound = new NewAudioContext('done-word');
  let starVolume = new NewAudioContext('star');
  let newLevel = new NewAudioContext('new-level');
  let clickSound = new NewAudioContext('click');


  function params(data) {
    try{
      // eslint-disable-next-line no-undef
      ym(57682372, 'params', data);
      // eslint-disable-next-line no-empty
    }catch(ignored){}
  }
  let iOS = /iPad|iPhone|iPod/.test(navigator.userAgent) && !window.MSStream;
  if(iOS){
    document.documentElement.addEventListener('gesturestart', function (event) {
      event.preventDefault();
    }, false);
  }
  export default {
    name: 'App',
    data(){
      return {
        levels: true,
        content: false,
        lvl: 0,
        letters: [],
        selectedLetters: [],
        wordFromLetter: '',
        numOfLevels: allWords.length,
        location: loc,
        allLocations: allLocations,
        stars: allStars,
        nowWords: [],
        doneWords: [],
        tipCount: tips,
        isBadWord: false,
        rules: isRules,
        levelsAnim: false,
        newWord: '',
        animWord: '',
        words: '',
        getStar: -1,
        animWordStart: '',
        isSounds: sounds,
        advShowNow: false
      }
    },
    computed:{
      allStars(){
        return this.stars.reduce((acc, el)=> acc+ el, 0);
      },
    },
    methods:{
      updateAll() {
        allStars = [];
        loc = 0;
        setLoc();
        this.stars = allStars;
        this.rules = false;
        this.location = loc;
        this.tipCount = tips;
        this.isSounds = sounds;
        if (document.querySelector(".pre-download")) {
          document.querySelector(".pre-download").remove()
        }
      },
      getLevel(lvl){
        if(this.isCloseLevelShow(lvl+1))return;
        if(lvl === 200){
          params({'200': 1});
        } else if(lvl === 100){
          params({'100': 1});
        }
        this.advShowNow = false;
        this.levelsAnim = false;
        if(this.isSounds){
          newLevel.play();
        }

        this.getStar = -1;
        setTimeout(()=>{
          this.levels = false;
        }, 500);

        this.content = true;

        this.newWord ='';
        this.animWord ='';
        this.animWordStart = '';

        this.lvl = lvl;
        this.wordFromLetter = '';
        this.word = allWords[lvl];
        this.doneWords = allDoneWords[this.word];
        this.selectedLetters = [];

        this.letters = this.word.split('');
        this.nowWords = wordsFromWords[this.word].sort((a, b)=>{
          if(a.length > b.length) return 1;
          if(a.length < b.length) return -1;
          return 0;
        });
        setTimeout(()=>{
          document.querySelector('.words').scrollTo({
            left: 0,
            behavior: "smooth"
          });
        }, 200);
        if(showAdv && advTime){
          setTimeout(()=>{
            showAdv();
            this.advShowNow = true;
            setTimeout(()=>{
              this.advShowNow = false;
            }, 10000)
          }, 300)
        }
      },
      getLevelByLevelAndLocation(level){
        return (this.location*21) + level;
      },
      toggleRules(){
        this.rules = !this.rules;
      },
      advTip(){
        if(this.tipCount > 0) return false;
        return !!(showAdv && advTime);

      },
      switchSounds(){
        this.isSounds = !this.isSounds;
        localStorage.setItem('sounds', this.isSounds);
        if (playerGame) playerGame.setData({sounds: this.isSounds}).then((ignored) => {});
      },
      isCloseLevelShow(level){
        return level !== 1 && this.stars[level-2] === 0;
      },
      isLevelNumberShow(level){
        return level === 1 || this.stars[level-2] > 0
      },
      pressKey(e){
        if(!this.content) return;
        if(this.animWordStart !== '') return;
        let letter = e.key;
        if(letter === 'Backspace'){
          this.selectedLetters.pop();
          this.wordFromLetter = this.wordFromLetter.slice(0, -1);
        }else if(letter === 'Enter'){
          this.sendWord();
        } else{
          letter = letter.toLowerCase();
          for(let i = 0; i < this.letters.length; i++){
              if(letter === this.letters[i] && !this.selectedLetters.includes(i)){
                this.selectedLetters.push(i);
                this.wordFromLetter += letter;
                if(this.isSounds){
                  clickSound.play();
                }
                break;
              }
          }
        }
      },
      testShowNextLevel(){
        if(this.lvl === allWords.length-1)return false;
        let nowLoc = Math.floor((this.lvl)/21);
        let nextLoc = Math.floor((this.lvl+1)/21);
        if(nowLoc !== nextLoc){
          return this.allStars >= nextLoc * 32;
        }
        return this.stars[this.lvl] > 0;
      },
      nextLevel(){
        if(this.testShowNextLevel()){
          this.getLevel(this.lvl+1);
        }
      },
      prevLocation(){
        if(this.location > 0){
          this.location--;
          if(this.isSounds){
            clickSound.play();
          }
        }
      },
      nextLocation(){
        if(this.location < this.allLocations-1){
          this.location++;
          if(this.isSounds){
            clickSound.play();
          }
        }
      },
      selectLetter(index){
        if(this.animWordStart !== '') return;
        if(this.isSounds){
          clickSound.play();
        }
        let ind = this.selectedLetters.indexOf(index);

        if(ind >= 0){
          this.selectedLetters.splice(ind, 1);
          this.wordFromLetter = this.wordFromLetter.slice(0, ind) + this.wordFromLetter.slice(ind+1);
        }else if(ind === -1 ){
          this.selectedLetters.push(index);
          this.wordFromLetter += this.letters[index];
        }
      },
      backMenu(){
        if(this.isSounds){
          clickSound.play();
        }

        this.levels =  true;
        this.levelsAnim =  true;
        setTimeout(()=>{
          this.content = false;
        }, 500);

      },
      getTip(){
        if(this.animWordStart !== '') return;
        if(this.tipCount < 1){
          if(showAdv && advTime){
            showAdv();
            this.tipCount++;
          }
          return;
        }
        if(allDoneWords[this.word].length === wordsFromWords[this.word].length) return;
        this.tipCount--;
        localStorage.setItem('tips', this.tipCount);
        if (playerGame) playerGame.setData({tips: this.tipCount}).then((ignored) => {});

        let arr = wordsFromWords[this.word].slice();
        for(let i = 0; i < this.doneWords.length; i++){
          arr.splice(arr.indexOf(this.doneWords[i]), 1);
        }
        let rand = Math.floor(Math.random()*arr.length);
        this.wordFromLetter = arr[rand];
        this.sendWord();
      },
      sendWord(){
        if(this.animWordStart !== '' || this.wordFromLetter.length === 0) return;
        if(this.nowWords.includes(this.wordFromLetter) && !this.doneWords.includes(this.wordFromLetter)){
          this.animWordStart = this.wordFromLetter;
          let wordFromLetter = this.wordFromLetter;
          this.wordFromLetter = '';
          this.selectedLetters = [];
          setTimeout(()=>{
            try{
              let words = document.querySelector('.words');
              let w = words.getBoundingClientRect().width;
              let wordsScroll = words.scrollLeft;
              let scrollEl = document.querySelector('.animWordStart').getBoundingClientRect();
              let scrollto = 0;
              if(scrollEl.left + scrollEl.width > w){
                  if(scrollEl.left < w + wordsScroll) {
                    scrollto = wordsScroll + scrollEl.left + scrollEl.width
                  }else{
                    scrollto = scrollEl.left - w + scrollEl.width + wordsScroll;
                  }
              }
              words.scrollTo({
                left: scrollto,
                behavior: "smooth"
              });
            }catch(e){
              console.log('Ошибка показа');
            }
              if(this.isSounds){
                doneWordSound.play();
              }
              this.addWord(wordFromLetter);
            this.animWord = wordFromLetter;
            this.newWord = wordFromLetter;
            localStorage.setItem('allDoneWords', JSON.stringify(allDoneWords));
            if (playerGame) playerGame.setData({allDoneWords: allDoneWords}).then((ignored) => {});
            setTimeout(()=>{
              this.animWordStart = '';
              this.animWord = '';

              if(!this.testStars()){
                if(showAdv && advTime){
                  setTimeout(()=>{
                    showAdv();
                    this.advShowNow = true;
                    setTimeout(()=>{
                      this.advShowNow = false;
                    }, 10000)
                  }, 300)
                }
              }

            }, 1000)
          }, 100);

        }else{
          this.isBadWord = true;
          if(this.isSounds){
            wrongWordSound.play();
          }

          setTimeout(()=>{
            this.isBadWord = false;
            this.wordFromLetter = '';
            this.selectedLetters = [];
          }, 400)
        }
      },
      testStars(){
        let stars = testStar(allDoneWords[this.word].length, wordsFromWords[this.word].length);
        if(stars > this.stars[this.lvl]){
          this.getStar = stars;
          this.stars.splice(this.lvl, 1, stars);
          if(this.isSounds){
            starVolume.play();
          }
          setTimeout(()=>{
            this.getStar = -1;
            if(this.location > 7){
              this.tipCount += 3;
            }else if(this.location > 4){
              this.tipCount += 2;
            }else{
              this.tipCount++;
            }
            localStorage.setItem('tips', this.tipCount);
            if (playerGame) playerGame.setData({tips: this.tipCount}).then((ignored) => {});

            if(showAdv && advTime){
              setTimeout(()=>{
                showAdv();
                this.showAdv++;
                this.advShowNow = true;
                setTimeout(()=>{
                  this.advShowNow = false;
                }, 10000)
              }, 300)
            }
          }, 1000);
          return true;
        }
        return false;

      },
      addWord(word){
        this.doneWords.push(word);
      }
    },
    mounted: function() {
      this.$nextTick(function() {
        if (doDeleteBlock) {
          if (document.querySelector(".pre-download")) {
            document.querySelector(".pre-download").remove()
          }
        }
        document.addEventListener('keydown', this.pressKey)
      })
    }
  }
</script>



<style>
  html,body
  {
    width:100%;
    height:100%;
    font: 10px/1.5 PTM, sans-serif;
    -webkit-tap-highlight-color: transparent;
    -ms-user-select: none;
    -moz-user-select: none;
    -webkit-user-select: none;
    touch-action: manipulation;
    user-select: none;
  }
  @font-face {
    font-family: 'PTM';
    src: url('assets/PTMono-Regular.otf');
    src: url('assets/PTMono-Regular.woff') format('woff');
    font-weight: normal;
    font-style: normal;
  }

  .switchRules{
    position: absolute;
    top: 50%;
    transform: translateY(-50%);
    left: 30px;

    font-size: 3.5rem;
    color: #faf5ac;
    cursor: pointer;
  }

  .rules-blackout{
    position: absolute;
    left: 0;
    top: 0;

    width: 100%;
    height: 100%;
    background: rgba(0, 0, 0, 0.5);

    cursor: pointer;
    z-index: 9;
  }
  .rules{
    position: absolute;
    left: 50%;
    top: 50%;
    transform: translate(-50%, -50%);
    min-width: 500px;
    max-width: 800px;

    padding: 10px;

    font-size: 1.4rem;
    color: white ;

    background-color: #2c1f2d;


    z-index: 10;
  }
  .rules__cross{
    position: absolute;
    top: 5px;
    right: 5px;

    width: 40px;
    height: 40px;

    background: url(assets/cross.png) center center no-repeat;
    background-size: 90%;
    cursor: pointer;
  }
  .rules__menu{
    font-size: 3rem;
    text-align: center;
  }

  .close-level-help{
    background: url(assets/close-level.png);
  }

  #app, .game, .blur, .property, .levels, .levels__property{
    position: relative;

    width: 100%;
    height: 100%;
      -webkit-tap-highlight-color: transparent;
      -ms-user-select: none;
      -moz-user-select: none;
      -webkit-user-select: none;
      touch-action: manipulation;
      user-select: none;
  }
  .game{
    position: absolute;
    top: 0;
    left: 0;
    z-index: 4;
    animation: getGameLevel 0.4s ease-in forwards;
  }
  .levelsAnim{
    z-index: 5;
    animation: getLevels 0.4s ease-in forwards;
  }
  @keyframes getLevels {
    0%{
      transform: translateX(-100%);
    }
    100%{
      transform: translateX(0);
    }
  }
  @keyframes getGameLevel {
    0%{
      transform: translateX(100%);
    }
    100%{
      transform: translateX(0);
    }
  }
  .property{
    display: flex;
    flex-flow: column nowrap;
    justify-content: space-between;
  }
  .blur{
    position: absolute;
    top: 0;
    left: 0;

    background: url('assets/game-background.png') center center no-repeat;
    background-size: cover;
    filter: blur(2px);

    z-index: 1;
  }
  .opacity{
    z-index: 2;
    position: absolute;
    top: 0;
    left: 0;

    width: 100%;
    height: 100%;

    background-color: rgba(0,0,0,0.1);
  }
  /*Уровни*/
  .levels__property{
    z-index: 2;
    display: flex;
    justify-content: center;
    flex-flow: column nowrap;
    align-items: center;
  }
  .levels{

  }
  .levels .blur{
    background: url(assets/levels-background.png) center center no-repeat;
    background-size: cover;
  }
  .levels .opacity{
    background-color: rgba(0,0,0,0.2);
  }
  .levelsTop{
    position: absolute;
    left: 0;
    top: 0;

    display: flex;
    justify-content: center;
    align-items: center;

    width: 100%;
    height: 60px;

    background-color: rgba(0, 0, 0, 0.4);

    z-index: 3;
  }
  .levelsTop__allStars{

    font-size: 2.5rem;
    line-height: 2.5rem;
    color: #faf5ac;

    letter-spacing: 2px;
  }
  .levels .menu-star{
    width: 20px;
    height: 20px;

    margin-left: 5px;

    background: url(assets/menu-star.png) center center no-repeat;
    background-size: 100%;
  }
  .sounds{
    right: 30px;
    top: 50%;
    transform: translateY(-50%);
    position: absolute;

    width: 30px;
    height: 30px;

    background: url(assets/sounds-off.png) center center no-repeat;
    background-size: 100%;

    cursor: pointer;
  }
  .sounds-on{
    background: url(assets/sounds-on.png) center center no-repeat;
    background-size: 100%;
  }
  .levels-wrapper{
    position: relative;

    display: flex;
    flex-flow: row wrap;
    justify-content: center;
    align-items: center;

    width: 100%;
    height: auto;

    margin-top: 60px;
    padding: 10px;
  }
  .level{
    position: relative;

    display: flex;
    justify-content: center;
    align-items: center;

    width: 60px;
    height: 60px;

    border: 1px solid #cbcbc9;
    border-radius: 50%;

    margin: 0 20px 30px 0;

    font-size: 2.9rem;
    color: #cbcbc9;

    cursor: pointer;
  }
  .levels-wrapper::before, .levels-wrapper::after {
    content: '';
    width: 100%;
    order: 1;
  }
  .level:nth-child(7n){
    margin-right: 0;
  }
  .level:nth-child(n + 8) {
    order: 1;
  }
  .level:nth-child(n + 15) {
    order: 2;
  }
  .level-done{
    color: #faf5ac;
    border-color: #faf5ac;
  }
  .close-level{
    position: absolute;
    top: 0;
    left: 0;

    width: 100%;
    height: 100%;

    border-radius: 50%;
    background: url(assets/close-level.png) center center no-repeat;
    background-size: 60%;

    cursor: auto;
  }
  .level .menu__level_stars{
    position: absolute;
    left: 0;
    bottom: -20px;

    width: 100%;

    cursor: auto;
  }
  .menu__level_stars .menu-star{
    width: 15px;
    height: 15px;

  }


  .close-location{
    position: absolute;
    top: 0;
    left: 0;

    display: flex;
    flex-flow: column;
    justify-content: center;
    align-items: center;


    width: 100%;
    height: 100%;

    background-color: rgba(0, 0, 0, 0.5);

  }
  .big-close{
    width: 140px;
    height: 200px;

    background: url(assets/close-level.png) center center no-repeat;
    background-size: 90%;

  }
  .close-stars{
    display: flex;
    justify-content: center;
    align-items: baseline;

    font-size: 3rem;
    line-height: 3rem;
    letter-spacing: 1px;
    color: #cbcbc9;
  }
  .close-stars .level_star{
    width: 25px;
    height: 25px;
    margin-left: 5px;
  }

  /*Игра*/
  .property{
    z-index: 2;
  }
  /*Меню*/
  .menu{
    position: absolute;
    left: 0;
    top: 0;

    width: 100%;
    padding: 5px 0;

    display: flex;
    justify-content: space-around;
    align-items: center;


    background-color: rgba(0,0,0,0.4);
    color: white;

    z-index: 3;
  }
  .menu__button-back, .menu__tip, .menu__button-next-level{
    width: 30px;
    height: 30px;

    background: url(assets/bars.svg) center center no-repeat;
    background-size: 100%;
    border: none;
    cursor: pointer;
  }
  .menu__tip{
    position: relative;

    width: 24px;
    height: 38px;

    background: url(assets/tip.png) center center no-repeat;
    background-size: 100%;
  }
  .menu__tip_count, .advert{
    position: absolute;
    bottom: 0;
    right: -3px;

    display: flex;
    justify-content: center;
    align-items: center;

    padding: 0 4px;

    font-size: 0.7rem;

    background-color: #ee4051;
    border-radius: 5px;
  }
  .advert{
    width: 15px;
    height: 15px;

    background: url("assets/advert.png") center center no-repeat white;
    background-size: 80%;
  }
  .menu__level, .menu__words-amount{
    font-size: 1.6rem;
    letter-spacing: 2px;
  }
  .menu__words-amount{
    min-width: 60px;
  }
  .menu__level_stars{
    display: flex;
    justify-content: center;
  }
  .menu__button-next-level{
    background: url(assets/angle-right_gray.svg) center center no-repeat;
    background-size: 70%;
  }
  .menu__button-next-level, .menu__button-next-level:active{
    outline: none;
  }
  .menu__button-next-level_active{
    background: url(assets/angle-right_white.svg) center center no-repeat;
    background-size: 70%;
  }
  .menu__button-next-level_active:active{
    transform: scale(0.98);
  }
  .level_star{
    width: 15px;
    height: 15px;

    margin-right: 2px;
    background: url(assets/empty-star.png) center center no-repeat;
    background-size: 100%;

  }
  .level_full-star.getStar{
    animation: showFullStar 1s forwards;
  }
  .level_full-star{
    background: url(assets/menu-star.png) center center no-repeat;
    background-size: 100%;
  }
  @keyframes showFullStar {
      0%{
        transform: scale(1);
      }
      50%{
        transform: scale(2);
      }
      100%{
        transform: scale(1);
        background: url(assets/menu-star.png) center center no-repeat;
        background-size: 100%;
      }

  }
  .next-location, .prev-location{
    position: absolute;
    top: 50%;
    transform: translateY(-50%);

    width: 30px;
    height: 30px;


    background: url(assets/angle-right_menu.svg) center center no-repeat;
    background-size: 100%;

    cursor: pointer;
    z-index: 2;
  }
  .next-location:active{
    transform: translateY(-50%) scale(0.98);
  }
  .next-location{
    right: 5px;
  }
  .prev-location{
    left: 5px;
    transform: translateY(-50%) rotate(180deg);
  }
  .prev-location:active{
    transform: translateY(-50%) rotate(180deg) scale(0.98);
  }
  /*Блок со всеми словами*/
  .words{
    display: flex;
    flex-flow: column wrap;

    width: 100%;
    max-height: 59%;

    margin-top: 50px;

    padding: 10px;

    overflow-x: auto;
  }
  .words__letters-block{
    display: flex;
    flex-flow: row nowrap;


    margin-bottom: 5px;
    padding-right: 30px;
  }
  .words__letters-block_done .words__letter, .action-block__letters .action-block__letter_selected{
    background-color: rgba(166,82,174,0.9);
    color: white;
  }
  .words__letter, .action-block__letter{
    display: flex;
    justify-content: center;
    align-items: center;

    width: 25px;
    height: 25px;

    margin: 1px;

    border-radius: 3px;

    font-size: 1.8rem;
    text-transform: uppercase;

    background-color: rgba(255, 255, 255, 0.9);

  }
  .animWord .words__letter{
    animation: 1s showNewWord forwards;
    /*animation-delay: 0.2s;*/
  }
  .newWord .words__letter{
    background-color: rgba(217, 109, 227, 0.9);
  }
  @keyframes  showNewWord{
    0%{
      background-color: rgba(255, 255, 255, 0.9);
    }
    100%{
      background-color: rgba(217, 109, 227, 0.9);
    }
  }
  /*Взаимодействие*/
  .action-block__done-word{
    min-height: 30px;

    font-size: 2.3rem;
    line-height: 2.3rem;
    text-align: center;
    color: white;
    text-transform: uppercase;
    letter-spacing: 1px;

  }
  .done-word{
    position: relative;
    display: inline-block;
  }
  .badWord{
    color: #ee4051;
    animation: tremor 0.05s ease-in-out infinite;
  }
  @keyframes tremor {
    0%, 25% {
      left: -1px;
      transform: translateX(-5%);
    }
    50%, 100% {
      left: 1px;
      transform: translateX(5%);
    }
  }
  .action-block__letters{
    display: flex;
    justify-content: center;
    align-items: center;
    margin-bottom: 15px;
  }
  .action-block__letter{
    width: 40px;
    height: 40px;

    font-size: 2.4rem;
    margin-right: 5px;

    cursor: pointer;
    -ms-user-select: none;

    -moz-user-select: none;
    -khtml-user-select: none;


    -webkit-user-select: none;
  }
  .action-block__button-send{
    display: block;

    margin: 0 5px 0 25px;

    width: 41px;
    height: 41px;

    background: url(assets/angle-right.png) center center no-repeat, rgba(255, 255, 255, 0.9);
    background-size: 17px 29px;

    border-radius: 3px;

    cursor: pointer;

    outline: none;
  }
  .action-block__button-send:active{
    transform: scale(0.98);
    outline: none;
  }
  @media (max-width: 600px) {
    .level{
      width: 55px;
      height: 55px;
      margin-right: 17px;
    }
  }
  @media (min-width: 1000px) {
    .rules__menu{
      font-size: 3.5rem;
    }
    .rules{
      font-size: 2rem;
      padding: 40px;
    }

    .advert {
      width: 20px;
      height: 20px;
    }




    .blur{
      filter: blur(2px);
    }
    .games .blur{
      filter: blur(3px);
    }



    .levels-wrapper{
      margin: 0 auto;
    }
    .property, .levels-wrapper{
      max-width: 1200px;
      margin: 0 auto;
    }
    .level{
      width: 90px;
      height: 90px;

      margin-bottom: 40px;

      font-size: 4.8rem;
    }
    .level .menu__level_stars{
      bottom: -27px;
    }
    .level_star{
      width: 22px;
      height: 22px;
    }


    /*Игра*/
    .menu__button-back, .menu__button-next-level, .prev-location, .next-location{
      width: 40px;
      height: 40px;
    }
    .menu__words-amount{
      font-size: 2rem;
    }
    .menu__level{
      font-size: 2rem;
    }
    .close-level{
      background-size: 50%;
    }
    .level_star, .level_star.menu-star{
      width: 20px;
      height: 20px;
    }
    .menu__tip{
      width: 32px;
      height: 50px;
    }
    .menu__tip_count{
      font-size: 1rem;
    }



    .words{
      margin-top: 60px;
      padding: 20px;
    }
    .words__letter{
      width: 40px;
      height: 40px;

      font-size: 2.2rem;
    }
    .action-block__letter{
      width: 60px;
      height: 60px;
      font-size: 3rem;
    }
    .action-block__button-send{
      width: 62px;
      height: 62px;
    }
    .action-block__done-word{
      font-size: 2.7rem;
    }
  }
</style>
