<template>
  <div id="app">
    <!--    <div class="close-level-help prev-location next-location"></div>-->
    <div class="levels"
         @updateAll="updateAll()"
         @buyTips="addBuyTips()"
         v-show="levels" :class="[levelsAnim ? 'levelsAnim' : '']">

      <div class="blur"></div>


      <div class="levelsTop">
        <div class="switchSettings" @click="toggleSettings"></div>


        <div class="levelsTop__allStars">
          {{allStars}}/{{numOfLevels*3}}
          <div class="menu-star"></div>
        </div>
<!--        <div class="sounds" @click="switchSounds" :class="isSounds ? 'sounds-on' : ''"></div>-->
        <div class="switchShop" @click="toggleShop()"></div>
      </div>



      <div class="levels__property">
        <div class="levels-wrapper">
          <div
                  class="level"
                  v-for="level in 21"
                  :key="getLevelByLevelAndLocation(level)"
                  @click="getLevel(getLevelByLevelAndLocation(level)-1)"
                  :class="{'level-done': isLevelDone(getLevelByLevelAndLocation(level)),
                            'level_close': isCloseLevelShow(getLevelByLevelAndLocation(level))
                            }">




            <div v-show="!isCloseLevelShow(getLevelByLevelAndLocation(level))">
              {{getLevelByLevelAndLocation(level)}}</div>
            <div class="menu__level_stars">
              <div class="level_star" v-for="star in 3" :key="star"
                   :class="star <= stars[getLevelByLevelAndLocation(level)-1] ? 'menu-star' : ''"></div>
            </div>
            <div class="close-level" v-if="isCloseLevelShow(getLevelByLevelAndLocation(level))"></div>
          </div>
          <div class="prev-location" @click="prevLocation()" v-if="location > 0"></div>
          <div class="next-location" @click="nextLocation()" v-if="location < allLocations-1"></div>


        </div>



      </div>










    </div>



    <div class="game" v-show="content">
        <div class="blur"></div>

      <header class="menu">
        <button class="menu__button-back" @click="backMenu"></button>
        <div class="menu__words-amount">
          {{doneWords.length}}/{{nowWords.length}}
        </div>
        <div class="menu__level">
          УРОВЕНЬ {{lvl+1}}
          <div class="menu__level_stars">
            <div class="level_star" v-for="star in 3" :key="star"
                 :class="[star <= stars[lvl] ? 'level_full-star' : '',
                      getStar === star ? 'getStar' : '']"></div>
          </div>
        </div>
        <div class="menu__tip" @click="getTip()">
          <div class="advert" v-if="advTip() && !advShowNow"></div>
          <div class="menu__tip_count" v-else>{{tipCount}}</div>
        </div>
        <button class="menu__button-next-level"
                :class="[testShowNextLevel() ? 'menu__button-next-level_active' : '']"
                @click="nextLevel()">
        </button>
      </header>



      <div class="property">
        <div></div>






        <div class="words">
          <div class="words__letters-block"
               v-for="(word,index) in nowWords" :key = "word"
               :class="[doneWords.includes(word) ? 'words__letters-block_done' : '',
               animWord === word ? 'animWord' : '',
                animWordStart === word ? 'animWordStart' : '',
                newWord === word ? 'newWord' : '',
                wordWasIndex === index ? 'wordWas': ''
                ]">
            <div class="words__letter"
                 v-for="letter in word" :key = "letter + Math.random()"
            >{{doneWords.includes(word) ? letter : '' }}</div>
          </div>

        </div>





        <div class="action-block">
          <div class="action-block__done-word">
            <div class="done-word" :class="[isBadWord ? 'badWord' : '']" >{{wordFromLetter}}</div>
          </div>
          <div class="action-block__letters">
            <div class="action-block__letter"
                 @click="selectLetter(index)"
                 :class="[selectedLetters.includes(index) ?
                  'action-block__letter_selected' : '']"
                 v-for="(letter,index) in letters" :key="letter + Math.random()">{{letter}}
            </div>
            <button class="action-block__button-send" @click="sendWord"></button>
          </div>
        </div>
      </div>









      <div class="rules-blackout" v-show="showAdvTip" @click="closeShowAdvTip()"></div>
      <div class="rules adv-show" v-show="showAdvTip">
        <div class="rules__cross" @click="closeShowAdvTip()"></div>
        <h2 class="rules__menu">
          Внимание
        </h2>
        Для получения подсказки нужно посмотреть рекламу не менее 3 секунд.
        <span v-show="isAdvShowed">Но в первый раз вы её получаете.</span>
      </div>

    </div>



    <div class="rules-blackout" v-show="shop" @click="toggleShop()"></div>

    <div class="rules shop" v-show="shop">
      <div class="rules__cross shop__cross" @click="toggleShop()"></div>
      <h2 class="rules__menu">
        Магазин
      </h2>
      <div class="shop__cart">


        <div class="shop__cart__item" @click="buyTip(2)">
          <div class="shop__cart__item_2">
          </div>
          <div class="shop__cart__name">20 подсказок</div>
          <div class="shop__cart__buy-button" >
            49 рублей
          </div>
        </div>


        <div class="shop__cart__item" @click="buyTip(3)">
          <div class="shop__cart__item_3">
          </div>
          <div class="shop__cart__name">50 подсказок</div>
          <div class="shop__cart__buy-button">
            99 рублей
          </div>
        </div>


        <div class="shop__cart__item" @click="buyTip(4)">
          <div class="shop__cart__item_4">
          </div>
          <div class="shop__cart__name">100 подсказок</div>
          <div class="shop__cart__buy-button">
            149 рублей
          </div>
        </div>



      </div>

    </div>


    <div
            class="blackout rules-blackout"
            @click="toggleSettings"
            v-show="isSettings"

    ></div>

    <div class="settings" v-show="isSettings">
      <div class="settings__header">Настройки</div>
      <ul>
        <li>
          <input type="checkbox"
                 @change="switchSounds"
                 v-model="isSounds"
                 id="musicCheckbox"
                 class="checkbox"

          />
          <label
                  for="musicCheckbox">
            Звук
          </label>
        </li>


        <li>
          <span
             class="settings__text"
             @click="toggleRules"
          >
            Как играть?
          </span>
        </li>

        <li>
          <a href="https://vk.com/jaugr"
             target="_blank"
             rel="noopener noreferrer"
             class="settings__text"
             @click="()=>{sendParams({'vk': 1})}"
          >
            Наша группа ВКонтакте
          </a>
        </li>

        <li class='our-games'>
          Наши игры
        </li>

        <li @click="()=>{sendParams({'crs': 1})}">
          <a href="https://yandex.ru/games/play/100008"
             target="_blank"
             rel="noopener noreferrer"
          >
            <div class="my-game crs">
            </div>
          </a>
        </li>

        <li @click="()=>{sendParams({'stm': 1})}">
          <a href="https://yandex.ru/games/play/98125"
             target="_blank"
             rel="noopener noreferrer"
          >
            <div class="my-game stm">
            </div>
          </a>
        </li>

        <li @click="()=>{sendParams({'wfl': 1})}">
          <a href="https://yandex.ru/games/play/99196"
             target="_blank"
             rel="noopener noreferrer"
          >
            <div class="my-game wfl">
            </div>
          </a>
        </li>


      </ul>
    </div>

    <div class="rules-blackout main-blackout" v-show="rules" @click="toggleRules()"></div>
    <div class="rules" v-show="rules">
      <div class="rules__cross" @click="toggleRules()"></div>
      <h2 class="rules__menu">
        Правила
      </h2>
      Добро пожаловать в игру "Слова из слова".
      Цель игры - составлять всевозможные слова из выданных вам слов.
      Нажимайте на буквы снизу, чтобы добавить или убрать эту букву из слова.
      Когда слово будет набрано - нажмите на стрелку, чтобы проверить, верно ли оно.
      Если у вас закончились идеи, нажмите на подсказку.
      Подсказки можно получить за звёзды, а также за просмотр рекламы.
      Уровень пройден на 33% - 1 звезда, 66% - 2 звезды, 100% - 3 звезды.
      Удачной игры!
    </div>


    <div class="rules-blackout" v-show="isGameAdvShow" @click="changeGameAdvShow()"></div>
    <div class="rules advertCrossword" v-show="isGameAdvShow">
      <div class="rules__cross" @click="changeGameAdvShow()"></div>
      <h2 class="rules__menu">
        Новая игра от наших разработчиков!
      </h2>
      <a
              class="advertCrossword__image"
              href="https://yandex.ru/games/play/100008"
              target="_blank"
              rel="noopener noreferrer"
      >
        <div class="advertCrossword__blur"></div>
        <div class="advertCrossword__text">
          Угадывайте слова в увлекательном мире кроссвордов!
        </div>
        <div class="openCrossword">Играть!</div>
      </a>
    </div>


  </div>


</template>

<script>
  let advTime = false;
  setTimeout(()=>{
    advTime = true;
  }, 30000);
  let showAdv, playerGame, payments, YSDK;
  let allWords = [
    "милость", "формула", "арматура", "теленок", "записка", "дизайнер", "пипетка", "животное", "желтозем", "буржуазия", "диаграмма", "хромосома", "щитовидка", "архаизм", "шизофрения", "яйцеклетка", "антоним", "бедняга", "трактат", "сожитель", "корчевка",
    "жаркое", "рутина", "комедия", "ломбард", "анатомия", "баталист", "косточка", "экономия", "эвкалипт", "барашек", "боярышник", "двигатель", "гидрология", "голограмма", "громоотвод", "свиристель", "устройство", "ультиматум", "этимология", "юрисдикция", "абордаж",
    "подруга", "продукт", "единорог", "писатель", "вермишель", "язычество", "богатство", "стоматолог", "ускорение", "уничтожение", "заклепка", "картежник", "надежность", "авиасалон", "аквариум", "арматурщица", "безматок", "блиндаж", "вафельщица", "горбуша", "джокер",
    "автор", "повесть", "жестокость", "мартышка", "жаворонок", "чернослив", "вафельница", "целомудрие", "блокнот", "буквоед", "нахлестка", "боксит", "боровик", "брусок", "валькирия", "выкаливание", "деноминация", "инобытие", "корифей", "кульман", "надсечка",
    "блузка", "гвардия", "отслоение", "бездельник", "батиплан", "гортензия", "задевание", "ископаемое", "квашнин", "коллапс", "концессия", "лексика", "мединститут", "написание", "отблеск", "паутинка", "прорезка", "пугало", "синева", "синтепон", "смелость",
    "шарлотка", "агрономия", "эвристика", "авиамодель", "художество", "архаист", "воеводство", "выразитель", "купюра", "наложение", "обращение", "осознание", "поднебесная", "прелесть", "призвание", "прямота", "самозащита", "сроднение", "стенопись", "термометр", "фальшивка",
    "аэросъемка", "вакуумметр", "ворсильщик", "забавник", "раздор", "сифонофора", "склепщица", "стрела", "трешкоут", "щегленок", "студень", "томагавк", "абрикос", "боеголовка", "мармеладка", "декстрин", "кукарекание", "развозчица", "сценичность", "телебашня", "хлорка",
    "автомобиль", "ассиметрия", "газопровод", "сейсмограф", "бесшумность", "минутка", "подбородок", "подросток", "прообраз", "флорист", "штурмовик", "самоанализ", "кассатор", "проволока", "растирание", "хохотание", "пульсация", "самородок", "вентилятор", "амортизатор", "родник",
    "маркетинг", "инкубатор", "малахит", "паровоз", "русалочка", "валерьянка", "поломка", "двустволка", "гранатомет", "программист", "потолок", "кооператив", "суходол", "забастовка", "странствие", "туземка", "снегурочка", "цесарка", "экскаватор", "наперсток", "фиаско",
    "автомеханик", "адсорбент", "абажур", "всемирность", "глухонемота", "интрига", "адмирал", "крематорий", "монетарист", "коленка", "отстранение", "критика", "прибалтика", "разработка", "распилка", "костер", "эмират", "удабривание", "федералист", "требование", "молодчина",
    "антисептик","металлург","микрофауна","декламация","окуривание","сберкасса","назревание","скапывание","скирдовоз","актинограф","югославка","пересушка","обтирка","паголенок","холстина","гарпунщик","ковроделка","тундрянка","дворянство","выработка","рутинность","камерунка","легковушка","пластеин","совнарком","поддувание","пустырник","гидростат","минотавр","флибустьер","тюрчанка","лоббистка","морзянка","экспедитор","автогигант","полярник","константа","боливийка","сортимент","повстание","провокатор","велогонщик","астероид","проминка","каллиграф","отгнивание","марказит","подсечка","каретник","проскачка","шпротина","авиадесант","полиритмия","библиотека","платинка","русистика","чалмоносец","буртование","крановщик","парусность","оргкомитет","платочек","обтирание","надхвостье","секундант","бульдозер","нитрование","самокатка","сопельщик","отрадность","экономист","тамплиер","прогалина","раздутость","франциско","африканер","пародонтоз","ликтрос","мерлушка","остекление","картавость","голкипер","экстремизм","акробат","паремейник","светокопия","разоритель","содержание","автосалон","конформист","бардачок","темперация","альпинист","кармелит","терновник","синекдоха","треуголка","казачество","подчеканка","метрдотель","самоохрана","бутылконос","пародист","оставление","некробиоз",
    "подцветка","валкование","керамзит","электролиз","цистерна","развилка","пролепка","диалектизм","цветоножка","истекание","молотилка","ланцетник","латифундия","перебивка","украшение","накрывание","тартальщик","трогание","фильмоскоп","галантерея","шестиполье","голубизна","картинка","композитор","фруктоза","телефонист","расшивание","подсыхание","кондуктор","баллончик","психрограф","младенчик","барабулька","пластика","клепочник","успокоение","патриотизм","комарник","барселона","работница","драмкружок","фонограмма","разобщение","темпограф","намерзание","мажорность","сотрясение","скиркание","кристалл","развеска","брандмауэр","лестница","нечистота","ландштурм","пергамент","полтинник","зарастание","часовенка","светолюбие","излишество","передовица","бороздка","курсистка","карабинер","присоска","тростник","прокамбий","фаршировка","сурепка","позерство","долгоносик","градиент","старание","заклинание","гитлеровец","перебранка","тигренок","расковка","подсушина","подседина","маркировка","плательщик","бледность","выбраковка","проминание","жеребятина","поджарка","старпом","спаситель","слезинка","синестрол","прабабушка","волшебница","фильдекос","задержание","негритенок","исполком","напиток","космограф","отмыкание","перековка","однолетка","каламбур","сберегание","лжеприсяга","присядка","жироприказ","кронглас","оккультизм","троечник","киловатт","персонал","перепилка","перезаявка","перерасход","конокрад","присыхание","перкуссия","фактограф","принцесса","скарбница","монтажер","органоид","тетралогия","кантилена","пассажирка","семяпочка","спецпроект","пеклевание","раскрутка","славистика","ретивость","стальник","кастрация","рублевка","кардинал","решаемость","ветреность","песчинка","преемство","директива","одалиска","чертежница","минорность","барашкин","обмуровка","чепрачник","сорокопут","косметолог","разнолесье","жеманность","бережность","поддирание","сенсуалист","яхтсменка","котировка","малословие","двусемянка","спекулянт","растушка","сексология","барахтание","паромщик","круповейка","сковородка","недоросль","спартанец","котельная","псалтирь","сценограф","старолесье","цитрусовод","конферанс","винтокрыл","смородина","завалинка","пористость","скарбничий","монополист","пальметка","народник","головчинер","патерик","гончаренко","англомания","субботник","святочник","гипнотизер","навертка","рамочник","богаделка","проявление","лисоферма","эпидиаскоп","безрогость","ворократия","ламентация","табакерка","стягивание","отряхание","шпажистка","замухрышка","смерзание","лопаточка","каббалист","ложбинка","ущербность","пересадка","забавность","полемист",
    "оплавление","вкатывание","разжимание","барочник","разметка","почетность","добавление","прорекание","сопревание","геронтолог","ферросплав","ограждение","половчанка","притачка","интеграция","крупинка","инфразвук","алгебраист","салотопня","мышкование","формование","шнуровка","апострофа","плодоножка","глодание","пролезание","бюргерство","сапонит","королева","контрданс","выстилание","подносчик","нейтралист","финалистка","форштевень","отпущенник","перетяжка","консервы","доставка","мурмолка","нарколог","мексиканка","завтрашнее","многоустка","таможенник","медиатор","космополит","сокрытие","странность","сантехника","земляника","капитулянт","мемуарист","гласность","вспухание","литограф","мерзлость","реальность","лицеистка","дровяник","красавчик","врастание","раскисание","чертовка","соблюдение","окачивание","автокар","субмарина","жительство","подсыпание","множитель","протяжение","желчность","автоклуб","опаривание","пуансовка","киприотка","антиракета","смертность","счаливание","скворечня","стендовик","филофонист","космонавт","горечавка","полуостров","кресало","скваттер","полуулыбка","левретка","выборность","подбутовка","формалист","скульптура","синтетика","апоцентр","солдатик","курлыкание","полузащита","подбрюшник","аморализм","нечеткость","аркебузир","тромбонист","постановка","склепщица","опрятность","методика","самобранка","легкоатлет","болгарин","отвержение","каторжанин","пронимание","проножка","браконьер","подалириус","петрограф","малоснежье","рассольник","гидропульт","картушка","экспромт","подпилка","мужичонка","славистка","гастроли","неваляшка","канталупка","государь","персонаж","гнилушка","секстильон","алебардник","расточник","клирошанин","отпадание","облакомер","водоскат","празеодим","обвислость","свекловод","пестрядина","чертилка","карпенко","дорубание","машиновед","душегрейка","подмывание","посконина","лестность","перевозчик","пустышка","скейтборд","сокредитор","делячество","самотек","наркоман","корректура","заплетание","проступок","десантник","картошка","параметрит","отвердение","интерпол","канделябр","конторка","стражник","разыскания","выплетание","мышеловка","номография","дефектолог","авиаспорт","анаэробиоз","наибство","мокасин","ночесветка","тетрадочка","терпимость","звездность","обстановка","петрология","мотолодка","косхалва","блокпост","пилотка","фигуристка","громыхание","болванка","плавунчик","дриопитек","софистка","подхвостье","декларация","сторонка","ломтерезка","отливание","пескожил","фалерист","экспирация","азартность","глазомер","раскупорка","тормошение","пятистенка","стогование","антисемит","широкость"
  ];
  let wordsFromWords = {"милость":["ил","илот","ильм","лис","лист","лом","лось","лот","ми","мол","моль","мост","ость","ось","си","силь","сито","слом","слот","смоль","соль","сом","стиль","стол","тимол","тис","толь","том"],"формула":["амур","аул","лар","лом","мол","мор","морф","муар","мул","мура","омар","ор","рол","ром","улар","ум","умора","урал","фа","фал","флора","фол","фора","форма","форум","фура","фурма"],"арматура":["амур","ара","аура","аут","мара","март","мат","муар","мура","рама","раут","рута","тара","тарарам","траур","тур","тура","ум"],"теленок":["енот","клен","клон","кол","колет","кон","кот","котел","лен","лет","лето","леток","лот","оленек","отек","отел","телек","тело","телок","тенек","тлен","ток","толк","тон"],"записка":["ас","заика","запас","ик","иск","капа","кипа","паз","пак","пас","паск","пик","пика","писк","сааз","саз","сак","сап","сапа","сапка","си","сказ","скип"],"дизайнер":["ад","азид","дан","дар","дерн","диез","дизайн","динар","дрезина","дрена","еда","езда","зад","здание","иней","надир","надрез","наезд","нард","недра","низ","радий","рай","ре","редан","резина","рей","рейд","рейн","рений","риза"],"пипетка":["акт","ик","кепи","кета","кипа","кит","паек","пак","пакет","пакт","пат","пик","пика","пикап","пике","пикет","пипка","тапки","тик","тип"],"животное":["вено","вето","вино","винт","воин","еж","енот","жетон","живот","ион","нож","овен","овин","твин","теин","тени","тон"],"желтозем":["еж","жезл","желе","железо","жмот","зет","зло","лет","лето","ложе","лом","лот","мел","метол","мол","омет","омлет","отел","тело","том"],"буржуазия":["ажур","азу","азур","арбуз","ария","бар","биржа","бра","бриз","буж","буза","бур","бура","буржуа","буря","жар","жир","заря","зуб","зубр","изба","раб","раж","риза","ряж","уж","яр"],"диаграмма":["агама","агар","ад","ара","армада","гад","гамма","гарда","гид","гидра","град","грамм","грим","дама","дар","драга","драма","игра","имам","ирга","маг","магма","мадам","мама","мара","ми","миг","мим","мир","рада","рама"],"хромосома":["ас","марс","мах","мор","морс","мох","омар","ор","оса","охра","рамс","ром","роса","сом","сома","сор","соха","срам","хам","хаос","хор","храм","хром"],"щитовидка":["ад","акт","актив","вид","виток","вода","водка","диво","до","док","дока","ива","идиот","идиотка","ик","икота","иод","катод","квота","киви","кит","код","кода","кот","ода","тако","твид","тик","ток","щи","щит","щитовка","щиток"],"архаизм":["ара","замах","зима","мазар","мара","мах","махра","ми","мир","мирза","размах","рама","риза","хазар","хам","харизма","хиазма","храм"],"шизофрения":["ерошин","ерш","зерно","зеро","зефир","зоря","ион","иония","ирония","неф","низ","нория","ор","офеня","ре","резня","резон","рея","риф","фен","фея","финиш","фирн","фиш","фон","фреон","шен","шериф","шеф","шея","ши","шифер","шифон","шифр","шофер","яр"],"яйцеклетка":["акт","алтей","ацтек","елей","елка","кал","каяк","кета","клей","клетка","клецка","лай","лак","лакей","лей","лейка","лет","лея","ля","таец","телек","телец","телка","тля","яйла","як","ял"],"антоним":["анион","аноним","ант","атом","ион","мант","манто","мат","ми","мина","наин","намин","нома","нона","нота","танин","тина","тмин","том","томан","тон","тонина","тонна"],"бедняга":["ад","баден","баня","баян","бег","бега","беда","гад","ген","дан","еда","набег","нега","ябеда","яд"],"трактат":["акт","ара","арак","арка","кара","карат","карт","карта","рак","такт","тара","трак","тракт","трата","тратта"],"сожитель":["еж","ель","жест","жесть","жилет","жилье","житель","житье","ил","илот","лес","лесть","лет","лето","лис","лист","литье","ложе","ложь","лось","лот","осел","ость","ось","отел","отель","село","сель","сет","сеть","си","силь","сито","слет","слот","соль","стиль","стол","тело","тес","тесло","тис","толь"],"корчевка":["ваер","вар","век","веко","вера","верк","вор","врач","каре","квакер","кварк","ковер","ковка","коечка","кок","кока","кора","корка","корча","кочевка","кочка","краков","кров","овечка","овчар","ор","орк","очерк","рак","ре","рев","река","речка","ров","рок","чаек","чек","чека","черва","чрево"],"жаркое":["еж","жар","жарок","жор","каре","кожа","кора","корж","ор","орк","раж","рак","ре","река","рожа","рок"],"рутина":["ант","аут","нут","рант","ратин","раут","руина","руна","рута","тина","тир","тиран","тиун","тун","туна","тур","тура","турин","униат","уран","урина","урна"],"комедия":["дек","до","док","дом","домик","едок","идея","ик","имя","иод","код","ком","коми","мед","медик","медяк","ми","яд","як"],"ломбард":["ад","бал","бар","бард","боа","бола","бор","бора","бра","брод","бром","дар","до","дол","дом","домбра","домра","лад","ладо","лар","лоб","лом","лорд","мода","мол","мор","морда","ода","одр","омар","ор","орда","раб","роба","род","рол","ром","ромб"],"анатомия":["анатом","ант","атом","атония","имя","ион","мана","мания","мант","мантия","манто","мат","ми","мина","мята","нома","нота","тина","тмин","том","томан","тон","тоня","яма"],"баталист":["аист","ас","астат","атлас","бал","бас","батат","батист","бит","бита","блат","ил","ласа","ласта","лата","лис","лиса","лист","саба","саиб","салат","си","сила","талиб","тис"],"косточка":["акт","ас","каток","кок","кока","кокос","кокс","коса","косач","косок","кот","кочка","око","окот","оса","осока","осот","осочка","откос","очко","сак","сачок","скак","скат","скачок","скок","скот","скотч","сок","сота","сотка","сток","сточка","тако","ткач","ток","тоска","точка","час","часок"],"экономия":["ик","имя","инок","ион","кимоно","кино","ком","коми","кон","ми","окно","око","эконом","эмо","як","янки"],"эвкалипт":["акт","актив","вал","валик","вилка","ива","ик","ил","кал","кила","кипа","кит","клип","лак","лапти","лик","липа","липка","литвак","литка","пак","пакт","пат","пик","пика","пила","пилав","пилка","плав","плавки","плита","плитка","талик","тапки","тик","тип","тэк","элита","эпика","этап","этика","этил"],"барашек":["абак","абрек","ара","араб","арак","арба","арека","арка","бак","бар","барак","барк","барка","башка","бек","бекар","бра","брак","ерш","кабаре","кара","каре","каша","кеб","кеш","краб","раб","раба","рак","ракша","ре","река","решка","шабер","шар"],"боярышник":["бок","бон","боны","бор","боярин","броня","бык","ик","икры","инок","ион","кино","кон","нория","нырок","ор","орк","рок","рыбник","рык","рынок","ши","шик","шок","шорник","як","янки","яр","ярок"],"двигатель":["авгит","ад","альт","вал","валет","вега","веда","ветла","виг","вид","витье","гад","галиев","гать","гвалт","гель","гид","гиль","гит","гладь","даль","дева","дельта","деталь","детва","дети","диета","еда","ель","ива","игла","идеал","ил","лаг","лад","лев","левит","легат","лед","леди","лет","лига","литье","тальвег","твид","тильда"],"гидрология":["гид","гидролог","гирло","гиря","го","год","гол","голод","горло","город","грог","дилогия","до","дог","дол","долг","доля","дояр","игил","иго","идол","ил","иод","ирод","лог","лорд","лори","ля","лярд","одр","ор","оргия","рог","род","рол","ряд","яд","ядро","ял","яр","ярд"],"голограмма":["агар","аларм","ара","арго","гага","гагра","гамма","го","гол","гора","горло","грамм","грог","гром","лаг","лама","лар","лог","лом","маг","магма","мала","мама","мара","марал","марго","мгла","могар","могол","мол","мор","морг","омар","ор","рама","рог","рол","ром"],"громоотвод":["вор","ворот","го","говор","год","город","гром","грот","двор","до","дог","договор","дом","мор","морг","мотор","овод","оговор","огород","одр","ор","отвод","отговор","отрог","ров","рог","род","ром","рот","творог","том","тор","торг","трог"],"свиристель":["вес","вест","весть","весь","вис","витье","ель","ерь","иврит","ил","ирис","лев","левит","лес","лесс","лесть","лет","ливер","ливр","лис","лист","литер","литр","литье","ре","рев","рельс","рис","свес","свет","свиль","свирель","свист","свитер","сев","севр","сель","серв","сервис","сет","сеть","си","силь","систр","сити","слет","слив","слитие","стиль","тес","тир","тире","тис","трель","трисель"],"устройство":["вой","войт","вор","ворот","ворс","йот","ойрот","ор","осос","осот","остов","остров","отсос","отстой","ров","рой","рост","рот","руст","сор","сорос","сорт","сорус","соус","створ","строй","той","тор","торос","торс","торт","тост","трос","трот","трус","тур","тут","тутор","ус","устой","устрой","утор","утро"],"ультиматум":["альт","аул","аут","ил","ильм","имам","ламут","мат","мать","ми","мим","мул","мулат","муть","титул","туаль","тут","тута","тьма","улит","ум","утиль"],"этимология":["гит","глот","го","гол","игил","иго","ил","илот","имя","итог","лимит","лития","лог","лом","лот","лото","ля","ми","миг","миля","миолог","миология","могол","мол","молот","мяло","отлог","тимол","тля","том","тягло","эго","эмо","этил","этимолог","этиология","ял"],"юрисдикция":["дикция","диск","ик","ирис","иск","рис","риск","ряд","си","сидр","скирд","цирк","юр","юс","яд","як","яр","ярд","яс"],"абордаж":["ад","ара","араб","арба","бар","бард","баржа","боа","бор","бора","бра","брод","даба","дар","до","дож","жаба","жабо","жабра","жад","жар","жара","жор","ода","одр","ор","орда","раб","раба","рада","раджа","раж","роба","род","рожа"],"подруга":["ад","арго","гад","го","год","гора","град","груда","гурда","дар","даур","до","дог","драп","дрога","друг","дуга","дура","огпу","ода","одр","ор","орда","пар","подгар","пора","пруд","пуд","пудра","пурга","рагу","рог","род","руда","угар","угода","удар","упад","упор","урод"],"продукт":["до","док","дрок","код","копт","корд","корт","кот","крот","круп","курд","одр","опт","ор","орк","откуп","подкур","порт","пот","прок","пруд","прут","пуд","пук","род","рок","рот","ток","топ","тор","трок","троп","труд","труп","тур","турок","укор","укроп","упор","урод","урок","уток","утор","утро"],"единорог":["ген","героин","гид","го","год","гон","гонор","гордон","горе","горин","горн","город","дерн","динго","дно","до","дог","донг","донор","дорн","иго","иод","ион","ирод","негр","негроид","норд","одр","ор","орден","ре","регион","ринг","рог","род","родео","рондо"],"писатель":["аист","альт","ас","ель","ил","лапти","лепта","лес","леса","лесть","лет","липа","лис","лиса","лист","литье","пас","пастель","пасть","пат","пес","пест","пила","питье","платье","плес","плеть","плис","плита","пьеса","сап","сель","сет","сеть","си","сиаль","сила","силь","слет","слип","спель","спил","сталь","стапель","стела","степ","степь","стиль","талес","тес","тип","тис"],"вермишель":["веер","евреи","ель","ерш","ерь","ил","ильм","лев","леер","ливер","ливр","мел","мель","ми","мир","ре","рев","реле","шерл","ши","ширь","шлем","шлир","шмель"],"язычество":["вес","вест","вето","воз","вычет","вяз","зев","зет","зов","овес","отвес","отзыв","отсев","очес","свет","светоч","своз","сев","сет","совет","созыв","соты","соя","стезя","счет","счеты","сыч","тес","яс","яство"],"богатство":["ас","бас","батог","боа","бог","бот","ботва","ватт","гавот","го","оса","особа","осот","остов","сабо","саго","сват","сова","сота","стог","тавот","тога","тост"],"стоматолог":["ас","атом","галс","глас","глот","го","гол","голос","лаг","лог","лом","ломота","лот","лото","лотос","маг","масло","мат","мгла","могол","мол","молот","мосол","мост","оса","осмол","осот","отлог","саго","сало","слог","слом","слот","смог","смола","соло","солома","сом","сома","сота","стог","стол","тога","том","томат","тост"],"ускорение":["ерик","ик","инок","ион","иск","керн","керосин","кино","кон","конус","крен","кроение","кун","курение","курс","нос","носик","нукер","оникс","ор","орк","осек","ре","рис","риск","рисунок","роение","рок","русин","сени","сено","серко","си","сирен","сок","сон","сор","срок","сук","сукно","сурик","сурок","укор","укос","урок","урон","ус","усик"],"уничтожение":["еж","енот","жетон","житие","ион","нежин","неон","неуч","нож","нонет","нут","теин","тени","тиун","тон","тун","уж","ужение","ужин","унижение","унион","утончение","уточнение","учение","учет","учинение","чиж","чин","чтение"],"заклепка":["елка","зал","зала","залп","запал","зек","злак","казак","кал","калека","капа","кепка","клака","клепка","лазка","лак","лапа","лапка","лепка","паек","паз","пак","палка","плаз"],"картежник":["акт","актер","анкер","ант","еж","ерик","жакет","жанр","жар","жена","женка","жинка","жир","ик","икра","каик","кант","кантри","каре","каретник","карт","катер","катрен","кератин","керн","кета","кика","кирка","кит","книжка","кран","краник","крен","кретин","крик","крикет","кринка","натек","нектар","нерка","нитка","раж","рак","ранет","рант","ратин","ратник","ре","река","рента","ретина","ржание","таежник","танк","танкер","теин","текинка","тени","терка","терн","тик","тина","тир","тираж","тиран","тире","трак","трек"],"надежность":["ад","анонс","ант","ас","дан","данность","дань","даос","дежа","день","десант","десна","дно","до","дож","донна","досье","еда","еж","енот","жад","жадность","жена","жеода","жест","жесть","жетон","нанос","наст","натес","нежность","неон","нож","нона","нонет","нос","нота","ода","одежа","оса","осень","ость","ось","сад","сажень","сан","сенат","сено","сень","сет","сеть","снедь","сода","сон","сонант","сонет","сота","стадо","стаж","стан","стена","стенд","стон","тень","тес","тодес","тон","тонна","тоннаж"],"авиасалон":["аванс","анис","ас","вал","васин","вина","вино","виола","вис","влас","воин","вол","волан","волна","вона","ива","ил","ион","лава","лавина","лавсан","ласа","лиана","лис","лиса","лосина","навал","навис","налив","нива","нос","овал","овин","олива","оса","осина","саван","сало","салон","сан","сани","сван","си","сила","силон","слава","слив","слива","слон","сова","сон"],"аквариум":["авар","амур","ара","арак","арка","аура","вар","варка","вира","враки","ива","ик","икра","кара","караим","карма","кум","кума","кумир","курва","мавр","мак","маки","мара","марка","ми","мир","мрак","муар","мука","мура","рак","рама","рамка","рука","рукав","увар","уварка","ум"],"арматурщица":["амур","ара","арматура","аура","аут","мара","март","мат","матица","матрац","матрица","маца","ми","мир","мирр","мирт","мирта","митра","муар","мура","рама","раут","ритм","рута","тара","тарарам","тиара","тир","траур","тур","тура","турица","ум","цитра","щи","щит","щур"],"безматок":["азот","акт","аозт","атом","бак","бек","бета","боа","боек","бок","бот","заем","замок","затек","заток","зек","зет","зоб","кеб","кета","кобза","коза","ком","кома","комбат","комета","кот","мазок","мак","макет","мат","мета","метка","мотка","оаз","обет","обкат","обметка","омет","отек","отказ","таз","тако","тезка","тема","ток","том"],"блиндаж":["ад","бадин","бал","блин","дан","джин","длина","жад","жбан","жила","ил","лад","лаж","наиб"],"вафельщица":["альфа","вал","валец","вещица","вещь","вица","ель","ива","ил","лава","лафа","лев","лещ","лиф","львица","фа","фал","фальц","фиал","фила","филе","фильц","цвель","цель","щавель","щель","щи"],"горбуша":["арго","ашуг","багор","бар","боа","бог","бор","бора","бра","бугор","бур","бура","бург","го","гора","горб","граб","гроб","грош","груша","губа","ор","раб","рагу","роба","рог","убор","угар","шаг","шар","шоу","шуба","шуга"],"джокер":["дек","декор","джок","до","дож","док","докер","дрек","дрок","едок","еж","жор","кедр","код","корд","корж","кредо","одр","ор","орк","ре","род","рок"],"автор":["вар","вор","втора","ор","отвар","рвота","ров","рот","рота","тавр","тавро","товар","тор"],"повесть":["вепс","вес","вест","весть","весь","вето","овес","опт","ость","ось","отвес","отсев","пес","песо","пест","повет","поветь","посев","пост","пот","потесь","свет","сев","сет","сеть","совет","степ","степь","тес","топ","топь"],"жестокость":["еж","жест","жесткость","жесть","косость","кость","кот","око","окот","октет","осек","осос","осот","ость","ось","отек","откос","отсек","отсос","отток","секс","сексот","сет","сеть","скот","сок","сосок","стежок","стек","сток","текст","тес","тест","тесто","тесть","ток","тост"],"мартышка":["акт","ара","арак","арка","арык","ашрам","камыш","кара","карат","карма","карт","карта","карты","каша","крыша","мак","мара","марка","март","марш","мат","матка","маштак","мрак","мыт","мышка","рак","ракша","рама","рамка","рык","рым","такыр","тара","трак","шар","шарм","шрам","штык","штыка"],"жаворонок":["важ","вар","вожак","вона","вор","ворон","ворона","воронка","воронко","жанр","жар","жарок","жор","кожа","кон","кора","коран","корж","корова","корона","кран","кров","крона","нож","ножка","ножовка","норка","норов","нрав","окно","око","окова","ор","орк","оркан","орок","раж","рак","ров","рожа","рожок","рожон","рок","ронжа"],"чернослив":["вено","вес","весло","вино","вис","воин","вол","вор","ворс","ил","ион","лев","лен","ленч","лес","ливер","ливр","лис","лич","лори","нерв","нос","овен","овес","овин","олеин","ор","орел","осел","очес","ре","рев","рис","ров","рол","сверло","сев","севр","селин","село","сени","сено","серв","си","силен","силон","сирен","слив","слон","сон","сор","сочлен","челн","чело","чин","чир","число","член","чрево"],"вафельница":["альфа","вал","валец","ваниль","вена","вина","вица","ель","ива","ил","лава","лавина","лань","лафа","лев","левиафан","лен","ленца","лень","лиана","ливень","линь","лиф","львица","навал","навель","навь","налив","неф","нива","фа","фавн","фал","фалинь","фальц","фен","фиал","фила","филе","фильц","финал","финаль","финвал","фланец","цвель","целина","цель","цена","циан"],"целомудрие":["делец","делимое","дело","дилер","до","дол","дом","дуло","думец","идол","ил","иод","ирод","лед","леди","леер","лемур","лидер","лицемер","лицо","лом","лорд","лори","луидор","мед","мел","ми","милорд","мир","мол","мор","море","мудрец","мул","одр","одул","олеум","ор","орел","орлец","орудие","ре","реле","род","рол","ром","удел","удило","удол","улем","ум","умелец","урод","уродец","целое"],"блокнот":["блок","бок","болт","бон","бот","клон","кол","колоб","кон","кот","лоб","лобок","локон","лоно","лот","лото","лоток","обол","окно","око","окот","откол","ток","толк","тон"],"буквоед":["бек","боек","бок","бук","век","веко","дек","до","док","дуб","дубок","едок","кеб","код","куб","обдув","обед","увод"],"нахлестка":["акант","акт","анкета","ант","ас","аскет","атлас","елка","кал","калан","канал","канат","кант","каста","кета","клан","клен","клест","кнехт","лак","ланка","ласа","ласка","ласта","лата","латекс","лахтак","лен","лента","лес","леса","леска","лет","накал","накат","налет","наст","натек","натес","натеска","нахал","саек","сак","саке","салат","сан","секта","сенат","сет","сетка","скала","скат","скена","слет","стакан","стан","стек","стека","стела","стена","стенка","такса","талес","танк","телка","тес","тесак","теска","техас","тлен","хакас","хала","халат","хан","хасан","хата","хек","хна"],"боксит":["бикс","бит","биток","бок","бокс","бот","ботик","ик","иск","исток","кит","кости","кот","си","сито","скот","сок","сток","тик","тис","ток"],"боровик":["бок","бор","боров","вор","ик","короб","кров","обои","оброк","око","ор","орк","орок","ров","ровик","рок"],"брусок":["бок","бокс","бор","брус","бук","букс","бур","куб","курс","ор","орк","рок","сбор","сок","сор","срок","сруб","сук","сурок","убор","укор","укос","урок","ус"],"валькирия":["акрил","ария","вал","валик","вар","вилка","вира","враки","враль","ива","ик","икра","ил","илька","кал","киви","кила","киль","клавир","клир","кляр","краля","криль","лавр","лак","лар","ларь","ливр","лик","лирик","лирика","ля","лярва","рак","ракия","явка","явь","як","ял","ялик","яр","ярка"],"выкаливание":["акание","акын","анклав","вал","валек","валенки","валик","век","великан","вена","веник","вилка","вилы","вина","вливание","вывал","выливание","елка","ива","ик","икание","ил","инки","кал","калан","калин","калина","канал","канва","кивание","киви","кила","клан","клев","клен","лава","лавина","лавка","лак","ланка","лев","левак","лен","лиана","ливы","лик","навал","навивка","навык","накал","наклев","налив","наливка","нива"],"деноминация":["ад","анемия","анемон","анион","аноним","дан","демон","динамо","дно","до","дом","домен","домна","донна","еда","единица","идея","идиома","имя","индиец","иод","ион","иония","мания","мед","медиа","медиация","медицина","мена","ми","мидия","мина","мини","миоцен","мода","модница","наем","наин","намин","нация","неон","нома","номад","номинация","нона","ода","цена","циан","цианид","цинния","яд","яма"],"инобытие":["бетон","бинт","бит","бон","боны","бот","быт","бытие","енот","ион","небо","обет","теин","тени","тон","тын"],"корифей":["ерик","ик","кефир","кий","кофе","кофей","кофр","крой","ор","орк","ре","рей","риф","рой","рок","фойе"],"кульман":["аул","кал","клан","кулан","куль","кум","кума","кун","куна","лак","лань","лук","лука","луна","лунка","лунь","мак","манул","мука","мул","нуль","улан","ум"],"надсечка":["ад","ас","дан","дача","дачка","дек","дека","декан","десна","еда","каданс","кача","насад","наседка","насечка","начес","сад","саек","сак","саке","сан","сдача","секач","сечка","скена","чаек","чакан","чан","час","чек","чека"],"блузка":["азу","аул","бак","бал","баул","блуза","буза","бук","бука","булка","зал","злак","зуб","кал","клуб","куб","лак","луб","луза","лук","лука","указ"],"гвардия":["ад","ария","вар","варяг","варяги","виг","вид","вира","враг","гад","гид","гидра","гиря","град","грива","гряда","дар","ива","игра","ирга","ряд","яд","яр","ярд"],"отслоение":["енот","ил","илот","ион","лен","лес","лет","летие","лето","линт","лис","лист","лоно","лот","лото","лотос","неолит","нилот","нос","олеин","осел","осетин","осот","отел","относ","селен","селенит","селин","село","сени","сено","сет","си","силен","силон","сито","слет","слоение","слон","слот","соление","соло","сон","сонет","стол","столон","стон","теин","тело","тени","тес","тесло","тис","тлен","тление","тон"],"бездельник":["бдение","безе","бек","бел","белек","белки","бель","белье","блик","блин","дебил","дек","денек","день","диез","дизель","ель","ельник","зек","зелень","зелье","зенки","ик","ил","кеб","кельн","киль","клен","лебедь","лед","леди","ледник","лен","лень","лик","линь","низ","никель"],"батиплан":["ант","бал","бант","бинт","биплан","бит","бита","блат","блин","блинт","ил","ланита","лапа","лапина","лапта","лапти","лата","лиана","линт","липа","набат","наиб","паб","палатин","пан","пат","патан","пиала","пила","пина","пинта","план","плата","платан","платина","плита","талиб","тина","тип"],"гортензия":["ген","героин","героиня","гинея","гиря","гит","гнет","го","гон","гонт","горе","горин","горн","грот","енот","зенит","зерно","зеро","зет","зонт","зоря","иго","ион","итог","негр","низ","нория","ор","оргия","отрез","ре","регион","резня","резон","рея","ринг","рог","рот","теин","тени","тенор","теория","терн","тигр","тир","тире","тон","тоня","тор","торг","торги","трио","трог","трон","яр"],"задевание":["ад","азан","азид","ваза","веда","вена","вид","виза","вина","дан","дева","девиз","девиза","диван","диез","еда","езда","зад","задание","заедание","звание","здание","зев","зева","зевание","ива","наезд","нива","низ"],"ископаемое":["ас","ик","иск","искомое","кепи","кипа","ком","кома","коми","компас","коса","маис","мак","маки","ми","миска","мопс","око","окоем","окоп","опак","опека","описка","опоек","оса","осек","осока","оспа","паек","пак","пас","паск","пасмо","пес","песик","пески","песо","песок","пик","пика","пике","пим","писк","поем","поимка","поиск","покос","помои","саек","саепек","сак","саке","сап","сема","си","скип","скоп","скопа","смак","сок","сом","сома","сопа","сопка"],"квашнин":["вина","ива","ик","ишак","наин","нива","ниша","шванк","ши","шик","шина","шкив"],"коллапс":["ас","кал","клоп","кол","копал","коса","лак","лоск","опак","опал","оса","оскал","оспа","пак","пас","паск","пол","пола","полк","полка","сак","сало","салоп","сап","скало","скол","скоп","скопа","сок","солка","сопа","сопка"],"концессия":["ик","инок","ион","иск","кессон","кино","кисея","кон","конец","косец","нос","носик","оникс","осек","оссеин","секс","секция","сени","сено","си","синец","синяк","снос","сок","сон","соня","сосец","сосняк","соя","цинк","як","янки","яс"],"лексика":["ас","елка","ик","ил","иск","каик","кал","кекс","кика","кикс","кила","киска","клик","клика","лак","лес","леса","леска","лик","лис","лиса","лиска","саек","сак","саке","салки","си","сикл","сила","скак"],"мединститут":["деист","дети","дунит","дунст","дуст","индуист","индус","институт","иудеи","мед","мент","ми","мини","минус","муст","нудист","нут","сеид","семит","сени","сет","си","сиенит","сити","стенд","студент","суд","теин","теист","тени","тент","тес","тест","тис","тиун","тмин","туес","тун","тут","ум","ус","утес"],"написание":["анис","ас","наин","пан","панна","пас","пена","пенис","пенни","пенс","пес","пина","пинна","писание","писанина","псина","сан","сани","сап","сапа","сени","си","синап","спина"],"отблеск":["бек","бел","белок","бес","блеск","блок","боек","бок","бокс","болт","боскет","бот","кеб","клест","кол","колет","костел","кот","котел","лес","лесок","лет","лето","леток","лоб","лоск","лот","обет","облет","осек","осел","отек","отел","отсек","село","сет","скол","скот","слет","слот","сок","стек","стекло","сток","стол","столб","тело","телок","тес","тесло","ток","толк"],"паутинка":["акант","акт","актау","ант","аут","ик","канат","кант","капа","капитан","каптан","капут","кипа","кипу","кит","кнут","кун","куна","купа","накат","наука","нитка","нут","пак","пакт","пан","паника","панк","пат","патан","паук","паутина","пик","пика","пикан","пина","пинта","пуант","пук","пункт","путина","путник","танк","тапка","тапки","тик","тина","тип","типун","тиун","тукан","тун","туна","туника","тупик","униат","униатка","утка"],"прорезка":["запор","зарок","зек","зеро","капер","капор","каре","карп","коза","кора","крап","крез","креп","оаз","опак","опека","опера","ор","орк","паек","паз","пак","пар","парез","парк","парок","перка","перо","поза","позер","позерка","показ","покер","пора","порез","порезка","порка","проза","прок","прорез","разок","рак","ре","резак","резка","река","репа","репка","роза","рок","рокер","ропак"],"пугало":["агул","аул","галоп","го","гол","гул","лаг","лог","луг","лупа","огпу","опал","плуг","пол","пола","пул","пула","пуло","угол"],"синева":["анис","ас","васин","вена","вес","весна","вина","вис","ива","навес","навис","нива","сан","сани","сван","сев","сени","си"],"синтепон":["енот","ион","неон","нонет","нос","опт","осетин","пенис","пенни","пенс","пес","песо","пест","петин","пион","пистон","питон","пони","понт","пост","пот","сени","сено","сет","си","сито","сноп","сон","сонет","спинет","степ","стон","теин","тени","теннис","тес","тип","тис","тон","топ"],"смелость":["ель","лес","лесс","лесть","лет","лето","лом","лось","лот","мел","мелос","мель","место","месть","метол","мол","моль","мост","мосье","мотель","мсье","омет","омлет","осел","ость","ось","отел","отель","отмель","село","сель","семь","сет","сеть","слет","слом","слот","смесь","смоль","соль","сом","стол","тело","темь","тес","тесло","толь","том"],"шарлотка":["акт","аорта","ара","арак","арка","кал","калоша","кара","карат","карт","карта","каша","кашалот","коала","кол","кора","корт","кот","кошара","кроат","крот","лак","лар","лата","лот","лошак","ор","орк","отара","рак","ракша","рок","рол","рот","рота","тако","тара","ток","толк","тор","трак","трал","трок","шакал","шала","шар","шарлот","шкала","шкало","школа","шкот","шлак","шок","шот","шрот","штакор","штора","шторка"],"агрономия":["агония","агроном","арго","аргон","ария","армия","гармония","гимн","гиря","гном","гнома","го","гомон","гон","гонор","гора","горин","гормон","горн","гран","грим","гром","иго","игра","имя","ион","ирга","маг","магия","манго","мания","марго","ми","миг","мина","минога","минор","мир","могар","мор","морг","моряна","нога","нома","нория","норма","омар","онагр","ор","орган","оргия","ранг","ринг","рог","ром","роман","яма","яр","ярмо"],"эвристика":["аист","акт","актив","ас","вар","вира","вис","виски","враки","ива","иваси","иврит","ик","икра","ирис","иск","искра","карст","карт","квас","квирит","киви","киста","кит","рак","рис","риск","риска","сак","сатир","сатирик","сват","свита","свитка","си","ситар","сити","скат","старик","стирка","сэр","тавр","такси","тик","тир","тис","тиски","трак","тэк","экстра","эра","эристика","этика"],"авиамодель":["ад","альма","вал","веда","ведьма","вид","видео","виола","вода","водь","вол","давило","даль","дама","дева","дело","диво","до","дол","дом","еда","ель","ива","идеал","идол","ил","ильм","иод","лава","лад","ладо","лама","лев","левада","лед","леди","лом","мала","малов","мальва","мед","медаль","медиа","медь","мел","мель","ми","мода","модель","мол","молва","моль","мольва","овал","ода","оладьи","олива","оливье","омела"],"художество":["вдох","вес","вест","вето","вех","восход","всход","вход","джут","до","дож","досев","дуст","дух","еж","жест","овес","овод","осоед","осот","остов","отвес","отвод","отдух","отсев","отход","свет","свод","сев","сет","совет","суд","сход","тес","тодес","туес","увод","уж","ус","утес","ухо","уход","хвост","ход","хост","худо"],"архаист":["аист","ара","арахис","ас","астра","раса","рахит","рис","сатир","сатира","сахар","си","ситар","стих","страх","тара","тиара","тир","тис","хата","хит"],"воеводство":["ввод","вдовство","вес","вест","вето","до","досев","овес","овод","осоед","осот","остов","отвес","отвод","отсев","свет","свод","сев","сет","совет","тес","тодес"],"выразитель":["альт","артель","ваер","вал","валер","валет","вар","вера","верзила","ветла","взлет","виза","вилы","вира","витье","враль","врез","вылет","вырез","выть","вытье","ель","ерь","завет","зал","залет","залив","зверь","зев","зева","зет","зритель","ива","излет","ил","лавр","лазер","лар","ларь","латы","лев","левират","левит","лет","ливер","ливр","ливы","литавры","литер","литера","литр","литье","разлет","разлив","рать","ре","рев","резь","релиз","риза","рытье","тавр","таз","талер","тварь","тир","тире","трал","трель","тыл"],"купюра":["карп","каюр","крап","круп","крупа","купа","пак","пар","парк","паук","пук","пурка","рак","рука","урюк","юр","юра"],"наложение":["анион","еж","жало","желание","желе","желна","жена","жила","ил","ион","лаж","лежание","лен","ложа","ложе","лонжа","нажин","наин","нежин","неон","нож","нона","олеин","оленина"],"обращение":["бар","барин","барон","боа","бон","бона","бор","бора","борение","борщ","бра","ибер","ион","набор","наиб","небо","обещание","общение","община","ор","раб","ращение","ре","роба","роение","роща","щербина","щи"],"осознание":["анион","анис","анонс","ас","занос","знание","зона","износ","ион","наин","нанос","неон","низ","нона","нос","оаз","оазис","озон","оса","осина","саз","сан","сани","сезон","сени","сено","си","сознание","сон"],"поднебесная":["ад","анонс","ас","баден","баня","бас","басня","басон","баян","беда","бес","беседа","боа","бон","бона","дан","даос","депо","десна","дно","до","донна","еда","нанос","небо","неон","непоседа","нона","нос","обед","обедня","ода","оса","оспа","паб","пан","панно","пас","пена","пенс","пенсне","пеня","пес","песня","песо","победа","посад","пояс","сабо","сад","сан","сап","сдоба","сено","сеноед","сноб","сноп","сода","сон","соня","сопа","соя","спад","ябеда","яд","яс"],"прелесть":["ель","ересь","ерь","леер","лепет","лес","лесть","лет","перл","перль","перст","пес","пест","плеер","плес","плеть","прель","ре","реле","рельс","репс","сель","серп","сет","сеть","слет","спель","степ","степь","тес","трель","треп","трепел"],"призвание":["ваер","вар","вена","вера","виза","вина","вира","врез","запев","звание","зев","зева","ива","инвар","напев","нерв","нерпа","нива","низ","нрав","паз","пан","панер","пар","парез","пари","пена","перина","пиар","пина","пир","приз","ре","рев","резина","репа","репина","риза"],"прямота":["атом","март","мат","мор","мята","омар","опт","ор","пар","паром","паря","пат","пора","порт","пот","пята","ром","рот","рота","том","топ","тор","трап","тромп","троп","тропа","яма","яр","ярмо"],"самозащита":["азиат","азот","аист","аозт","ас","астма","атом","защита","зима","истома","маис","маоист","мат","ми","митоз","мозаист","мост","моща","оаз","оазис","оса","сааз","саам","саами","саз","си","сито","сом","сома","сота","таз","тис","том","щи","щит"],"сроднение":["дерен","дерн","дно","до","доение","дорн","иод","ион","ирод","неон","норд","нос","одр","ор","орден","рдение","ре","редис","ренонс","рис","род","роение","сеид","сени","сено","сеноед","си","сидр","синод","сирен","сон","сор"],"стенопись":["енот","ион","иссоп","нить","нос","опись","опт","осень","осетин","оссеин","ость","ось","пенис","пенс","пень","пес","песнь","песо","пест","петин","пион","пистон","питон","питье","пони","понт","пост","пот","потесь","сени","сено","сень","сет","сеть","си","синь","сито","сноп","снос","сон","сонет","спесь","спинет","степ","степс","степь","стон","теин","тени","тень","тес","тип","тис","тон","топ","топь"],"термометр":["мем","метеор","метр","метро","мор","море","мотет","омет","омметр","ор","ре","реометр","ром","рот","терем","том","тор","торт","тотем","тремор","трот"],"фальшивка":["альфа","афиша","афишка","вал","валик","вилка","ива","ик","ил","илька","ишак","кал","калиф","каша","кила","киль","клавиш","клавиша","лава","лаваш","лавка","лак","лафа","лик","лиф","фа","фал","фиал","фиалка","фила","фиш","фишка","флик","шавка","шакал","шала","шаль","шваль","ши","шик","шкала","шкаф","шквал","шкив","шлак","шлиф"],"аэросъемка":["ара","арак","арека","арка","ас","аскер","камера","камса","кара","каре","карма","ком","кома","комар","комара","кора","корм","корма","коса","краса","крем","мак","мара","марка","марс","маска","мера","мерка","мор","море","морс","мрак","мэр","окрас","омар","ор","орк","оса","осака","осек","оскар","рак","рама","рамка","рамс","раса","ре","река","рема","рок","ром","роса","саам","саек","сак","саке","самар","самка","саркома","сема","сера","серко","скорм","смак","сок","сом","сома","сор","срам","срок","съем","съемка","сэр","экер","эмо","эра","эсер"],"вакуумметр":["акт","актер","амур","аут","ваер","вакуум","вар","век","вера","верк","вермут","ветка","каре","карт","катер","кета","крем","кум","кума","курва","курта","кутум","мавр","мак","макет","март","мат","мем","мемуар","мера","мерка","мета","метка","метр","мрак","муар","мука","мура","рак","раут","ре","рев","река","рема","рука","рукав","рута","тавр","тема","терка","трак","трек","туер","тумак","тур","тура","турка","увар","увертка","ум","утка"],"ворсильщик":["вилок","вис","виски","висок","вол","волк","вор","ворс","воск","ик","ил","ирис","иск","киви","кило","киль","клир","клирос","кол","корь","криль","кров","кровь","кроль","ливр","лик","лирик","лис","лори","лоск","лось","окись","ор","орк","ослик","ось","рис","риск","ров","ровик","рок","рол","ролик","роль","рольщик","свиль","свищ","си","сикл","силок","силь","скол","слив","сливки","сливщик","совик","сок","соль","сор","срок","щи","щорс"],"забавник":["абаз","абазин","абак","азан","база","бак","банк","банка","бивак","вабик","ваза","виза","вина","забивка","заика","знак","ива","изба","ик","кабан","кабина","казна","канва","кинза","набивка","наиб","наказ","нива","низ","низка"],"раздор":["ад","дар","до","доза","зад","задор","оаз","ода","одр","ор","орда","род","роза"],"сифонофора":["анис","ас","ион","нос","ор","оса","осина","офис","рис","риф","роса","сан","сани","си","сифон","сон","сор","софа","софора","фа","фарс","фасон","фирн","фифа","фон","фора","форс","фосфор"],"склепщица":["ас","елка","ик","ил","иск","кал","капище","кепи","кила","кипа","клещ","клещи","клип","клипс","клипса","лак","лепка","лепщик","лепщица","лес","леса","леска","лещ","лик","липа","липка","лис","лиса","лиска","паек","пак","палец","пас","паск","пес","песик","пески","пик","пика","пике","пила","пилка","писец","писк","пища","плац","плащ","плащик","плес","плеск","плис","плиска","плица","саек","сак","саке","салки","сап","си","сикл","сила","скип","склеп","слип","спил","спилка","спица","сцеп","сцепка","сцепщик","цеп","цикл","щека","щелк","щепа","щепка","щи","щипец"],"стрела":["арест","ас","лар","лес","леса","лет","ре","сера","сет","слет","стела","талер","талес","тес","трал"],"трешкоут":["ерш","кеш","кореш","корт","кот","крот","куш","октет","ор","орк","отек","ре","рок","рот","ток","тор","торт","трек","трешкот","трок","трот","туер","тур","турок","тут","тутор","туш","укор","урок","уток","утор","утро","ушко","шкерт","шкот","шок","шот","шоу","шрот","штрек","шут"],"щегленок":["ген","го","гол","гон","кег","клен","клещ","клон","кол","кон","лен","лещ","лог","оленек","щегол","щелк","щелок","щенок"],"студень":["день","дунст","дуст","дутье","нут","сень","сет","сеть","снедь","стенд","суд","суть","тень","тес","туес","тун","ус","устье","утес"],"томагавк":["агат","акт","атом","вага","вата","ватка","гавот","гамак","го","кагат","квота","ком","кома","кот","маг","мак","мат","матка","мотка","октава","отава","отвага","тако","тамга","тога","ток","том"],"абрикос":["абрис","ас","бак","бар","барк","барс","бас","баск","баски","басок","бикс","бирка","боа","бок","бокс","бор","бора","бра","брак","брас","ик","икра","иск","искра","кариб","кобра","кора","коса","краб","окрас","ор","орк","оса","оскар","раб","рак","рис","риск","риска","роба","рок","роса","сабо","саиб","сак","сбор","сбора","сборка","сборки","си","скарб","скоба","сок","сор","срок"],"боеголовка":["бак","бал","балок","бег","бега","бек","бел","белка","белок","благо","блок","боа","бог","боек","бок","бокал","бола","вал","валек","вега","век","веко","вобла","вокал","вол","волга","волк","волок","главк","го","гол","голова","головка","елка","кал","кеб","кег","клев","кол","колба","колоб","лаг","лак","лев","левак","лоб","лобок","лог","логово","обвал","облако","облов","облог","обол","овал","око","окова","олово"],"мармеладка":["ад","аларм","ара","арак","ареал","арека","арка","аркада","армада","дама","дамка","дар","дек","дека","дерма","драка","драма","дрек","дрема","еда","елка","кадр","кал","камера","кара","карда","каре","карма","кедр","клад","клемма","крем","лад","лак","лама","лар","ларек","лед","лемма","лерка","мадам","мадера","мак","маклер","макраме","мала","малек","мама","мамка","мара","марал","марка","мармелад","мед","мел","мем","мера","мерка","мрак","рада","рак","рама","рамка","ре","река","реклама","рема"],"декстрин":["деист","дек","дерн","дети","диск","днестр","дрек","ерик","ик","индекс","иск","кедр","керн","кисет","кит","кредит","крен","крест","кретин","рдест","ре","редис","рис","риск","сеид","сени","сет","си","сидр","сирен","скирд","стек","стенд","стерин","теин","тени","терн","тес","тик","тир","тире","тис","трек","треск"],"кукарекание":["акание","анкер","ара","арак","арека","арена","арка","аркан","арника","аура","ерик","ик","икра","иранка","каик","кара","каре","каркание","кенарка","керн","кика","кирка","кран","краник","крен","крик","крикун","кринка","кукан","кун","куна","кунак","курение","накра","наука","нерка","нукер","рак","рана","ранка","ре","река","руина","рука","руна","укание","украинка","уран","урина","урна"],"развозчица":["авар","ара","арча","ваза","вар","взор","виза","вира","вица","воз","вор","врач","зазор","зов","зраза","ива","извоз","оаз","овца","овчар","ор","орава","развоз","риза","ров","роза","чара","чир"],"сценичность":["енот","ион","истец","неон","нечисть","нить","нонет","нос","ночь","осень","осетин","оссеин","ость","ось","отец","очес","сени","сено","сень","сет","сеть","си","синец","синь","ситец","сито","снос","сон","сонет","сосец","сочень","стон","счес","счет","теин","тени","теннис","тень","тес","течь","тис","тон","ценность","цент","честь","чин","чинность","чистец","чтец"],"телебашня":["ант","бал","балет","бант","баня","батя","башня","баян","бел","белена","беляна","беляш","бета","блат","лен","лента","лет","лея","ля","налет","теша","тлен","тля","шатен","шен","шея","шлея","штаб","ял"],"хлорка":["кал","кол","кора","крах","кроха","лак","лар","лох","ор","орк","охра","рак","рок","рол","хлор","холка","хор","хорал"],"автомобиль":["автол","альбом","альт","атом","бал","било","бит","бита","битва","блат","боа","бола","болт","боль","бот","ботва","вал","виола","вобла","вол","вольта","ива","ил","илот","ильм","лимб","лоб","лом","ломота","ломоть","лот","лото","малов","мат","мать","ми","мол","молва","молитва","молот","молотьба","моль","мольба","мольва","мотив","обвал","облов","облом","обмол","обои","обол","овал","олива","отбив","отвал","отлив","отлов","табло","талиб","тимол","толь","том","тьма"],"ассиметрия":["аист","арест","аритмия","ария","армия","ас","имя","ирис","истерия","маис","марс","март","мастер","мат","материя","мера","меря","месса","мессия","мета","метр","ми","мир","мирт","мирта","мисс","миссия","мистер","мистерия","митра","мята","рамс","расист","ре","рема","ремиссия","рея","рис","ритм","ряса","сатир","сема","семит","семя","сера","серия","сестра","сет","си","сиеста","система","систр","ситар","сити","смета","смятие","срам","стая","стремя","тема","темя","тес","тир","тире","тис","трасс","яма","яр","яс"],"газопровод":["ад","арго","вар","вздор","взор","вода","воз","вор","враг","гад","газ","го","говор","год","гора","город","град","гроза","грозд","дар","двор","до","дог","договор","доза","дозор","дорога","драп","дрова","дрога","завод","заговор","зад","задор","запор","зов","оаз","овод","овраг","оговор","огород","ода","одр","опор","опора","ор","орда","паз","пар","паровоз","повар","повод","погода","подвоз","подгар","подговор","подзор","поза","позор","пора","порог","порода","право","провод","провоз","проза","развод","ров","рог","рогоз","рогоза","род","роза","розга"],"сейсмограф":["айсор","арго","ас","гаер","гарем","гей","герма","герой","го","гора","горе","гофр","гофре","граф","гром","гросс","йог","йога","маг","май","майор","марго","марс","мера","месса","могар","мор","морг","море","морс","морф","морфей","омар","омег","омега","ор","оса","рай","рамс","ре","рей","рейс","рема","рог","рой","ром","роса","саго","сейм","сейф","сема","семафор","семга","сера","смог","сойма","сом","сома","сор","софа","срам","ссора","сфера","фа","фарс","ферма","фес","фойе","фора","форма","форс"],"бесшумность":["бентос","бес","бетон","бон","босс","бот","бунт","бут","бутон","бушмен","енот","мент","место","месть","мост","мосье","мсье","мусс","муссон","муст","мутон","муть","небо","нос","нут","обет","обмен","омет","омут","осень","ость","ось","семь","сено","сень","сет","сеть","смесь","сноб","снос","собес","сом","сон","сонет","сонм","соус","стон","суть","сушь","темь","тень","тес","том","тон","тонус","туес","тун","туш","тушь","ум","ус","устье","утес","шен","шест","шмон","шоссе","шот","шоу","шоумен","штос","штосс","шум","шуст","шут"],"минутка":["акт","ант","аут","ик","камин","кант","кит","кнут","кум","кума","кун","куна","мак","маки","мант","манту","мат","ми","мина","минута","мука","нитка","нут","танк","тик","тина","тиун","тмин","тукан","тумак","туман","тун","туна","туника","ум","умник","униат","утка"],"подбородок":["бок","бор","брод","до","добор","добро","док","дрок","код","корд","короб","обод","ободок","оброк","одр","око","окоп","опор","опорок","ор","орк","орок","побор","подбор","порок","прок","род","рок"],"подросток":["до","док","доктор","допрос","дрок","код","копт","корд","корт","кот","крот","одр","око","окоп","окот","опор","опорок","опорос","опрос","опт","ор","орк","орок","ортодокс","осот","откос","отоскоп","отпор","отрок","подток","покос","порок","порт","пост","пот","поток","прок","прокос","просо","проток","род","родос","рок","рокот","ропот","рост","росток","рот","скоп","скот","сок","сор","сорт","спор","спорок","спорт","срок","сток","стопор","строп","ток","топ","топор","тор","торос","торс","трок","троп","трос"],"прообраз":["бар","боа","бор","бора","бра","забор","запор","зоб","оаз","обзор","обоз","образ","опор","опора","ор","паб","паз","пар","побор","поза","позор","пора","проба","пробор","проза","прораб","раб","разбор","роба","роза"],"флорист":["ил","илот","лис","лист","литр","лиф","лифт","лори","лот","ор","орфист","офис","офит","рис","риф","рол","рост","рот","си","сито","ситро","слот","сор","сорит","сорт","софит","стирол","стол","тир","тис","тиф","тор","торс","торф","трио","трос","флирт","флот","фол","форс","форт","фтор"],"штурмовик":["виток","вор","вотум","ик","кворум","кит","ковш","ком","коми","корм","корт","кот","кров","крот","кум","кумир","куш","ми","мир","мирт","мор","мотив","омут","ор","орк","ритм","ров","ровик","рок","ром","рот","ротик","тик","тир","ток","том","томик","тор","трико","трио","трок","тур","турки","турок","туш","укор","ум","умишко","урок","уток","утор","утро","ушко","ши","шик","шкив","шкот","шмотки","шов","шок","шот","шоу","шрот","шторм","штурм","шум","шумовик","шумок","шут"],"самоанализ":["азан","алмаз","анализ","анис","ас","зал","зала","занос","заслон","засол","зима","зло","зола","зона","излом","измол","износ","ил","ион","ислам","лама","ласа","лиана","лиман","лимон","линза","лис","лиса","лоза","лозина","лом","лосина","маис","мала","малина","мана","манси","маслина","масло","масон","ми","милан","мина","мол","налим","намаз","намол","низ","нома","нос","оаз","оазис","оса","осина","осман","сааз","саам","саами","саз","сазан","сало","салон","саман","сан","сани","си","сила","силон","слом","слон","смола","сом","сома","сон","сонм"],"кассатор":["акт","аорта","ара","арак","арка","артос","ас","астра","кара","карат","карст","карт","карта","касса","каста","кастор","кора","корт","коса","костра","кот","краса","красота","кроат","кросс","крот","окрас","ор","орк","оса","осака","оскар","отара","рак","раса","раскат","раскос","рок","роса","рост","рот","рота","сак","сакс","скат","скот","сок","сор","сорт","соска","сота","сотка","срок","ссора","старка","сток","строка","тако","такса","тара","ток","тор","торс","тоска","трак","трасс","трасса","трок","трос"],"проволока":["вал","вар","вокал","вол","волк","волок","вор","кал","капор","карп","клоп","кол","копал","кора","корова","крап","кров","лавр","лак","лар","овал","око","окова","окоп","окрол","олово","опак","опал","опор","опора","опорок","ор","орк","орок","пак","паоло","пар","парк","парок","плав","плов","повал","повар","поволока","пол","пола","полк","полка","поло","полок","пора","порка","порок","право","провал","прок","прокол","рак","раколов","ров","рок","рол","ропак"],"растирание":["аист","анис","ант","ара","арена","арест","ас","астра","иранист","ирис","истина","наитие","нарта","наст","натес","рана","ранет","рант","раса","растр","ратин","ре","рента","ретина","ринит","рис","сан","сани","санитар","сатин","сатинер","сатир","сатира","сенат","сени","сера","серна","сет","си","сиенит","сиерра","сирен","сирена","ситар","сити","стан","старание","старина","стеарин","стена","стерин","страна","тара","таран","теин","тени","терн","терраса","тес","тесина","тиара","тина","тир","тиран","тире","тис","транс","триер","триера"],"хохотание":["ант","енот","ион","неохота","нота","охание","охота","теин","тени","тина","тон","хан","хит","хитон","хна","хон","хота","хохот"],"пульсация":["ас","аул","ил","липа","лис","лиса","лупа","ля","ляп","ляпис","палия","пас","паяц","пила","плац","плис","плица","пляс","пул","пула","пульс","пуля","пяла","сап","си","сиаль","сила","силь","слип","спил","спица","сулица","суп","улица","ус","цапля","ял","яс","ясли"],"самородок":["ад","ас","даос","дар","до","док","дока","дом","домра","доска","дрок","кадр","код","кода","ком","кома","комар","комод","кора","корд","корда","корм","корма","коса","мак","марс","мода","мор","морда","морок","морока","морс","мрак","ода","одр","око","окрас","омар","ор","орда","орк","орок","оса","осадок","оскар","осока","рак","рамс","род","родос","рок","ром","роса","сад","садок","сак","сард","скорм","смак","смрад","сода","сок","сом","сома","сор","сорока","срам","срок"],"вентилятор":["вено","веня","вето","вино","винт","воин","вол","воля","вор","енот","ил","илот","ион","лев","левит","лен","лет","лето","лея","ливер","ливр","ливрея","линт","литер","литорея","литр","лори","лорнет","лот","ля","неволя","неврит","неолит","нерв","нилот","нория","овен","овин","олеин","ор","орел","ответ","отел","отит","отлет","отлив","отнятие","ре","рев","рея","ров","роевня","рол","рот","твин","теин","тело","тени","тенор","тент","теория","терн","тетрил","тетя","тир","тире","титло","титр","тлен","тля","тон","тоня","тор","торит","торт","трио","триолет","тритон","трон","трот","тротил","явор","ял","яр"],"амортизатор":["азарт","азиат","азот","аозт","аорта","ара","ариозо","аромат","артрит","артроз","атом","замор","затор","зима","мазар","мара","март","мат","ми","мир","мирза","мирр","мирт","мирта","митоз","митра","мор","мороз","мортира","мотор","оаз","омар","ор","оратор","отара","отит","рама","риза","ритм","ритор","роза","ром","рот","рота","ротатор","ротор","таз","тара","тиара","тир","титр","том","томат","тор","торизм","торит","тормоз","торт","трата","трио","трот"],"родник":["дно","до","док","дорн","дрок","ик","инок","иод","ион","ирод","кино","код","кон","корд","норд","одр","ор","орк","род","рок"],"маркетинг":["агент","акт","актер","анкер","ант","гаер","гарем","гарт","гектар","ген","герма","гетман","гетра","гиена","гимн","гит","гитан","гнет","гран","гранит","грант","грек","греки","грена","гренки","грим","ерик","игра","игрек","ик","икра","ирга","камин","кант","кантри","каре","кармин","карт","картинг","катер","катрен","кег","кератин","керн","кета","кит","книга","кран","крем","крен","кретин","маг","магнит","мак","макет","маки","манер","мант","март","мартен","мат","материк","мена","менгир","мент","ментик","мера","мерин","мерка","мета","метан","метка","метр","метрика","ми","миг","мигрант","мина","минарет","минер","мир","мирт","мирта","митенка","митра","мрак","наем","намек","намет","натек","нега","негр","нектар","немка","нерка","нитка","рак","ранг","ранет","рант","ратин","ратник","ре","река","рема","рента","ретина","ринг","ритм","танк","танкер","теин","тема","тени","терка","термин","терн","тигр","тик","тина","тир","тиран","тире","тмин","трагик","трак","трек"],"инкубатор":["аборт","аконит","акт","ант","аут","бак","бакун","банк","банкир","банкрот","бант","бантик","бар","барин","барит","баритон","барк","баркин","барон","батник","батон","бинт","бирка","бит","бита","биток","боа","бок","бон","бона","бор","бора","борт","бортик","бортник","бот","ботаник","ботик","бра","брак","брат","братик","браток","брокат","бук","бука","бунт","бур","бура","бурак","буран","бурат","буратино","бурка","бурки","бурт","бут","бутик","бутон","ик","икона","икота","икра","инок","ион","кант","кантор","кантри","кариб","каротин","карт","картон","катион","кино","кит","кнут","кобра","кобура","кон","контра","контур","конура","кора","коран","корт","кот","котурн","краб","кран","кроат","крона","крот","куб","кун","куна","курант","курта","куртина","кутора","набор","наиб","нитка","нокаут","норка","нота","нотка","нут","нутро","обкат","обрат","обтирка","ор","орбита","орк","оркан","отруби","отрубник","раб","работник","рак","рант","ратин","ратник","раут","роба","рок","рот","рота","ротик","рубанок","рубин","рубка","руина","рука","руна","рута","рутина","табор","табу","табун","тако","танбур","танк","тик","тина","тир","тиран","тиун","ток","тон","тоник","тоника","тор","торба","торбан","трак","триба","трибун","трибуна","трико","трио","трок","трон","труба","трубка","туба","тукан","тун","туна","туника","тур","тура","турбина","турин","турка","турки","турник","турок","убор","уборка","укор","униат","уран","урина","урна","урок","урон","утка","уток","утор","уторка","уторник","утро","утроба"],"малахит":["ил","лама","ламаит","лата","мала","мат","мах","ми","хала","халат","хам","хамит","хата","хит","хлам"],"паровоз":["вар","взор","воз","вор","запор","зов","оаз","опор","опора","ор","паз","пар","повар","поза","позор","пора","право","провоз","проза","ров","роза"],"русалочка":["акула","ара","арак","арка","арча","ас","аул","аура","кал","кара","караул","кача","коала","кол","кора","корча","коса","косач","краса","круча","курс","куча","лак","лаоска","лар","ласа","ласка","лачка","лоск","лук","лука","луч","лучок","окрас","ор","оракул","орк","оса","осака","оскал","оскар","рак","раса","раскол","раус","рок","рол","роса","рука","русак","русалка","русло","ручка","сак","сакура","сало","сачок","скала","скало","скол","скула","случка","сок","солка","сор","срок","сук","сука","сура","сурок","сучок","счал","счалка","укол","укор","укос","улар","улочка","урал","урок","ус","усач","чакра","чал","чалка","чара","чарка","час","часок","чаус","чулок","чурка"],"валерьянка":["авар","аврал","акварель","анвар","анкер","анклав","ара","арак","ареал","арека","арена","арка","аркан","аянка","ваер","вал","валек","валер","валерьяна","вар","варан","варка","варнак","век","вена","веня","вера","верк","верняк","веялка","враль","вранье","елка","ель","ерь","кавалер","кавальер","каверна","кал","калан","кальян","канал","канва","кара","каре","келарня","келарь","кельн","келья","керн","клан","клев","клен","кляр","краля","кран","крен","лава","лавка","лавр","лавра","лак","ланка","лань","лар","ларек","ларь","лев","левак","лекарь","лен","лень","лерка","лея","ля","лярва","навал","навар","навель","навь","накал","наклев","накра","нарва","нарвал","нерв","нерка","неявка","нрав","рак","рана","ранка","рань","рвань","ре","рев","река","рея","яванка","явка","явь","як","ял","январь","яр","ярка"],"поломка":["кал","клоп","кол","ком","кома","копал","лак","лом","ломка","мак","мол","молока","око","окоп","опак","опал","пак","паоло","пол","пола","полк","полка","поло","полок","помол"],"двустволка":["автол","ад","акт","ас","аул","аут","вал","ввод","вдова","вклад","вкус","влас","вода","водка","вокал","вол","волк","воск","втулка","даос","до","док","дока","дол","доска","дувал","дукат","дуло","дулов","дуст","кал","катод","квас","квота","клад","код","кода","кодла","кол","коса","кот","куда","куст","кутас","лад","ладо","лак","латук","лодка","локаут","лоск","лоскут","лот","лук","лука","лукавство","овал","ода","одул","оклад","оса","оскал","отвал","откус","сад","садок","сак","сало","сват","свод","сводка","скало","скат","скатол","скаут","склад","скол","скот","скула","словак","слот","сова","совка","сода","сок","солдат","солка","сота","сотка","стадо","ствол","сток","стол","стук","стул","суд","судак","судок","сук","сука","тако","ток","толк","тоска","тусовка","увал","увод","удав","удол","уклад","укол","укос","улов","уловка","ус","уста","устав","утка","уток"],"гранатомет":["агар","агат","агент","агнат","агреман","анатом","ангар","ант","аорта","ара","арго","аргон","арена","аромат","атом","гаер","гарант","гарем","гарт","ген","герма","гетман","гетра","гетто","гнет","гном","гнома","го","гон","гонт","гора","горе","горн","грамота","гран","гранат","грант","грена","гром","грот","енот","маг","магнат","мана","манго","манер","манера","мант","манто","мара","маран","марго","марена","март","мартен","мат","матрона","мена","мент","мера","мета","метан","метр","метро","могар","монета","монтер","мор","морг","морген","море","морена","мотет","нагар","нагота","наем","намет","нарта","нега","негр","немота","нога","ногата","нома","номер","норма","нота","омар","омег","омега","омет","онагр","ор","орган","отара","отмена","отмета","рама","рана","ранг","ранет","рант","ре","регата","рема","ремонт","рента","рог","ром","роман","рот","рота","ротанг","таган","тамга","танго","тара","таран","театр","тема","темнота","тенор","тент","тератома","терн","тета","тога","том","томан","томат","тон","тор","торг","торт","тотем","трата","тренога","трог","трон","трот"],"программист":["аист","ампир","аорист","арго","артос","ас","атом","гарт","гипс","гит","го","гоист","гора","грамм","грим","гром","грот","иго","игра","имам","импорт","ирга","ирмос","истома","итог","маг","магистр","маис","маоист","марго","марс","март","мат","матрос","ми","миг","мим","миома","мир","мирр","мирт","мирта","митра","могар","мопс","мор","морг","морс","мортира","мост","мрамор","мраморист","омар","опт","ор","оса","оспа","памир","пар","пари","паром","парторг","пас","пасмо","пастор","пат","пиар","пиастр","пим","пир","пират","пирог","пирога","пирс","пора","порт","портсигар","пост","постриг","пот","потир","пригар","прима","примас","примат","приор","прирост","присмотр","прогар","псаммит","рамс","рапорт","рапс","распор","растр","рис","ритм","ритор","рог","ром","роса","рост","ростр","ростра","рот","рота","саго","саммит","сап","сапог","сапоги","сатир","си","сиг","сигма","симптом","сипота","сироп","сирота","ситар","сито","ситро","смог","смотр","сом","сома","сопа","сор","сорит","сорт","сортир","сота","спирт","спор","спора","спорт","срам","старпом","стог","стопа","строп","стропа","тапир","тигр","тип","тир","тис","тога","том","томми","топ","тор","торг","торги","торс","трап","трио","трип","трог","тромп","троп","тропа","трос"],"потолок":["клоп","кол","копт","кот","лот","лото","лоток","око","окоп","окот","оплот","опт","откол","плот","пол","полк","поло","полок","пот","поток","ток","толк","топ"],"кооператив":["автор","акт","актер","актив","ваер","вар","век","веко","вектор","вера","верк","ветка","вето","вира","виток","вор","ворот","ворота","враки","втора","ерик","ива","ик","икота","икра","ипотека","капер","капор","капот","каре","карп","карт","катер","квота","кепи","кета","кивер","киото","кипа","кирова","кит","ковер","копир","копт","кора","корвет","корова","корт","кот","крап","креп","крипта","кроат","кров","крот","око","окова","окоп","окот","опак","опека","опера","опоек","опор","опора","опт","оптик","оптика","оптовик","ор","орк","орок","отвар","отек","отпор","отроек","отрок","паек","пак","пакет","пакт","пар","пари","парик","парк","паркет","парок","пат","патер","патерик","перка","перо","петровка","пиар","пивко","пиво","пик","пика","пике","пикет","пир","пират","питер","повар","поверка","повет","повтор","покер","пора","порка","порок","порт","портик","портки","портовик","пот","потек","потир","поток","право","привет","приток","проект","прок","прокат","проток","протока","рак","рвота","ре","реактив","рев","река","репа","репка","ров","ровик","рок","рокот","ропак","ропот","рот","рота","ротик","тавр","тавро","тако","тапер","тапир","тапки","терка","тик","тип","тир","тире","товар","ток","топ","топик","топика","топка","топор","топорик","тор","трак","трап","трек","треп","трепак","трепка","трико","трио","трип","трок","троп","тропа","тропик","тропка"],"суходол":["до","дол","досол","дуло","дух","лох","одул","олух","слух","соло","солод","суд","сход","удол","ус","ухо","уход","ход","холод","худо"],"забастовка":["абаз","абак","автобаза","азот","акт","аозт","ас","атака","база","бак","бас","баск","баска","басок","боа","бок","бокс","бот","ботва","ваза","вакса","вата","ватка","воз","возка","воск","забава","забота","закат","засов","застава","заставка","заток","зоб","зов","каста","квас","квота","кобза","коза","коса","кот","оаз","обкат","октава","оса","осака","отава","отказ","сааз","саба","сабза","сабо","савка","саз","сак","саква","сват","своз","сказ","скат","скоба","скот","собака","сова","совка","сок","сота","сотка","ставка","сток","табак","таз","тако","такса","тасовка","ток","тоска"],"странствие":["аист","анис","ант","арест","артист","ас","атеист","ваер","вар","васин","ватин","ватт","вена","вера","верста","вес","весна","вест","вина","винт","вира","вис","ива","инвар","навес","навет","навис","насест","наст","натес","неврит","нерв","нива","нитрат","нрав","ранет","рант","расист","рассвет","рассев","ратин","ре","рев","рента","ретина","рис","сан","сани","сатин","сатинер","сатинет","сатир","сван","сват","свес","свет","свист","свита","свитер","сеанс","сев","севр","сенат","сени","сера","серв","сервант","сервис","серна","сестра","сет","си","сиеста","синева","сирен","сирена","систр","ситар","стан","станс","старт","стеарин","стена","стерва","стерин","стрит","тавр","тарист","твин","твист","театр","теин","теист","тени","тент","терн","тес","тесина","тест","тета","тетива","тина","тир","тиран","тире","тис","титан","титр","травести","транс","трасс","траст","трест","треста","триест"],"туземка":["азу","акт","аут","заем","закут","затек","зек","зет","зуек","кета","кум","кума","мазут","мак","макет","мат","мета","метка","муза","мука","таз","тезка","тема","туз","тумак","указ","ум","утка"],"снегурочка":["аксон","анкер","анус","анчоус","арго","аргон","ас","аскер","гаер","гарсон","гарус","ген","гнус","го","гон","гонка","гончак","гончар","гора","горе","горка","горн","горчак","гран","грач","грек","грена","греча","гречка","гуран","гусар","гусек","кагор","каре","кег","керн","кон","конура","конус","кора","коран","корча","коса","косач","кочан","кочегар","кочерга","кран","крен","крона","круг","круча","куга","кун","куна","кунг","кунгас","курс","куча","кучер","начес","нега","негр","негус","нерка","неуч","нога","норка","нос","ночка","нуга","нукер","океан","окрас","округ","округа","онагр","онуча","ор","орган","орк","оркан","оса","осек","осечка","оскар","очаг","очерк","очес","оческа","рагу","рак","ранг","раус","ре","река","речка","речонка","рог","рогач","рок","роса","рука","руна","русак","ручка","ручонка","саго","саек","саенко","сак","саке","сан","сачок","сгон","сгонка","секач","сено","сера","серко","серна","сеунч","сечка","сканер","скарн","скена","снег","сок","сон","сор","срок","сук","сука","сукно","сура","сурна","сурок","сучок","угар","угон","укор","укос","уран","урна","урок","урон","ус","усач","учан","чаек","чан","час","часок","чаус","чек","чека","черноуска","чеснок","чурек","чурка"],"цесарка":["ара","арак","арека","арка","ас","аскер","кара","каре","краса","рак","раса","ре","река","саек","сак","саке","сера"],"экскаватор":["авар","автокар","автор","акт","аорта","ара","арак","арка","артос","ас","астра","вакса","вар","варка","вата","ватка","вор","ворс","воск","врата","втора","какао","кара","карат","каратэ","каркас","карст","карт","карта","каска","каста","кастор","касторка","каток","кварк","квас","квота","ковка","кок","кока","кокс","кора","корка","корсак","корт","коса","костра","кот","краков","краса","краска","красота","красотка","кроат","кроатка","кров","кроватка","крот","окрас","окраска","октава","ор","орава","орк","оса","осака","оскар","отава","отара","отвар","отрава","рак","раса","раскат","расковка","рвота","ров","рок","роса","рост","рот","рота","савка","сак","саква","свара","сварка","сват","свора","скак","скат","скатка","сковка","скок","скот","сова","совка","сок","сор","сорт","сота","сотка","срок","ставка","старка","створ","створка","сток","строка","сэр","тавр","тавро","тако","такса","тара","тасовка","товар","товарка","ток","тор","торс","тоска","трава","травка","трак","трок","трос","тэк","экватор","экстра","эра","эрот","эскорт"],"наперсток":["аксон","акт","актер","анкер","ант","арест","артос","ас","аскер","аскет","аспект","енот","кант","кантор","капер","каперс","капор","капот","капрон","каре","карп","карст","карт","картон","кастор","катер","катрен","керн","кета","кон","контра","копна","копт","кора","коран","корнет","корсет","корт","коса","костер","костра","кот","кран","крап","кратное","крен","креп","крест","кретон","кроат","крона","крот","напор","нарост","наст","натек","натес","нектар","нерка","нерпа","норка","нос","нота","нотка","океан","окрас","опак","опека","опера","опт","ор","орк","оркан","оса","осек","осетр","оскар","оспа","отек","отеска","отсек","паек","пак","пакет","пакт","пан","панер","панк","пар","парк","паркет","парок","парсек","пас","паск","пастор","пат","патер","патрон","пекан","пена","пенка","пенс","перка","перо","персона","перст","пес","песо","песок","пест","покер","понт","понтер","пора","порка","порт","пост","пот","потек","потерна","прекос","проект","прок","прокат","просек","просека","простак","протес","рак","ранет","рант","рапс","ре","река","рента","репа","репка","репс","рок","ропак","роса","рост","рот","рота","саек","саенко","сак","саке","сан","сап","сапер","секатор","секта","сектор","сенат","сенатор","сено","сера","серко","серна","серп","сет","сетка","сканер","скарн","скат","скена","скепт","скоп","скопа","скорпена","скот","скрап","скрепа","снеток","сноп","сок","сон","сонет","сопа","сопка","сор","сорт","сота","сотерн","сотка","спектр","спор","спора","спорт","срок","стан","станок","стек","стека","стена","стенка","степ","сток","стокер","стон","стопа","стопка","строка","строп","стропа","тако","танк","танкер","тапер","тенор","терка","терн","тес","тесак","теска","ток","тон","топ","топка","тор","торс","тоска","трак","транс","трап","трек","треп","трепак","трепан","трепка","треск","треска","трок","трон","троп","тропа","тропка","трос"],"фиаско":["ас","ик","иск","коса","оса","офис","сак","си","скиф","сок","софа","фа","факс","фикс"],"автомеханик":["авиетка","акание","акант","аконит","акт","актив","амвон","анатом","анкета","ант","антиква","атом","атомник","ванта","вата","ватин","ватка","ватман","ватник","вахта","век","веко","вена","веник","вено","венок","ветка","веткин","вето","вех","веха","виконт","вина","вино","винотека","винт","виток","воин","вона","енот","ива","ик","икона","икота","инок","ион","камин","канат","канва","кант","катание","катион","квант","квинта","квота","квохтание","кета","кино","кит","кнехт","ком","кома","комета","коми","комната","кон","кот","маевка","мак","макание","макет","маки","мана","манатки","маниок","маниока","манка","манок","мант","манто","мат","матка","мах","махан","махание","махаон","махина","маховик","мена","мент","ментик","мета","метан","метка","мех","меха","механик","механика","ми","мина","митенка","моевка","монах","монета","монетка","мотив","мотка","мох","мохна","мохнатка","навет","навиток","наем","накат","намек","намет","намотка","натек","немка","немота","нехватка","нива","нивх","нивхка","нитка","новик","нома","нота","нотка","овен","овин","окание","океан","октава","омет","отава","отек","отмах","отмена","охание","охват","тако","танк","твин","теин","тема","тени","техник","техника","тик","тина","тмин","ток","том","томан","томик","тон","тоник","тоника","хаки","хам","хамит","хамитка","хамка","хан","хата","хват","хватание","хватка","хвоинка","хек","хит","хитон","хна","хон","хота"],"адсорбент":["аборт","абсент","ад","адрес","ант","арест","артос","ас","баден","бант","бар","бард","барон","баронет","барс","бас","басон","батон","беда","беднота","бедра","бедро","бентос","бердан","бердо","бес","бета","бетон","боа","бон","бона","бор","бора","борт","бот","бра","брас","брат","бред","брест","брод","дан","даос","дар","дерн","десант","десна","днестр","дно","до","дорн","дрена","еда","енот","набор","нард","народ","нарост","наст","натес","небо","недра","норд","нос","нота","обед","обет","обрат","ода","одр","ор","орда","орден","оса","осетр","раб","радон","ранет","рант","рдест","ре","редан","рента","роба","род","роса","рост","рот","рота","сабо","сад","сан","сард","сбор","сбора","сброд","сдоба","сенат","сенатор","сено","сера","серб","серна","сет","сноб","собрат","сода","сон","сонет","сор","сорт","сота","сотерн","среда","стадо","стан","стена","стенд","стон","табор","тенор","терн","тес","тодес","тон","тор","торба","торбан","торс","транс","треба","трон","трос"],"абажур":["ажур","ара","араб","арба","аура","бар","баржа","бра","буж","бур","бура","жаба","жабра","жар","жара","раб","раба","раж","уж"],"всемирность":["вено","верность","вес","вест","весть","весь","вето","вино","винт","виньет","вис","виссон","витье","воин","вонь","вор","ворс","енот","ерь","инвестор","ион","ирмос","мент","мерин","меринос","мерность","месиво","место","месть","метр","метро","ми","минер","минор","мир","мирность","мирт","мисс","мистер","монист","монстр","монтер","мор","море","морс","мост","мосье","мотив","мсье","неврит","нерв","нить","новь","номер","нос","овен","овес","овин","омет","ор","осень","осетин","осетр","оссеин","острие","ость","ось","отвес","отсев","ре","рев","ревность","ремонт","рис","ритм","ров","ром","рост","рот","свес","свет","свист","свитер","сев","севр","семит","семь","сени","сено","сень","сеньор","серв","сервис","серость","сет","сеть","си","сивость","синь","синьор","сирен","сирень","сирость","систр","сито","ситро","смерть","смесь","смотр","снос","совесть","совет","совмин","сом","сон","сонет","сонм","сор","сорит","сорт","сотерн","створ","стерин","стернь","стон","твин","теин","темь","тени","тенор","тень","термин","термос","терн","тес","тир","тире","тис","тмин","том","тон","тор","торс","трином","трио","трон","трос"],"глухонемота":["агент","агул","алеут","амулет","ангел","ант","атом","аул","аут","галун","гамлет","ген","гетман","глот","глум","глухота","гнет","гном","гнома","го","гол","гомон","гон","гонт","гул","гулена","гумно","гута","енот","лаг","лагун","ламут","лангет","лгун","легат","лен","лента","лет","лето","летун","лог","лом","ломота","лонгет","лоно","лот","лото","лох","луг","луна","маг","манго","мант","манто","манту","манул","мат","мах","мгла","мел","мена","мент","ментол","мета","метан","метла","метол","мех","меха","многое","могол","мол","молот","молох","монах","монгол","монета","мох","мохна","мул","мулат","мутаген","мутон","муха","нагул","наем","налет","налог","намет","намол","намолот","нега","немота","неохота","нога","нома","нота","нуга","нут","оленуха","олеум","олух","омег","омега","омела","омет","омлет","омут","отгон","отгул","отел","отлог","отмах","отмена","охота","талон","танго","тело","тема","теолог","технолог","тлен","тога","том","томан","тон","туман","тун","туна","тунг","угол","угон","улан","улем","ум","умолот","утеха","уха","ухо","хам","хан","хлам","хна","хомут","хон","хота","хула","хунта"],"интрига":["ант","гарт","гит","гитан","гран","гранит","грант","игра","ирга","ранг","рант","ратин","ринг","ринит","тигр","тина","тир","тиран"],"адмирал":["ад","аларм","ара","дама","дар","драма","ил","лад","лама","лар","мала","мара","марал","ми","мир","рада","рама"],"крематорий":["акт","актер","атом","ерик","ик","икота","икра","икромет","йот","йота","каре","карт","картер","катер","кета","кий","кит","ком","кома","комар","комета","коми","кора","корм","корма","корт","кот","край","кратер","крем","кроат","крой","крот","май","майор","мак","макет","маки","март","мат","материк","мера","мерка","мета","метка","метр","метрика","метро","ми","мир","мирр","мирт","мирта","митра","мойка","мор","море","мортира","мотка","мрак","омар","омет","ор","орк","отек","рай","райком","рак","ре","реактор","рей","рейка","рейтар","река","ректор","рема","ритм","ритор","рой","рок","рокер","ром","рот","рота","ротик","тайм","таймер","тако","тема","терка","тик","тир","тире","той","ток","токай","том","томик","тор","торий","трак","трек","тремор","триер","триера","трико","трио","трирема","тройка","трок"],"монетарист":["аист","аметист","анис","анортит","ант","аорист","арест","аристон","артист","артос","ас","атеист","атом","атомист","енот","ион","ирмос","истома","маис","манер","манси","мант","манто","маоист","марс","март","мартен","масон","мастер","мастит","мат","матрос","мена","мент","мера","мерин","меринос","место","мета","метан","метр","метрит","метро","ми","мина","минарет","минер","минор","мир","мирт","мирта","мистер","митра","монета","монист","монстера","монстр","монтер","мор","море","морена","морс","мост","мотет","наем","намет","нарост","наст","натес","немота","нитрат","нома","номер","норма","нос","нота","омар","омет","ор","оса","осетин","осетр","осетрина","осина","осман","остеит","остит","острие","отит","отмена","отмета","отметина","рамс","ранет","рант","ратин","ре","рема","ремонт","рента","реостат","ретина","рис","ритм","ром","роман","романист","романс","роса","рост","рот","рота","самнит","сан","сани","сантим","сантиметр","сатин","сатинер","сатинет","сатир","сема","семинар","семит","сенат","сенатор","сени","сено","сера","серна","сет","си","сирен","сирена","сирота","ситар","сито","ситро","смена","смета","смирна","смотр","сом","сома","сон","сонет","сонм","сор","сорит","сорт","сортамент","сортимент","сота","сотерн","срам","стан","старт","статор","стеарин","стена","стерин","стон","стрит","тарист","театр","теин","теист","тема","темнота","тени","тенор","тент","термин","термист","термит","термос","терн","тес","тесина","теснота","тест","тесто","тета","тина","тир","тиран","тире","тис","титан","титр","тмин","том","томан","томат","тон","тор","торит","торс","торт","тост","тостер","тотем","транс","траст","трест","треста","триест","трином","трио","тритон","трон","трос","трот"],"коленка":["елка","кал","клан","клен","клок","клон","кок","кока","кол","колена","кон","конек","конка","лак","лен","океан"],"отстранение":["аист","анион","анис","анонс","анортит","ант","аорист","арест","аристон","артист","артос","ас","атеист","енот","интерес","интерн","интернат","интернет","ион","наин","нанос","нарост","наст","настроение","натес","натрон","неон","нерест","нитрат","нона","нонет","нос","нота","онанист","ор","оса","осетин","осетр","осетрина","осина","остеит","остит","остранение","острение","острие","отит","ранение","ранет","рант","растение","ратин","ре","ренет","ренонс","рента","реостат","ретина","рис","роение","роса","росинант","рост","рот","рота","сан","сани","сатин","сатинер","сатинет","сатир","сенат","сенатор","сени","сено","сера","серна","сет","сеттер","си","сирен","сирена","сирота","ситар","сито","ситро","сон","сонант","сонет","сор","сорит","сорт","сота","сотерн","стан","старение","старт","статор","стеарин","стена","стенание","стерин","стон","стрит","строение","танин","тарист","театр","теин","теист","тенета","тени","теннис","тенор","тент","терн","тес","тесание","тесина","теснина","теснота","тест","тесто","тета","тетерин","тина","тир","тиран","тире","тис","титан","титр","тон","тонина","тонна","тор","торит","торс","торт","тост","тостер","транс","траст","трение","трест","треста","триест","трио","тритон","троение","троетес","трон","трос","трот"],"критика":["акт","ик","икра","каик","карт","кика","кирка","кит","крик","критик","рак","тик","тир","трак"],"прибалтика":["абак","акрил","акт","алиби","апилак","ара","араб","арак","арап","арба","арбат","арка","бак","бал","балка","балкар","балтика","бар","барак","барит","барк","барка","батрак","бирка","бит","бита","битки","блат","блик","бра","брак","брат","братик","ик","икра","ил","иприт","кабил","кал","калибр","капа","капитал","капрал","кара","карат","кариб","карп","карт","карта","кила","кипа","кит","клип","клир","краб","крап","крипта","лак","лапа","лапка","лапта","лапти","лар","лата","лик","липа","липка","лирик","лирика","литка","литр","паб","пак","пакт","палитра","палка","пар","пара","параклит","паралитик","пари","парик","парилка","парк","парта","пат","пиала","пиар","пик","пика","пики","пила","пилка","пир","пират","пирит","плакат","плата","плита","плитка","прибалт","раб","раба","рак","ракита","рапа","табак","талиб","талик","тапир","тапка","тапки","тара","тиара","тик","тип","тир","трак","трал","трап","триба","трип"],"разработка":["абаз","абак","аборт","азарт","азот","акароз","акробат","акт","аозт","аорта","ара","араб","арабка","арак","арба","арбат","арка","артроз","атака","база","базар","бак","бар","барак","барк","барка","батрак","боа","бок","бор","бора","борт","бот","бра","брак","брат","браток","брокат","забор","забота","закат","зарок","заток","затор","зоб","кара","карат","карра","карт","карта","кобза","кобра","коза","кора","корт","кот","краб","кроат","крот","оаз","обкат","образ","обрат","ор","орк","отара","отказ","раб","раба","работа","работка","разбор","разборка","разок","рак","роба","роза","рок","рот","рота","табак","табор","таз","тако","тара","ток","тор","торба","трак","трок"],"распилка":["акрил","апилак","ара","арак","арап","арка","ас","ик","икра","ил","иск","искра","кал","капа","капрал","каприс","кара","карп","кила","кипа","кираса","клип","клипс","клипса","клир","крап","краса","лак","лапа","лапка","лар","ласа","ласка","лик","липа","липка","лис","лиса","лиска","пак","палас","палка","пар","пара","пари","парик","парилка","парк","пас","паск","пиала","пиар","пик","пика","пила","пилка","пир","пирс","писк","плис","плиска","рак","рапа","рапс","раса","распил","рис","риск","риска","сак","салки","сап","сапа","сапка","си","сикл","сила","скала","скип","скрап","скрип","слип","спил","спилка"],"костер":["корсет","корт","кот","крест","крот","ор","орк","осек","осетр","отек","отсек","ре","рок","рост","рот","сектор","серко","сет","скот","сок","сор","сорт","срок","стек","сток","стокер","тес","ток","тор","торс","трек","треск","трок","трос"],"эмират":["март","мат","ми","мир","мирт","мирта","митра","мэр","мэри","мэтр","ритм","тир","эмир","эра"],"удабривание":["абвер","абердин","авар","ад","анвар","ара","араб","арба","арена","аренда","аура","бадан","баден","бадин","банда","бандура","бар","баран","бард","барин","беда","бедра","бедуин","бенуар","бердан","бивни","бра","бред","бредни","бренди","будни","будра","буер","бунд","бур","бура","бурав","буран","бурда","ваер","вар","варан","вбирание","веда","ведун","вена","вера","веранда","верба","вид","вина","вира","вред","вруб","врубание","врун","даба","дан","дар","даур","дебри","дева","дерн","диван","динар","дрена","дуб","дубина","дубрава","дура","дуриан","еда","ерунда","ибер","ива","инвар","иуда","иудеи","навар","надир","надруб","надув","наиб","нарва","нард","недра","нерв","нива","нрав","раб","раба","рада","радиан","рана","раунд","ре","рев","редан","рубин","руда","руина","руна","увар","удав","удар","уран","урина","урна"],"федералист":["ад","адрес","аист","арест","арфист","ас","аферист","дар","деист","десерт","дети","дефис","диета","дилер","еда","идеал","ил","лад","лар","лафет","лафит","лед","леди","леер","лес","леса","лет","летие","лидер","лис","лиса","лист","литер","литера","литр","лиф","лифт","лифтер","радист","рдест","ре","реалист","редис","реле","рис","риф","сад","сард","сатир","сеид","селитра","селфи","сера","середа","сериал","сет","си","сидерат","сидр","сила","ситар","след","слет","среда","стела","стрела","сфалерит","сфера","талер","талес","тариф","тес","тир","тире","тис","тиф","трал","фа","фал","фалерист","фарс","фарт","фасет","фат","федерал","федерат","фес","фетр","фиал","фиат","фиеста","фила","филе","филер","фита","флат","флер","флирт"],"требование":["абвер","аборт","автор","ант","бант","бар","барин","барит","баритон","барон","баронет","батон","берет","бета","бетон","бинт","бит","бита","битва","боа","бон","бона","бор","бора","борение","борт","бот","ботва","бра","брат","бревно","бритва","ваер","вар","варение","ватин","веер","вена","вено","вера","верба","вербена","ветер","ветеран","вето","вина","вино","винт","вира","воин","вона","вор","втора","евреи","енот","ибер","ива","инвар","ион","набор","навет","наиб","небо","неврит","нерв","нива","нота","нрав","обет","обрат","овен","овин","ор","орбита","отбив","отвар","раб","ранет","рант","ратин","рвение","рвота","ре","рев","ренет","рента","ретина","роба","ров","роение","рот","рота","табор","тавр","таврение","тавро","твин","творение","теин","тени","тенор","терн","тернев","тина","тир","тиран","тире","товар","тон","тор","торба","торбан","треба","трение","триба","трио","троение","трон"],"молодчина":["ад","дан","динамо","длина","дно","до","дол","долина","доломан","дом","домино","домна","идол","ил","иод","ион","лад","ладо","лиман","лимон","лимонад","лич","лом","лоно","ми","милан","мина","мода","мол","моча","мочало","мочило","надлом","налим","намол","нома","номад","ода","чадо","чал","чан","чин","чина"],"антисептик":["аист","аистник","акт","анис","ант","ас","аскет","аспект","астеник","атеист","аттик","ик","икание","инки","иск","искание","истина","каинит","кант","кастет","катет","кепи","кета","кипа","кисет","киста","кит","китаист","наитие","наст","натек","натес","натиск","нитка","паек","пак","пакет","пакт","пан","панк","пантеист","пас","паск","пат","патент","пекан","пена","пенис","пенка","пенс","пес","песик","пески","пест","пестик","петин","петит","пианист","пик","пика","пикан","пике","пикет","пики","пина","пинетка","пинетки","пинта","писание","писк","пистик","питание","питта","псина","саек","сак","саке","сан","сани","санки","сап","сатин","сатинет","секта","сектант","сенат","сени","септик","сет","сетка","си","сиенит","синап","синтетик","синтетика","сити","скат","скена","скепт","скип","скитание","спина","спинет","спинка","стан","стек","стека","стена","стенка","степ","такси","такт","танк","танкист","тапки","теин","теист","текст","тени","тент","тес","тесак","тесина","теска","тест","тета","тетка","тик","тикание","тина","тип","тис","тиски","титан","титаник"],"металлург":["агул","алеут","амулет","амур","аул","аут","гаер","галл","гамлет","гарем","гарт","герма","гетра","глум","грум","гул","гурт","гута","лаг","ламут","лар","легат","лемур","лет","луг","маг","март","мат","мгла","мел","мера","мета","металл","метла","метр","муар","мул","мулат","мулла","мура","рагу","раут","ре","рема","рулет","рута","талер","теллур","тема","теург","трал","туарег","туер","тур","тура","угар","улар","улем","ум","урал"],"микрофауна":["амур","амфора","ара","арак","арка","аркан","арника","арфа","аура","африка","ик","икона","икра","инок","иномарка","ион","иранка","камин","камфора","кара","караим","карма","карман","кармин","кино","кифара","ком","кома","комар","комара","коми","кон","конура","кора","коран","корм","корма","кофр","кран","крона","кум","кума","кумир","кун","куна","мак","маки","мана","маниок","маниока","манка","манок","мара","маран","марафон","маринка","марка","ми","микрон","мина","минор","минорка","мир","миф","мор","морф","морфин","мрак","муар","мука","мура","накра","нарком","наука","нимфа","нома","норка","норма","окарина","окраина","омар","ор","орк","оркан","рак","рама","рамка","рана","ранка","рафик","риф","рифма","рок","ром","роман","руина","рука","руна","укор","ум","умник","умора","униформа","уран","урина","урна","урок","урон","фа","факир","фанк","фара","фараон","фауна","финка","фирма","фирн","фон","фонарик","фоника","фора","форма","форум","фрак","франк","фура","фурма"],"декламация":["ад","академия","акация","акция","дама","дамка","дек","дека","еда","елка","идеал","идея","ик","ил","имя","кал","камелия","камея","кила","клад","лад","лак","лама","лед","леди","лекция","лея","лик","ля","лямка","мак","маки","мала","малаец","малек","малец","малик","малица","маца","маяк","мед","медиа","медик","медяк","мел","ми","миля","мялка","цадик","цикада","цикл","цикля","яд","як","ял","ялик","яма"],"окуривание":["анкер","ваер","вар","вареник","вареники","век","веко","вена","веник","вено","венок","вера","верк","вина","вино","винокур","вира","внук","внуки","военрук","воин","вона","вор","враки","врун","ерик","ива","ик","икание","икона","икра","инвар","инки","иноверка","инок","ион","каре","керн","кивание","кивер","киви","кино","кирова","ковер","кон","конура","кора","коран","кран","крен","кров","крона","кун","куна","курва","курево","нерв","нерка","нива","новик","норка","нрав","нукер","овен","овин","окание","океан","ор","орк","оркан","рак","ре","рев","река","ров","ровик","рок","руина","рука","рукав","руна","увар","укание","укор","уран","урина","урна","урок","урон"],"сберкасса":["абак","абрек","ара","араб","арабеск","арак","арба","арека","арка","ас","аскер","бак","бар","барак","барекс","барк","барка","баркас","барс","бас","баск","баска","бек","бекар","бекас","бес","бра","брак","брас","брасс","кабаре","кара","каре","касса","кеб","краб","краса","раб","раба","рак","раса","ре","река","саба","саек","сак","саке","сакс","секс","сера","серб","сербка","скарб"],"назревание":["авар","азан","анвар","ара","арена","ваер","ваза","ванна","вар","варан","варение","веер","вена","вера","виза","вина","вира","врез","врезание","евреи","звание","зев","зева","зевание","знание","зрение","ива","инвар","навар","название","наин","нарва","нарезание","нарзан","нерв","нива","низ","нирвана","нрав","равнение","равнина","разевание","рана","ранение","рвение","ре","рев","резание","резина","риза"],"скапывание":["аванс","акание","акын","анис","ас","вакса","васин","век","вена","веник","вепс","вес","весна","вина","вис","всыпание","выпас","выписка","ива","ик","иск","канапе","канва","капа","капание","касание","квас","кепи","кипа","навес","навис","навык","напев","насып","насыпка","нива","пава","павиан","паек","пак","пан","панева","паневка","паника","панк","пас","пасека","паск","пекан","пена","пенис","пенка","пенс","пес","песик","пески","пик","пика","пикан","пике","пина","писк","псина","саван","савка","саек","сак","саква","саке","сан","сани","санки","сап","сапа","сапка","сван","сванка","сваны","свинка","сев","сени","си","синап","синева","скена","скип","спевка","спина","спинка","сын"],"скирдовоз":["вздор","взор","вид","вис","висок","воз","возок","вор","ворс","воск","двор","дворик","диво","дикорос","диск","до","дозор","док","дрок","зов","извод","ик","иод","ирод","иск","код","корд","криз","кров","овод","одр","око","оксид","ор","орк","орок","рис","риск","рисовод","ров","ровик","род","родос","рок","свод","своз","си","сидр","скирд","совик","совок","сок","сор","срок"],"актинограф":["агар","агат","агнат","акант","аконит","акт","ангар","ант","аорта","ара","арак","арго","аргон","арка","аркан","арника","арфа","африка","ганка","гарант","гарт","гит","гитан","гитана","гитара","гифа","го","гон","гонка","гонт","гора","горин","горка","горн","готика","гофр","гран","гранат","гранит","грант","граф","графа","график","графика","графин","графит","гриф","грифон","грот","иго","игра","игрок","ик","икона","икота","икра","инок","инфаркт","ион","иранка","ирга","итог","каган","кагат","кагор","канат","кант","кантор","кантри","кара","карат","карга","каротин","карт","карта","картина","картинг","картон","катион","каторга","кафтан","кино","кит","кифара","книга","кон","контра","кора","коран","корт","кот","кофр","кофта","крага","кран","кроат","крона","крот","нагар","нагота","накат","накра","нарта","натирка","нитка","нога","ногата","норка","нота","нотка","огранка","окарина","окраина","онагр","ор","орган","орк","оркан","отара","офит","рак","ракита","рана","ранг","ранка","рант","ратин","ратник","рафик","ринг","риф","рог","рогатина","рогатка","рок","рот","рота","ротанг","ротик","таган","таганок","тако","танго","танк","тара","таран","тариф","тиара","тигр","тик","тина","тир","тиран","тиф","тифон","тога","ток","тон","тоник","тоника","тор","торг","торги","торф","трагик","трак","трико","трио","трог","трок","трон","фа","фагот","факир","факт","фактор","фанариот","фанат","фанатик","фанг","фанк","фант","фанта","фантик","фара","фараон","фарт","фартинг","фат","фата","фиат","фиг","фига","фигаро","финка","финт","фирн","фита","фогт","фон","фонарик","фоника","фора","форинт","форт","фрак","франк","франт","фронт","фтор"],"югославка":["ас","вага","вакса","вал","влага","влас","вокал","вол","волга","волк","воск","галка","галс","гваюла","глава","главк","глас","го","гол","кагал","кал","квас","клюв","коала","кол","коса","лава","лавка","лаг","лак","лаоска","ласа","ласка","лог","лоск","люк","люкс","овал","овсюг","огласка","оса","осака","оскал","савка","сага","саго","сак","саква","сало","свалка","скала","скало","скол","слава","славка","словак","слог","сова","совка","сок","солка","юг","югослав","юкола","юла","юлка","юс"],"пересушка":["акушер","ас","аскер","ерш","капер","каперс","каре","карп","каупер","кеш","крап","креп","круп","крупа","купа","купе","курс","куш","паек","пак","пар","парк","парсек","парус","пас","паск","паук","перекус","перка","перш","пес","пешка","прус","прусак","пук","пурка","пуск","пушка","рак","рапс","раус","ре","река","репа","репка","репс","решка","рука","русак","саек","саепек","сак","саке","сап","сапер","саше","сера","серп","скрап","скрепа","скуп","спешка","сук","сука","суп","сура","сурепа","сурепка","суша","сушка","упек","упрек","ус","шар","шерп","шерпка","шкура","шпур","шурпа"],"обтирка":["аборт","акт","бак","бар","барит","барк","бирка","бит","бита","биток","боа","бок","бор","бора","борт","бортик","бот","ботик","бра","брак","брат","братик","браток","брокат","ик","икота","икра","кариб","карт","кит","кобра","кора","корт","кот","краб","кроат","крот","обкат","обрат","ор","орбита","орк","раб","рак","роба","рок","рот","рота","ротик","табор","тако","тик","тир","ток","тор","торба","трак","триба","трико","трио","трок"],"паголенок":["ангел","аполог","галоп","ген","го","гол","гон","гонка","гопак","елка","кал","кег","клан","клен","клон","клоп","кол","колена","колено","кон","конго","копал","копна","лаг","лак","лен","лепка","лог","локон","лоно","налеп","налог","нега","нога","огонек","океан","окно","око","окоп","опак","опал","опека","опенок","опоек","паек","пак","паклен","пан","панк","паоло","пекан","пекло","пена","пенал","пенка","план","плен","плена","пленка","погон","поклон","пол","пола","поле","полено","полк","полка","поло","полог","полок","полон","понг"],"холстина":["аист","анис","ант","ас","ил","илот","ион","линт","лис","лиса","лист","лихо","лосина","лосиха","лот","лох","наст","настил","нилот","нос","нота","оса","осина","сало","салон","сан","сани","сатин","си","сила","силон","сито","слон","слониха","слот","сноха","сон","сота","соха","стан","стих","стол","стон","талон","тина","тис","тон","хан","хаос","хит","хитон","хна","холст","хон","хост","хота"],"гарпунщик":["гарпун","гран","гуран","гуща","игра","ик","икра","ирга","карп","кипа","кипу","книга","кран","крап","круг","круп","крупа","куга","кун","куна","кунг","купа","куща","нуга","пак","пан","панк","пар","пари","парик","парк","парник","паук","пиар","пик","пика","пикан","пина","пир","пища","пращ","пращник","пук","пурга","пурин","пурка","пуща","рагу","рак","ранг","ринг","руина","рука","руна","угар","уран","урина","урна","щи","щука","щуп","щур","щурка"],"ковроделка":["ад","аккорд","ваер","вал","валек","валер","вар","вделка","веда","ведро","век","веко","вера","верк","вклад","вода","водка","вокал","вол","волк","волок","вор","вред","дар","дверка","двор","дева","девка","дек","дека","декор","дело","до","док","дока","докер","дол","древко","древо","дрек","дрова","дрок","еда","едок","елка","кадр","кал","каре","квакер","кварк","кедр","кедровка","клад","клакер","клев","клевок","клерк","клок","ковер","ковка","ковродел","код","кода","кодла","кок","кока","кокор","кол","колер","колода","колодка","колок","кора","коралек","корд","корда","корка","корова","коровка","короед","королева","королек","краков","кредо","креол","креолка","кров","лавр","лад","ладо","лак","лар","ларек","лев","левак","лед","ледок","лерка","лодка","лорд","овал","овод","ода","одр","оклад","око","окова","оковка","околка","окорка","окрол","ор","орда","орел","ореол","орк","орок","рак","раколов","ре","рев","редова","река","ров","род","родео","рок","рол"],"тундрянка":["ад","акт","ант","аут","дан","дар","даур","дукат","дура","дурак","дутар","кадр","кант","канун","карт","кнут","кран","куда","кун","куна","курант","курд","курта","нард","наряд","нут","рак","рант","раунд","раут","руда","рудяк","рука","руна","рута","ряд","танк","трак","труд","тукан","тун","туна","тундра","тур","тура","турка","туя","удар","уран","урна","утка","яд","як","якут","яр","ярд","ярка","ярутка"],"дворянство":["ввод","вор","ворон","ворот","ворс","двор","дворня","дно","до","донор","донос","дорн","дояр","норд","норов","нос","овод","одр","ор","осот","остов","остров","отвод","относ","отряд","ров","род","родня","родос","родство","рондо","рост","рот","ряд","рядно","свод","сон","соня","сор","сорт","сотня","соя","створ","стон","тон","тоня","тор","торос","торс","трон","трос","явор","яд","ядро","яр","ярд","яс","яство"],"выработка":["абак","аборт","авар","автокар","автор","акробат","акт","аорта","ара","араб","арабы","арак","арба","арбат","арка","арык","бак","бар","барак","барк","барка","батрак","батыр","боа","бок","бор","бора","борт","бот","ботва","бра","брак","брат","братва","браток","бровка","брокат","бык","быт","вар","варка","вата","ватка","вор","врата","втора","выбор","выборка","кара","карат","карт","карта","карты","квота","кобра","ковы","кора","корт","кот","краб","кроат","кров","крот","обкат","обрат","обрыв","обтравка","октава","ор","орава","орк","отава","отара","отвар","отрава","отрыв","раб","раба","работа","работка","рак","рвота","роба","ров","рок","рот","рота","рыба","рыбак","рыбка","рывок","рык","табак","табор","тавр","тавро","тако","такыр","тара","товар","товарка","ток","тор","торба","трава","травка","трак","трок","тыква"],"рутинность":["ион","нить","нониус","нос","нут","нутро","ор","остит","ость","ось","отит","рис","рост","рот","ртуть","русин","руст","русь","си","синь","синьор","сито","ситро","сон","сор","сорит","сорт","стон","стрит","суннит","суть","тир","тис","титр","тиун","тон","тонус","тор","торит","торс","торт","тост","трио","тритон","трон","трос","трость","трот","трус","тун","тур","турин","турист","тут","тутор","унион","урон","ус","утор","утро"],"камерунка":["амур","анкер","ара","арак","арека","арена","арка","аркан","аура","каемка","камера","камка","кара","каре","карма","карман","кенарка","керн","кран","крем","креманка","крен","кукан","кум","кума","кун","куна","кунак","мак","мана","манер","манера","манка","мара","маран","марена","марка","мекка","мена","мера","мерка","мрак","муар","мука","мура","мурена","наем","накра","намек","наука","немка","нерка","нукер","рак","рама","рамка","рана","ранка","ре","река","рема","рука","руна","ум","уран","урна"],"легковушка":["агул","аул","ашуг","вал","валек","вега","век","веко","вешало","вешка","вогул","вогулка","вокал","вол","волга","волк","главк","го","гол","гул","елка","кал","кег","кеш","клев","клевок","клеш","клок","клуша","ковка","ковш","кок","кока","кол","кошелка","кошка","куга","кукла","кукша","кулак","кулек","кулеш","куш","кушак","лаг","лак","лев","левак","левша","ловушка","лог","лошак","луг","лук","лука","луковка","овал","ошва","увал","угол","уголек","укол","улов","уловка","ушко","шаг","шелк","шелковка","шкало","шквал","школа","шлаг","шлак","шлевка","шов","шок","шоу","шуга"],"пластеин":["аист","анис","ант","ас","ил","лапти","лен","лента","лепта","лес","леса","лесина","лет","линт","липа","лис","лиса","лист","налеп","налет","наст","настил","натес","пан","пас","паслен","пат","пена","пенал","пенис","пенс","пес","пест","петин","пила","пина","пинта","план","плен","плена","плес","плис","плита","псина","сан","сани","сап","сатин","селин","сенат","сени","сет","си","сила","силен","синап","слет","слип","спил","спина","спинет","сплетни","сплин","стан","стела","стена","степ","талес","теин","тени","тес","тесина","тина","тип","тис","тлен"],"совнарком":["аксон","амвон","ас","вар","вона","вор","ворон","ворона","воронка","ворс","воск","квас","ком","кома","комар","кон","кора","коран","корм","корма","корова","корона","коса","кран","кров","крона","мавр","мак","манок","марс","масон","мор","морок","морока","морс","мрак","нарком","насморк","нома","норка","норма","норов","нос","носок","нрав","окно","око","окова","окрас","омар","ор","орк","оркан","орок","оса","оскар","осман","основа","осока","рак","рамс","ров","рок","ром","роман","романс","роса","сак","сан","сван","свора","скарн","скорм","смак","смоква","сновка","сноровка","сова","совка","совок","сок","соковар","сом","сома","сон","сонм","сор","сорока","срам","срок"],"поддувание":["ад","аденоид","веда","ведун","вена","вено","вид","видео","вина","вино","вода","воин","вона","дан","дева","девон","дед","дедина","депо","диван","диво","диод","дно","до","дуда","еда","ендова","ива","иод","ион","иуда","наддув","надув","напев","невод","нива","овен","овин","ода","пан","певун","пена","пиво","пина","пион","подвид","поддев","подина","понева","пони","пуд","увод","удав","удод","упад","упование"],"пустырник":["ик","икры","иск","кипу","кит","кнут","круп","кун","куприт","курс","куст","нут","пик","пир","пирс","писк","пискун","прикус","притык","прус","прусик","прут","прутик","пук","пункт","пунктир","пурин","пурист","пуск","путник","путы","пырник","рипус","рис","риск","русин","руст","рык","си","скип","скрип","скуп","спирт","спринт","спрут","спурт","спутник","струп","стук","стык","сук","суп","супин","супник","сурик","сутки","сын","сыр","сырник","сырт","тик","тип","типун","тир","тис","тиун","трип","труп","трус","трусик","трусы","тун","тупик","тур","турин","турки","турник","тын","унты","ус","усик"],"гидростат":["ад","аист","аорист","арго","артист","артос","ас","гад","гарт","гастрит","гид","гидра","гидрат","гит","го","год","гоист","гора","град","грот","даос","дар","до","дог","дрога","иго","игра","иод","ирга","ирод","истод","итог","ода","одр","ор","орда","оса","остит","отит","радио","радист","рис","рог","род","роса","рост","рот","рота","саго","сад","сард","сатир","си","сиг","сидр","сирота","ситар","сито","ситро","сода","сор","сорит","сорт","сота","стадо","старт","статор","стог","стрит","тарист","тигр","тир","тис","титр","тога","тор","торг","торги","торит","торс","торт","тост","траст","трио","триод","трог","трос","трот"],"минотавр":["автор","амвон","ант","атом","вар","ватин","вина","вино","винт","вира","воин","вона","вор","втора","ива","инвар","ион","мавр","мант","манто","март","мат","ми","мина","минор","мир","мирт","мирта","митра","мор","мотив","нива","нома","норма","норматив","нота","нрав","овин","омар","ор","отвар","рант","ратин","рвота","ритм","ров","ром","роман","рот","рота","тавр","тавро","твин","тина","тир","тиран","тмин","товар","том","томан","тон","тор","трином","трио","трон"],"флибустьер":["бел","бель","бес","билет","бисер","бит","битье","блеф","блистер","брест","бритье","брус","буер","буерист","бур","бурсит","бурт","бустер","бут","буфер","буфет","бьеф","ель","ерь","ибер","ил","лес","лесть","лет","лис","лист","литер","литр","литье","лиф","лифт","лифтер","луб","ре","ребус","рельс","рис","риф","рубль","рулет","руль","руст","русь","рутил","селфи","сель","серб","сет","сеть","си","силур","силь","сильф","слет","сруб","стиль","стильб","стул","суть","суфле","суфлер","тес","тир","тире","тис","тиф","трель","трисель","трус","туер","туес","тулес","тур","турель","туф","туфли","улит","ус","устье","утес","утиль","фес","фетр","филе","филер","фильер","фильтр","флебит","флер","флирт","фут","футер"],"тюрчанка":["акант","акт","ант","анчар","ара","арак","арка","аркан","арча","канат","кант","кара","карат","карт","карта","кача","каюр","каюта","кран","накат","накра","нарта","ню","рак","рана","ранка","рант","танк","тара","таран","тачка","ткач","трак","трюк","трюкач","тюк","чакан","чакра","чан","чара","чарка","юнак","юр","юра","юрта","ют"],"лоббистка":["аист","акт","ас","бабки","бак","бал","балок","бас","баск","баски","басок","бикс","било","бит","бита","биток","блат","блик","блок","боа","боб","бобик","бок","бокал","бокс","боксит","бола","болт","бот","ботик","ик","икота","ил","илот","иск","исток","кабил","кал","кила","кило","кислота","киста","кит","кол","колба","колит","коса","кости","кот","лак","ластик","лик","лис","лиса","лиска","лист","листок","литка","лоб","лобби","лоббист","лобик","лоск","лот","обкат","облик","оса","оскал","ослик","сабо","саиб","сак","салки","сало","си","сикл","сила","силок","сито","скало","скат","скатол","скоба","скол","скот","слиток","слот","сок","солка","сота","сотка","стилка","сток","стол","столб","столбик","столик","табло","тако","такси","талиб","талик","тик","тис","ток","толк","толки","тоска"],"морзянка":["анзор","армяк","закон","закром","замок","замор","зарок","заря","знак","знамя","зона","зоря","коза","ком","кома","комар","кон","кора","коран","корм","корма","кран","крона","мазок","мак","манок","маяк","мор","моряк","моряна","мрак","наркоз","нарком","нома","норка","норма","оаз","омар","ор","орк","оркан","разок","рак","роза","рок","ром","роман","як","яма","яр","ярка","ярмо","ярок"],"экспедитор":["деист","дек","декор","депо","депорт","деспот","дети","диктор","диоптр","диск","до","док","докер","дрек","дрок","дротик","едок","ерик","ик","иод","ирод","иск","истод","исток","кедр","кепи","кисет","кит","код","копир","копт","корд","корсет","корт","костер","кости","кот","кредит","кредо","креп","крест","крот","одр","оксид","опт","оптик","ор","орк","осек","осетр","острие","отек","отсек","период","периост","перо","персик","перст","пес","песик","пески","песо","песок","пест","пестик","пик","пике","пикет","пир","пирс","писк","питер","подсек","подтек","поиск","покер","порт","портик","портки","пост","пот","потек","потир","поэт","предки","предок","прекос","присед","приток","проект","прок","просек","протеид","протес","пэр","рдест","ре","редис","репс","рис","риск","род","рок","рост","рот","ротик","рэкет","рэп","седок","сеид","сектор","септик","серко","серп","сет","си","сидр","сироп","сито","ситро","скепт","скип","скипетр","скирд","скоп","скот","скрип","сок","сор","сорит","сорт","спектр","спикер","спирт","спор","спорт","срок","стек","степ","сток","стокер","строп","сэр","тес","тик","тип","тир","тире","тис","тодес","ток","топ","топик","тор","торс","трек","треп","треск","трико","трио","триод","трип","трок","троп","тропик","трос","тэк","эдикт","экер","эксперт","экспорт","эпос","эрот","эрстед","эсер","эскорт"],"автогигант":["авгит","агат","агнат","ант","вага","вагант","вагин","вагина","вагон","ванта","вата","ватин","ватт","виг","вина","вино","винт","воин","вона","гавот","гага","гагат","гигант","гит","гитан","гитана","гитов","го","гон","гонг","гонт","ива","иго","ион","итог","нагота","нива","нога","ногата","нота","овин","отава","отвага","отит","тавот","таган","танго","твин","тина","титан","тога","тон"],"полярник":["ик","ил","инок","ион","кило","кино","клип","клир","клон","клоп","кляп","кляр","кол","кон","копир","копия","лик","линкор","липняк","лори","ля","ляп","нолик","нория","ор","орк","пик","пикон","пилон","пинок","пион","пир","пол","полк","поля","поляк","пони","прикол","прок","пряник","рок","рол","ролик","як","ял","ялик","янки","яр","ярок"],"константа":["акант","аксон","акт","анонс","ант","ас","астат","канат","канна","канон","кант","кантон","каста","кон","коса","кот","накат","нанка","нанос","наст","нона","нос","нота","нотка","оса","осака","осанка","осанна","откат","сак","сан","скат","скот","сок","сон","сонант","соната","сота","сотка","стакан","стан","станок","сток","стон","тако","такса","такт","танк","ток","тон","тонна","тоска","тост"],"боливийка":["алиби","бай","бак","бал","балок","бивак","било","блик","блок","боа","бой","бок","бокал","бола","вабик","вал","валик","вилка","вилок","виола","вобла","вой","вокал","вол","волк","ива","ик","ил","кабил","кайло","кал","калий","киви","кий","кила","кило","кол","колба","лай","лак","лик","лоб","лобик","обвал","обивка","обливка","облик","овал","олива","оливка"],"сортимент":["енот","ион","ирмос","мент","мерин","меринос","место","метр","метрит","метро","ми","минер","минор","мир","мирт","мистер","монист","монстр","монтер","мор","море","морс","мост","мотет","номер","нос","омет","ор","осетин","осетр","остеит","остит","острие","отит","ре","ремонт","рис","ритм","ром","рост","рот","семит","сени","сено","сет","си","сирен","сито","ситро","смотр","сом","сон","сонет","сонм","сор","сорит","сорт","сотерн","стерин","стон","стрит","теин","теист","тени","тенор","тент","термин","термист","термит","термос","терн","тес","тест","тесто","тир","тире","тис","титр","тмин","том","тон","тор","торит","торс","торт","тост","тостер","тотем","трест","триест","трином","трио","тритон","трон","трос","трот"],"повстание":["аист","анис","ант","ас","васин","ватин","вена","вено","вепс","вес","весна","вест","вето","вина","вино","винт","вис","воин","вона","енот","ива","ион","навес","навет","навис","напев","наст","натес","нива","нос","нота","овен","овес","овин","опт","оса","осетин","осина","оспа","оспина","отвес","отсев","пан","пас","пат","пена","пенис","пенс","пес","песо","пест","петин","пиво","пина","пинта","пион","пистон","питон","повеса","повет","понева","пони","понт","посев","пост","постав","пот","псина","сан","сани","сап","сапонит","сатин","сван","сват","свет","свита","сев","сенат","сени","сено","сет","си","синап","синева","сипота","сито","сноп","сова","совет","сон","сонет","сопа","сота","спина","спинет","стан","стена","степ","стон","стопа","твин","теин","тени","тес","тесина","тина","тип","тис","тон","топ","топание"],"провокатор":["автор","акт","вар","вор","ворот","ворота","вороток","втора","капор","капот","карп","карт","квота","копт","кора","корова","корт","кот","крап","кроат","кров","крот","око","окова","окоп","окот","опак","опор","опора","опорок","опт","ор","оратор","орк","орок","отвар","отпор","отрок","пак","пакт","пар","парк","парок","пат","повар","поворот","повтор","пора","порка","порок","порт","пот","поток","право","провар","прок","прокат","прорва","пророк","проток","протока","рак","рапорт","рвота","ров","рок","рокот","ропак","ропот","рот","рота","ротор","тавр","тавро","тако","товар","ток","топ","топка","топор","тор","трак","трап","трок","троп","тропа","тропка"],"велогонщик":["век","веко","веник","вено","венок","виг","вилок","вино","воин","вол","волк","волок","геликон","ген","гнев","го","говно","гол","голик","головщик","гон","гонщик","иго","ик","ил","инок","ион","кег","кегли","кило","кино","кинолог","клев","клен","клещ","клещи","клон","кол","колено","кон","конго","лев","легион","лен","лещ","лик","лог","логик","логовище","локон","лоно","новик","нолик","овен","овин","овощ","овощи","огневик","огниво","огнище","огонек","окно","око","олеин","щегол","щелк","щелок","щенок","щи"],"астероид":["ад","адрес","аист","аорист","арест","артос","ас","даос","дар","деист","дети","диета","до","еда","иод","ирод","истод","ода","одр","ор","орда","оса","осетр","острие","радио","радист","рдест","ре","редис","рис","род","роса","рост","рот","рота","сад","сард","сатир","сеид","сера","сет","си","сидерат","сидр","сирота","ситар","сито","ситро","сода","сор","сорит","сорт","сота","среда","стадо","тес","тир","тире","тис","тодес","тор","торс","трио","триод","трос"],"проминка":["ампир","ик","икона","икра","инок","ион","камин","капонир","капор","капрон","кармин","карп","кино","кипа","ком","кома","комар","коми","кон","копир","копна","кора","коран","корм","корма","кран","крап","крона","мак","маки","маниок","манок","ми","микрон","мина","минор","минорка","мир","мор","мрак","напор","нарком","нома","норка","норма","омар","опак","опарник","ор","орк","оркан","пак","памир","пан","панк","пар","пари","парик","парк","парник","парок","паром","пиар","пик","пика","пикан","пикон","пим","пина","пинок","пион","пир","поимка","помин","пони","пора","порка","прима","примак","прок","промин","рак","рок","ром","роман","ропак"],"каллиграф":["агар","акрил","ара","арак","арка","арфа","африка","галка","галл","гифа","граф","графа","график","графика","гриф","игла","игра","ик","икра","ил","ирга","кагал","кал","калиф","калла","кара","карга","кила","кифара","клир","крага","лаг","лак","лар","лафа","лига","лик","лиф","рак","ралли","рафик","риф","фа","факир","фал","фалл","фара","фиал","фиалка","фиг","фига","фила","флаг","флик","фрак"],"отгнивание":["авгит","автоген","агент","анион","ант","антиген","вагин","вагон","ватин","вега","вена","вено","вето","виг","вина","вино","винт","витание","воин","вона","гавот","ген","гиви","гиена","гит","гитан","гитов","гнев","гнет","го","гон","гонт","гонтина","енот","ива","иго","ион","итог","навет","нагнет","нагон","наин","наитие","нега","негатив","неон","нива","нога","нона","нонет","нота","овен","овин","танго","танин","твин","теин","тени","тина","тога","тон","тонина","тонна"],"марказит":["азарт","азиат","акт","ара","арак","арка","заика","заимка","закат","зима","ик","икра","камаз","кара","караим","карат","карма","карт","карта","кит","криз","мазар","мазик","мак","маки","мара","марка","маркиз","маркиза","март","мат","матка","ми","мир","мирза","мирт","мирта","митра","мрак","рак","ракита","рама","рамка","риза","ритм","таз","тазик","тара","тиара","тик","тир","трак"],"подсечка":["ад","ас","даос","дек","дека","депо","до","док","дока","доска","дочка","еда","едок","код","кода","коса","косач","ода","опак","опека","оса","осек","осечка","оспа","очес","оческа","паек","пак","пас","паск","пес","песо","песок","печка","подсак","подсек","подсека","посад","почка","сад","садок","саек","сак","саке","сап","сачок","седок","секач","сечка","скоп","скопа","сода","сок","сопа","сопка","спад","чадо","чаек","час","часок","чек","чека"],"каретник":["акт","актер","анкер","ант","ерик","ик","икра","каик","кант","кантри","каре","карт","катер","катрен","кератин","керн","кета","кика","кирка","кит","кран","краник","крен","кретин","крик","крикет","кринка","натек","нектар","нерка","нитка","рак","ранет","рант","ратин","ратник","ре","река","рента","ретина","танк","танкер","теин","текинка","тени","терка","терн","тик","тина","тир","тиран","тире","трак","трек"],"проскачка":["ара","арак","арап","арка","арча","ас","какао","капа","капок","капор","кара","каркас","карп","каска","кача","качка","кок","кока","кокс","кора","корка","корсак","корча","коса","косач","кочка","крап","краса","краска","крачка","окрас","окраска","опак","опара","опаска","ор","орк","оса","осака","оскар","оспа","пак","пар","пара","парк","парок","парочка","парча","пас","паск","пачка","покраска","пора","порка","порча","почка","прачка","прок","прокачка","рак","рапа","рапс","раса","раскопка","рок","ропак","роса","сак","сап","сапа","сапка","сачок","скак","скачка","скачок","скок","скоп","скопа","скрап","сок","сопа","сопка","сор","спор","спора","срок","чакра","чара","чарка","час","часок"],"шпротина":["ант","апрош","аршин","атропин","ион","напор","нарпит","ниша","нота","ноша","опт","ор","пан","пар","пари","пат","патрон","пиар","пина","пинта","пион","пир","пират","питон","пони","понт","пора","порт","пот","поташ","потир","притон","пшат","рант","ратин","ришта","рот","рота","тапир","тина","тип","тир","тиран","тон","топ","тор","транш","трап","трио","трип","трон","троп","тропа","шар","ши","шина","шип","широта","шот","шпат","шпинат","шпион","шпон","шпор","шпора","шпрот","шпрота","шрот","штора"],"авиадесант":["аванс","ад","адат","аист","анис","ант","ас","ванта","васин","вата","ватин","веда","вена","вес","весна","вест","вид","вина","винт","вис","дан","дата","дева","деист","десант","десна","детва","дети","детина","диван","диета","еда","ива","навес","навет","навис","насад","наст","натес","нива","саван","сад","сан","сани","сатана","сатин","сван","сват","сватание","свет","свита","сдавание","сев","седина","сеид","сенат","сени","сет","си","синева","стан","стена","стенд","твид","твин","теин","тени","тес","тесина","тина","тис"],"полиритмия":["ил","илот","импорт","имя","иприт","лимит","лития","литр","лом","лори","лот","ля","ляп","ми","миля","миопия","мир","мирт","мол","моляр","мор","мяло","олимп","опт","ор","пилот","пим","пир","пирит","плот","пол","поля","порт","пот","потир","прямило","ритм","рол","ром","рот","тимол","тип","тир","тля","том","топ","тор","трио","трип","тромп","троп","ял","яр","ярмо"],"библиотека":["акт","алиби","бабки","бак","бал","балет","балок","бек","бел","белка","белки","белок","бета","билет","билетик","било","биолит","бит","бита","битки","биток","блат","блик","блок","боа","боб","бобик","боек","бок","бокал","бола","болт","бот","ботик","елка","ик","икота","ил","илот","кабил","кал","кеб","кета","кила","кило","кит","кол","колба","колет","колит","кот","котел","лак","лет","лето","леток","лик","литка","лоб","лобби","лобик","лот","обет","обилие","обкат","облет","облик","отбелка","отек","отел","табло","тако","талиб","талик","телка","тело","телок","тик","ток","толк","толки"],"платинка":["акант","акт","ант","апилак","ик","ил","кал","калан","калин","калина","канал","канат","кант","капа","капитал","капитан","каптан","кила","кипа","кит","клан","клапан","клип","лак","ланита","ланка","лапа","лапина","лапка","лапник","лапта","лапти","лата","латинка","латник","лиана","лик","линт","липа","липка","литка","накал","накат","нитка","пак","пакт","палатин","палка","пан","паника","панк","пат","патан","пиала","пик","пика","пикан","пила","пилка","пина","пинта","плакат","план","планка","плата","платан","платина","плита","плитка","талик","танк","тапка","тапки","тик","тина","тип"],"русистика":["аист","акт","ас","аут","ик","икарус","икра","ирис","иск","искра","искус","карст","карт","кассир","киста","кит","курс","курта","куст","кутас","рак","расист","раус","раут","рис","риск","риска","рука","русак","русист","руст","рустика","рута","сак","сакс","сатир","сатирик","си","сириус","систр","ситар","сити","скат","скаут","старик","стирка","страус","стук","сук","сука","сура","сурик","сусак","сутки","такси","тик","тир","тис","тиски","трак","трасс","трус","трусик","тур","тура","турка","турки","ус","усик","уста","утка"],"чалмоносец":["ас","лаосец","лен","ленца","ленч","лес","леса","лом","лоно","лоцман","малец","масло","масон","мел","мелос","мена","меч","мол","мосол","моча","мочало","наем","намол","начес","нома","нос","омела","оса","осел","осман","осмол","очес","сало","салон","самец","сан","село","сема","сено","сланец","слом","слон","смалец","смена","смола","солнце","соло","солома","солонец","сом","сома","сон","сонм","сочлен","сцена","счал","цена","чал","чан","час","челн","чело","член"],"буртование":["абвер","аборт","автор","ант","аут","бант","бар","барин","барит","баритон","барон","баронет","батон","бенуар","бета","бетон","бинт","бит","бита","битва","боа","бон","бона","бор","бора","борт","бот","ботва","бра","брат","бревно","бритва","буер","бунт","бур","бура","бурав","буран","бурат","буратино","бурова","бурт","бут","бутон","ваер","вар","ватин","вена","вено","вера","верба","вертун","вето","вина","вино","винт","вира","воин","вона","вор","вруб","врубание","врун","втора","енот","ибер","ива","инвар","ион","набор","навет","наиб","небо","неврит","нерв","нива","нота","нрав","нут","нутро","обет","обрат","обувание","овен","овин","ор","орбита","отбив","отвар","отрубание","отруби","раб","ранет","рант","ратин","раут","рвота","ре","рев","рента","ретина","роба","ров","рот","рота","рубин","руина","руна","рута","рутина","табор","табу","табун","тавр","тавро","танбур","твин","теин","тени","тенор","терн","тина","тир","тиран","тире","тиун","товар","тон","тор","торба","торбан","треба","триба","трибун","трибуна","трио","трон","труба","туба","туер","тун","туна","тур","тура","турбина","турин","турне","убор","увар","униат","унтер","уран","урина","урна","урон","утор","утро","утроба"],"крановщик":["вар","варщик","вина","вино","вира","воин","вона","вор","вощина","враки","ива","ик","икона","иконка","икра","инвар","инок","ион","каик","кварк","кивок","кика","кино","кирка","кирова","ковка","коврик","кок","кока","кокаин","кон","конка","кора","коран","коринка","корка","краков","кран","краник","крик","кринка","кров","кровинка","кровища","крона","нива","новик","норка","нрав","овин","окрик","ор","орк","оркан","рак","ров","ровик","рок","роща","щи"],"парусность":["ант","анус","артос","ас","аут","напор","нарост","насос","наст","нос","носарь","нота","нут","нутро","опт","опус","ор","оса","оспа","ость","ось","пан","пар","парность","парус","пас","пасс","пастор","пасть","пат","патрон","понт","пора","порт","пост","пот","прус","прусс","прут","псарь","пуант","путь","рант","рань","рапс","рать","раус","раут","роса","рост","рот","рота","руна","руст","русь","рута","сан","сап","сатурн","снасть","сноп","снос","сон","сопа","сор","сорт","сорус","сосна","сота","соус","спас","спор","спора","спорт","спрос","спрут","спурт","ссора","стан","станс","стон","стопа","страус","строп","стропа","струна","струп","ступа","ступор","суп","супонь","сура","сурна","суть","тон","тонус","топ","топь","тор","торс","транс","трап","трасс","трон","троп","тропа","трос","труп","трус","тун","туна","тур","тура","турпан","упор","уран","урна","урон","ус","уста","утор","утро"],"оргкомитет":["гетто","гит","го","гомик","горе","горком","грек","греки","грим","гром","грот","ерик","иго","игрек","игрок","ик","икромет","итог","кег","киото","кит","ком","коми","комитет","корм","корт","кот","крем","крот","ктитор","метр","метрит","метро","ми","миг","мир","мирт","мор","морг","море","морок","мотет","моток","мотор","око","окоем","окот","октет","омег","омет","ор","орк","орок","отек","отит","откорм","отрог","отроек","отрок","отток","ре","ритм","рог","рок","рокот","ром","рот","ротик","термит","тигр","тик","тир","тире","титр","ток","том","томик","тор","торг","торги","торит","торт","тотем","трек","трико","трио","трог","трок","трот"],"платочек":["акт","елка","елочка","кал","капот","кета","кетч","клоп","кол","колет","копал","копт","кот","котел","лак","лепка","лепта","лет","лето","леток","лот","опак","опал","опека","оплетка","опт","отек","отел","отпал","паек","пак","пакет","пакт","пат","пекло","печка","плато","платок","плач","плетка","плечо","плот","пол","пола","поле","полет","полк","полка","пот","потек","почет","почка","почта","пчела","тако","телка","тело","телок","тепло","течка","ткач","ток","толк","толкач","толпа","топ","топка","точка","чаек","чал","чек","чека","челка","чело","чета"],"обтирание":["аборт","ант","бант","бар","барин","барит","баритон","барон","баронет","батон","бета","бетон","бинт","бит","бита","боа","бон","бона","бор","бора","борт","бот","бра","брат","енот","ибер","ион","набор","наиб","наитие","небо","нота","обет","обитание","обрат","ор","орбита","отбирание","отирание","раб","ранет","рант","ратин","ре","рента","ретина","ринит","роба","рот","рота","табор","теин","тени","тенор","терн","тина","тир","тиран","тире","тон","тор","торба","торбан","треба","триба","трио","трон"],"надхвостье":["ад","ант","ас","вдох","веда","вена","вено","вес","весна","вест","весть","весь","вето","вех","веха","вода","водь","вона","вонь","всход","вход","давность","дан","дань","даос","дева","девон","день","десант","десна","детва","дно","до","досев","досье","еда","ендова","енот","навес","навет","навь","наст","натес","невод","новь","нос","нота","овен","овес","ода","оса","осень","ость","ось","отвес","отсев","охват","сад","сан","сван","сват","свет","свод","сев","сенат","сено","сень","сет","сеть","снедь","сноха","сова","совет","сода","сон","сонет","сота","соха","ставень","стадо","стан","становье","стена","стенд","стон","сход","тень","тес","техас","тодес","тон","хан","ханство","хаос","хват","хвост","хна","ход","хон","хост","хота"],"секундант":["ад","акт","ант","анус","ас","аскет","аут","дан","дек","дека","декан","десант","десна","детка","дукат","дунст","дуст","еда","кадет","кант","канун","кета","кнут","куда","кун","куна","куст","кутас","надкус","нансук","наст","натек","натес","ненка","нут","сад","саек","сак","саке","сан","секта","секунда","сенат","сет","сетка","скат","скаут","скена","стан","стек","стека","стена","стенд","стенка","стук","суд","судак","суета","сук","сука","танк","тес","тесак","теска","туес","тукан","тун","туна","ус","уста","утес","утка"],"бульдозер":["бедро","бел","бель","бердо","блуд","боль","бор","бордель","боулдер","бред","брод","буер","бур","дело","до","дол","дрель","дробь","друз","дуб","дублер","дубль","дубье","дуло","дурь","ель","ерь","зеро","зло","зоб","золь","зуб","зубр","зуд","лед","ледобур","ледоруб","лоб","лорд","луб","обдел","обед","обрез","одр","одул","одурь","ор","орел","ре","резь","род","рол","роль","рубль","руль","убор","удел","удол","уезд","узел","узор","урез","урод"],"нитрование":["автор","анион","ант","ваер","вар","ватин","вена","вено","вера","вето","вина","вино","винт","вира","витание","витрина","воин","вона","вор","втирание","втора","енот","ива","иврит","инвар","интерн","ион","навет","наин","наитие","натрон","неврит","неврон","неон","нерв","нива","нона","нонет","нота","нрав","овен","овин","ор","отвар","отирание","ранет","рант","ратин","рвота","ре","рев","рента","ретина","ринит","ров","рот","рота","тавр","тавро","танин","твин","теин","тени","тенор","терн","тина","тир","тиран","тире","товар","тон","тонина","тонна","тор","трио","трон"],"самокатка":["акт","ас","астма","атака","атом","какао","камка","камса","касатка","каска","каста","каток","кок","кока","кокс","ком","кома","коса","кот","мак","макака","маска","мастак","мат","матка","мост","мотка","оса","осака","саам","саамка","сак","самка","самокат","скак","скат","скатка","скок","скот","смак","смотка","сок","сом","сома","сота","сотка","сток","тако","такса","ток","том","тоска"],"сопельщик":["ель","ик","ил","иск","кепи","кило","киль","кисель","клещ","клещи","клип","клипс","клоп","кол","колье","копь","копье","лепщик","лес","лесок","лещ","лик","лис","лоск","лось","окисел","окись","опись","осек","осел","ослик","ось","пекло","пес","песик","пески","песо","песок","пик","пике","писк","плес","плеск","плис","поиск","пол","поле","полис","полк","село","сель","сельпо","си","сикл","силок","силь","скип","склеп","скол","скоп","скопище","слепок","слип","сок","соль","сопель","сопли","спель","спил","спилок","щелк","щелок","щель","щи","щипок"],"отрадность":["ад","ант","артос","ас","дан","дань","даос","дар","дно","до","донор","донос","дорн","нард","народ","нарост","наст","норд","нос","носарь","нота","ода","одр","ор","орда","оса","осот","острота","ость","ось","относ","радон","радость","рант","рань","рать","род","родос","рондо","роса","рост","рот","рота","ротонда","сад","сан","сард","сода","сон","сор","сорт","сота","стадо","стан","старт","статор","стать","стон","сторона","тон","тор","торос","торс","торт","тост","транс","траст","трон","трос","трость","трот"],"экономист":["ик","инок","ион","иск","исток","кимоно","кино","киото","кит","ком","коми","кон","кости","кот","ми","микст","монист","монисто","москит","мост","мостик","мосток","моток","нос","носик","носок","окно","око","окот","оникс","онэксим","осот","откос","относ","си","сито","скот","снимок","сок","сом","сон","сонм","сотник","сток","стон","тик","тис","тмин","ток","токсин","том","томик","тон","тоник","тэк","эконом","эмо","эскимо","этимон","этнос"],"тамплиер":["ампер","ампир","ил","лапти","лар","лепра","лепта","лет","липа","литер","литера","литр","март","мат","мел","мера","мета","метил","метла","метр","ми","мир","мирт","мирта","митра","памир","пар","пари","пат","патер","перила","перл","пиар","пила","пим","пир","пират","питер","плита","прелат","прием","прилет","прима","примат","примета","ре","рема","репа","ритм","талер","талреп","тапер","тапир","тема","темп","тип","тир","тире","трал","трап","треп","трип"],"прогалина":["агар","аналог","ангар","ара","арап","арго","аргон","галоп","гирло","глина","го","гол","гон","гора","горин","горлан","горн","гран","игла","иго","игра","ил","ион","ирга","лаг","лапа","лапина","лар","лиана","лига","липа","лог","лопари","лори","нагар","налог","напор","нигрол","нога","онагр","опал","опала","опара","ор","орган","орлан","пан","пар","пара","пари","пароли","пиала","пианола","пиар","пила","пилон","пина","пион","пир","пирог","пирога","план","пол","пола","понг","пони","пора","пригон","рана","ранг","рапа","ринг","рог","рол"],"раздутость":["ад","азот","азу","азур","аозт","артос","ас","аут","даос","дар","даур","дзот","до","доза","друз","друза","дура","дурость","дурь","дуст","дутар","зад","задор","затор","зуд","зуда","оаз","ода","одр","одурь","ор","орда","оса","ость","ось","радость","рать","раус","раут","род","роза","роса","рост","рот","рота","ртуть","руда","руст","русь","рута","сад","саз","сард","сода","сор","сорт","сота","стадо","старт","статор","стать","страз","суд","сударь","сура","суть","таз","тор","торс","торт","тост","траст","трос","трость","трот","труд","трус","туз","тур","тура","тут","тута","тутор","удар","узда","узор","узость","урод","ус","уста","утор","утро"],"франциско":["аксон","анис","ас","ик","икона","икра","инок","ион","иск","искра","кино","кница","кон","кора","коран","корица","коса","косица","кофр","кран","крица","крона","норка","нос","носик","окрас","оникс","ор","орк","оркан","оса","осина","осинка","оскар","офис","рак","рафик","рацион","рис","риск","риска","риф","рок","роса","росинка","сак","сан","сани","санки","си","сифон","скарн","скиф","сок","сон","сор","соринка","софа","срок","фа","факир","факс","фанк","фарс","фасон","фиаско","фикс","финка","фирн","фон","фонарик","фоника","фора","форс","фрак","франк","циан","цинк","цирк","циркон","цифра"],"африканер":["акание","анкер","ара","арак","арека","арена","арка","аркан","арника","арфа","афера","африка","ерик","ик","икра","иранка","кара","каре","карра","кафе","кенаф","керн","кефир","кифара","кран","крен","накра","нерка","неф","рак","рана","ранка","рафик","рафинер","ре","река","риф","фа","факир","фанера","фанерка","фанк","фара","фен","финка","фирн","фраер","фрак","франк"],"пародонтоз":["ад","азот","анзор","ант","аозт","дан","дар","дзот","дно","до","доза","дозатор","дозор","донор","дорн","драп","зад","задор","запор","затон","затор","зона","зонд","зонт","надзор","напор","нард","народ","норд","нота","оаз","ода","одр","озон","озонатор","опор","опора","опт","ор","орда","отпад","отпор","паз","пан","пар","пардон","пат","патрон","подзор","поза","позор","понт","пора","порода","порт","пот","проза","протон","радон","рант","род","роза","рондо","ропот","рот","рота","ротонда","таз","тон","топ","топаз","топор","тор","трап","трон","троп","тропа"],"ликтрос":["ик","ил","илот","иск","исток","кило","кит","клир","клирос","кол","колит","корт","кости","кот","кролист","крот","лик","ликтор","лис","лист","листок","литр","лори","лоск","лот","ор","орк","ослик","рис","риск","рок","рол","ролик","рост","рот","ротик","си","сикл","силок","сито","ситро","скол","скот","слиток","слот","сок","сор","сорит","сорт","срок","стирол","сток","стол","столик","тик","тир","тис","ток","толк","толки","тор","торс","трико","трио","трок","трос"],"мерлушка":["акушер","амур","аул","елка","ерш","кал","каре","кеш","клеш","клуша","крем","кулеш","кум","кума","куш","лак","лар","ларек","лемур","лерка","лук","лука","мак","маклер","малек","марш","мел","мера","мерка","мрак","муар","мука","мул","мура","мураш","мушка","рак","ре","река","рема","решка","рука","улар","улем","ум","урал","шар","шарм","шелк","шерл","шкура","шлак","шлам","шлем","шрам","шулер","шум"],"остекление":["енот","ик","ил","илот","инок","ион","иск","исток","кило","кино","кисет","кит","клеение","клен","клест","клиент","клон","кол","колет","колит","кон","костел","кости","кот","котел","лен","лес","лесник","лесок","лет","летие","лето","леток","лик","линкос","линт","лис","лист","листок","лоск","лот","неолит","нилот","нолик","нос","носик","окисел","олеин","оленек","оникс","осек","осел","осетин","ослик","отек","отел","отсек","селен","селение","селенит","селин","село","сени","сено","сет","си","сикл","силен","силок","силон","сито","скелет","скелетон","склон","скол","скот","слет","слиток","слоение","слон","слоник","слот","снеток","сок","соление","сон","сонет","сотник","стек","стекление","стекло","сток","стол","столик","стон","теин","телек","телекс","тело","телок","тенек","тени","тес","тесление","тесло","тик","тис","тлен","тление","ток","токсин","толк","толки","тон","тоник"],"картавость":["авар","авоська","автокар","автократ","автор","акт","аорта","ара","арак","арка","артос","ас","астат","астра","вакса","вар","варка","вата","ватка","ватт","вор","ворс","воск","врата","втора","кара","карась","карат","карст","карт","карта","каста","кастор","кастрат","квас","квота","кора","корт","корь","коса","косарь","костра","кость","кот","краса","красота","кроат","кров","кровать","кровь","крот","окрас","октава","ор","орава","орк","оса","осака","оскар","ость","ось","отава","отара","отвар","откат","отрава","отставка","рак","раса","раскат","рать","рвота","ров","рок","роса","рост","рот","рота","савка","сак","саква","свара","сварка","сват","свора","скат","скот","сова","совка","сок","сор","сорт","сота","сотка","срок","ставка","старка","старт","статор","стать","створ","створка","сток","строка","тавот","тавр","тавро","тако","такса","такт","тара","тасовка","тварь","товар","товарка","ток","токарь","тор","торс","торт","тоска","тост","трава","травка","трак","тракт","траст","трата","трок","трос","трость","трот"],"голкипер":["гирло","го","гол","голик","горе","горелки","горлик","грек","греки","ерик","иго","игрек","игрок","ик","ил","кег","кегли","кепи","кило","клип","клипер","клир","клоп","кол","колер","копир","креол","креп","лик","ликер","лог","логик","лори","ор","орел","орк","пекло","перл","перо","пик","пике","пир","пирог","покер","пол","поле","полк","прикол","прок","ре","рог","рок","рол","ролик"],"экстремизм":["ерик","зек","зет","ик","иск","кисет","кит","крез","крем","крест","криз","мем","метр","ми","мизер","миксер","микст","мим","мир","мирт","мистер","мэр","мэри","мэтр","ре","ремиз","рис","риск","ритм","рэкет","семит","сет","си","срез","стек","сэр","тезис","теизм","тес","тик","тир","тире","тис","трек","треск","тэк","экер","эмир","эретизм","эсер","эскиз"],"акробат":["абак","аборт","акт","аорта","ара","араб","арак","арба","арбат","арка","бак","бар","барак","барк","барка","батрак","боа","бок","бор","бора","борт","бот","бра","брак","брат","браток","брокат","кара","карат","карт","карта","кобра","кора","корт","кот","краб","кроат","крот","обкат","обрат","ор","орк","отара","раб","раба","работа","работка","рак","роба","рок","рот","рота","табак","табор","тако","тара","ток","тор","торба","трак","трок"],"паремейник":["ампер","ампир","анкер","еремкин","ерик","иерей","ик","икра","иней","йеменка","камин","капер","каре","кармин","карп","кепи","керн","кий","кипа","кипрей","край","кран","крап","крем","кремний","крен","креп","май","майник","мак","маки","манер","мена","мера","мерин","мерка","ми","мина","минер","минреп","мир","мрак","наем","намек","немка","нерка","нерпа","паек","пай","пак","памир","пан","панер","паникер","панк","пар","паренек","пари","парик","парк","парник","пекан","пена","пенек","пение","пенка","перина","перка","пиар","пик","пика","пикан","пике","пим","пина","пир","преемник","прение","прием","приемка","прима","примак","рай","рак","ре","рей","рейка","рейн","река","рема","рений","репа","репей","репейник","репина","репка"],"светокопия":["век","веко","вепс","вес","вест","вето","вис","висок","виток","воск","восток","вотяки","ик","иск","исток","кепи","киото","кисет","кисея","кит","копия","копт","кости","кот","овес","око","окоп","окот","опоек","опт","оптик","оптовик","осек","осетия","осот","остов","остяк","остяки","отвес","отек","откос","отсев","отсек","пес","песик","пески","песо","песок","пест","пестик","пивко","пиво","пик","пике","пикет","писк","повет","поиск","покос","посев","пост","пот","потек","поток","пояс","поясок","пяток","свет","свиток","свояк","святки","сев","севок","сепия","септик","сет","си","сито","скепт","скип","скоп","скот","совет","совик","совок","сок","соя","стек","степ","сток","стояк","тес","тик","тип","тис","ток","топ","топик","як","яс","яство"],"разоритель":["азот","альт","аозт","артель","артроз","ель","ерь","зал","залет","затор","зеро","зет","зло","зола","золь","зритель","излет","ил","илот","лазер","лар","ларь","лет","лето","литер","литера","литр","литье","лоза","лори","лот","оаз","ор","орарь","орел","отел","отель","отрез","разлет","рать","ре","резь","релиз","риелтор","риза","ритор","роза","рол","роль","рот","рота","таз","талер","тело","тир","тире","толь","тор","трал","тралер","трель","триер","триера","трио","триоль"],"содержание":["ад","адрес","анероид","анис","ас","дан","даос","дар","дарение","дежа","дерен","держание","дерн","десна","джерси","джин","джинса","динар","дно","до","доение","дож","дорн","драже","дрена","дренаж","дрожание","дрожина","еда","еж","жад","жанр","жар","жарение","жена","жеода","жердина","жир","жиронда","жор","иод","ион","ирод","надир","нард","народ","недра","нереида","нож","норд","нос","ода","одежа","одр","одрина","ор","орда","орден","оса","осаждение","оседание","осина","радио","радон","раж","рдение","ре","редан","редис","ржание","рис","род","родина","роение","рожа","рождение","ронжа","роса","сад","сан","сани","сард","седина","сеид","сени","сено","сеноед","сера","середа","середина","серна","си","сидр","синод","сирен","сирена","сода","сон","сор","сражение","среда","средина"],"автосалон":["аванс","автол","ант","ас","атлас","вал","ванта","вата","влас","вол","волан","волна","волос","вона","лава","лавсан","ласа","ласта","лата","лоно","лот","лото","лотос","навал","наст","нос","нота","овал","оса","основа","осот","остов","отава","отвал","отлов","относ","саван","салат","сало","салон","сан","сван","сват","слава","слово","слон","слот","сова","соло","сон","соната","сота","стан","ствол","стол","столон","стон","талон","тон"],"конформист":["ик","инок","ион","ирмос","иск","исток","кимоно","кино","киото","кит","ком","коми","комфорт","кон","корм","корт","кости","кот","кофр","крот","ми","микрон","микрофон","микст","минор","мир","мирт","миф","монист","монисто","монитор","монстр","мор","мориск","морок","морс","морф","морфин","москит","мост","мостик","мосток","моток","мотор","нос","носик","носок","окно","око","окот","оникс","ор","орк","орок","орфист","осмотр","осот","откорм","откос","относ","отрок","офис","офит","офорт","рис","риск","ритм","риф","рок","рокот","ром","рост","росток","рот","ротик","си","сито","ситро","сифон","скиф","скорм","скот","смотр","снимок","сок","сом","сон","сонм","сор","сорит","сорт","сотник","софит","срок","сток","стон","тик","тир","тис","тиф","тифон","тмин","ток","токсин","том","томик","тон","тоник","тор","торос","торс","торф","трико","трином","трио","трок","трон","трос","фикс","финт","фирн","фон","форинт","форс","форт","фото","фотон","фронт","фтор"],"бардачок":["абак","ад","ара","араб","арак","арба","арка","арча","бак","бар","барак","бард","бардак","барк","барка","бачок","боа","бок","бор","бора","бочар","бочка","бра","брак","брод","даба","дар","дача","дачка","до","док","дока","дочка","драка","дрок","кадр","кара","карда","кача","кобра","код","кода","кора","корд","корда","корча","краб","ода","одр","ор","орда","орк","раб","раба","рада","рак","роба","род","рок","рокада","чадо","чадра","чакра","чара","чарка"],"темперация":["ампер","ампир","ариец","ария","армеец","армия","имя","март","мат","материя","мера","меря","мета","метр","ми","мир","мирт","мирта","митра","мята","памир","пар","паремия","пари","партиец","партия","паря","пат","патер","паяц","перец","пиар","пим","пир","пират","питер","премия","прием","прима","примат","примета","птица","пята","рация","ре","рема","репа","репица","рецепт","рея","ритм","таец","тапер","тапир","тема","темп","темпера","темя","терапия","терем","терц","тип","типец","тир","тире","трап","трапеция","треп","трип","тряпица","цеп","цитра","яма","яр"],"альпинист":["аист","альт","анис","ант","ас","ил","истина","лань","лапти","линт","линь","липа","лис","лиса","лист","наст","настил","нить","пан","пас","пасть","пат","пианист","пила","пина","пинта","план","плис","плита","псина","птиалин","сан","сани","сап","сатин","си","сиаль","сила","силин","силь","синап","синь","сити","слип","спил","спина","сплин","сталь","стан","стиль","стлань","тина","тип","тис"],"кармелит":["акрил","акт","актер","елка","ерик","ик","икра","ил","кал","каре","карт","катер","кета","кила","кит","кларет","климат","клир","крем","лак","лар","ларек","лерка","лет","лик","ликер","литер","литера","литка","литр","мак","макет","маки","маклер","малек","малик","март","мат","материк","мел","мера","мерка","мета","метил","метка","метла","метлика","метр","метрика","ми","мир","мирт","мирта","митра","мрак","рак","ре","река","реликт","рема","ритм","талер","талик","тарелки","телка","тема","терка","терлик","тик","тир","тире","трак","трал","трек"],"терновник":["век","веко","вектор","веник","вено","венок","верк","веткин","вето","виконт","вино","винт","виток","воин","вор","вторник","енот","ерик","ик","инок","интерн","ион","керн","кивер","кино","кит","ковер","кон","конвент","конверт","корвет","корнет","корт","кот","крен","кретин","кретон","кров","крот","неврит","неврон","невротик","неон","нерв","новик","нонет","норник","овен","овин","ор","орк","отек","ре","рев","ров","ровик","рок","рот","ротик","твин","теин","тени","тенор","терн","тик","тир","тире","ток","тон","тоник","тор","трек","трико","трио","трок","трон"],"синекдоха":["ад","аксон","анис","ас","дан","даос","дек","дека","декан","десна","диск","дно","до","док","дока","доска","еда","едок","ехидна","ик","икона","индекс","инок","иод","ион","иск","исход","кино","код","кода","кодеин","кон","коса","нос","носик","ода","окание","океан","оксид","оникс","оса","осадки","осек","осина","осинка","охание","сад","садик","садок","саек","саенко","сак","саке","сан","сани","санки","седина","седок","сеид","сени","сено","си","сиданко","синод","скена","сноха","сода","сок","сон","соха","сход","сходка","хадис","хаки","хан","хаос","хасид","хек","хна","ход","ходик","хон"],"треуголка":["агул","акт","актер","алеут","арго","аул","аут","гаер","гарт","гектар","гетра","глот","глотка","го","гол","гора","горе","горелка","горка","грек","грелка","грот","гул","гурт","гута","елка","кагор","кал","каре","карт","катер","кег","кета","кларет","кол","колер","колет","кора","корт","кот","котел","креол","кроат","крот","круг","куга","курта","кутора","лаг","лак","лар","ларек","латук","легат","лектор","лерка","лет","лето","леток","лог","локаут","лот","луг","лук","лука","округ","округа","ор","оракул","орел","орк","отгул","отек","отел","рагу","рак","раут","ре","река","рог","рок","рол","рот","рота","рука","рулет","рулетка","рута","тако","талер","телка","тело","телок","терка","теург","тога","ток","толк","тор","торг","трак","трал","трек","трог","трок","туарег","туер","тур","тура","турка","турок","угар","угол","уголек","укол","укор","улар","урал","урок","утка","уток","утор","уторка","утро"],"казачество":["азот","акт","аозт","ас","аскет","ваза","вазочка","вакса","вата","ватка","век","веко","вес","вест","весточка","ветка","вето","веточка","воз","возка","воск","завеса","завет","закат","засветка","засев","засека","засечка","засов","затек","затес","заток","заточка","зачаток","зачес","зачет","зачетка","зев","зева","зевака","зевок","зевота","зек","зет","зов","каста","кача","качество","квас","квота","кета","кетч","коза","коса","косач","кот","оаз","овес","овечка","октава","оса","осака","осек","осечка","отава","отвес","отек","отеска","отказ","отсев","отсек","отсечка","очес","оческа","сааз","савка","саек","саз","сак","саква","саке","сачок","сват","свет","светоч","свеча","свечка","своз","сев","севок","секач","секта","сет","сетка","сеточка","сечка","сказ","скат","скетч","скот","скотч","сова","совет","совка","сок","сота","сотка","ставка","стачка","стек","стека","сток","сточка","счет","таз","тако","такса","тасовка","тачка","тезка","тес","тесак","теска","течка","ткач","ток","тоска","точка","чаек","час","часок","чек","чека","чесотка","чета"],"подчеканка":["ад","дан","дача","дачка","дек","дека","декан","депо","дно","до","док","дока","дочка","еда","едок","епанча","кадка","какао","канапе","капа","капкан","капок","кача","качка","кепка","кнопка","код","кода","коечка","кок","кока","кон","кондак","конек","конка","копна","кочан","кочка","неподача","ночка","ода","океан","опак","опека","очанка","паек","пак","пан","панда","панк","пачка","пекан","пена","пенка","пеночка","печка","подача","подачка","подкачка","подначка","почка","чадо","чаек","чакан","чакона","чан","чек","чека","чеканка","чепан"],"метрдотель":["дело","дерть","дерьмо","до","дол","дом","дрель","ель","ерь","лед","леер","лет","лето","лом","лорд","лот","мед","медь","мел","мель","метель","метеор","метод","метол","метр","метро","модель","модельер","мол","моль","мор","море","морель","мотель","мотет","одр","омет","омлет","ор","орел","отдел","отел","отель","отлет","отмель","ре","реле","род","рол","роль","ром","рот","тело","темь","терем","толь","том","тор","торт","тотем","трель","треть","трот"],"самоохрана":["ара","ас","мана","мара","маран","марс","масон","мах","махан","махаон","махра","монарх","монах","мор","морс","мох","мохна","нома","номарх","норма","нос","омар","ор","оса","осман","охра","охрана","рама","рамс","рана","раса","ром","роман","романс","роса","росомаха","саам","саман","самар","сан","сарана","сахар","сноха","сом","сома","сон","сонм","сор","соха","срам","хам","хамса","хан","хаос","хасан","хна","хон","хор","храм","хром"],"бутылконос":["блок","блокнот","бок","бокс","болт","болтун","бон","боны","бостон","бот","бук","букс","бунт","бусы","бут","бутон","бык","быт","клон","клоун","клуб","кнут","кол","колоб","колос","колтун","колун","кон","консул","конус","кот","куб","кулон","кун","куст","лоб","лобок","локон","лоно","лоск","лоскут","лот","лото","лоток","лотос","луб","лук","лыко","лысун","нос","носок","нут","обкос","обнос","обол","оболтус","обыск","окно","око","окот","осот","откол","откос","откус","относ","сбыт","склон","скол","скот","слон","слот","сноб","сок","соло","сон","соты","сток","стол","столб","столон","стон","стук","стул","стык","сук","сукно","сын","сынок","ток","толк","тон","тонус","тун","тыл","тын","убыток","уклон","укол","укос","унты","ус","утконос","уток"],"пародист":["ад","аист","аорист","артос","ас","аспид","даос","дар","диоптр","до","драп","иод","ирод","истод","ода","одр","опт","ор","орда","оса","оспа","отпад","пар","пари","пас","пастор","пат","пиар","пиастр","пир","пират","пирс","пора","порт","посад","пост","пот","потир","радио","радист","рапс","рапсод","рис","род","роса","рост","рот","рота","сад","сап","сард","сатир","си","сидр","сипота","сироп","сирота","ситар","сито","ситро","сода","сопа","сор","сорит","сорт","сота","спад","спирт","спор","спора","спорт","стадо","стопа","строп","стропа","тапир","тип","тир","тис","топ","тор","торс","трап","трио","триод","трип","троп","тропа","трос"],"оставление":["автол","аист","анис","ант","ас","вал","валет","васин","ватин","вена","вено","вес","весло","весна","вест","ветла","вето","вина","вино","винт","виола","вис","влас","власти","воин","вол","волан","волна","вона","енот","ива","ил","илот","ион","лев","левит","лен","ленсовет","лента","лес","леса","лесина","лет","летание","летие","лето","линт","лис","лиса","лист","листва","лосина","лот","навес","навет","навис","налет","налив","наст","настил","натес","невеста","неолит","нива","нилот","нос","нота","овал","овен","овес","овин","олеин","олива","оса","осел","осетин","осина","отвал","отвес","отел","отлив","отсев","сало","салон","сан","сани","сатин","сван","сват","свет","светание","светило","свита","сев","селен","селенит","селин","село","сенат","сени","сено","сеновал","сет","сетование","си","сила","силен","силон","синева","сито","слет","слив","слива","слоение","слон","слот","сова","совет","соление","сон","сонет","сота","стан","ствол","стела","стена","стол","стон","талес","талон","твин","теин","тело","тени","тес","тесание","тесина","тесло","тина","тис","тлен","тление","тон"],"некробиоз":["бек","бекон","берзин","бизон","боек","бок","бон","бор","бриз","ерик","зек","зенки","зерно","зеро","зоб","ибер","ик","инок","ион","ирокез","кеб","керн","кино","козни","кон","корзно","короб","крез","крен","криз","небо","некроз","низ","низок","обзор","обоз","обозник","обои","обрез","обрезок","оброк","озерко","озеро","озноб","озон","озорник","окно","око","ор","орк","орок","ре","резон","рок"],"подцветка":["ад","адепт","акт","ацтек","веда","век","веко","ветка","вето","вода","водка","дева","девка","дек","дека","депо","детва","детка","до","док","дока","еда","едок","кадет","капот","катод","квота","кета","код","кода","копт","кот","овца","ода","опак","опека","опт","отек","отец","отпад","отцеп","отцепка","паек","пак","пакет","пакт","пат","повет","подтек","подцвет","пот","потек","таец","тако","ток","топ","топка","цвет","цветок","цеп"],"валкование":["акание","анклав","вавилон","вал","валек","валенки","валенок","валик","век","веко","великан","вена","веник","вено","венок","вилка","вилок","вина","вино","виола","воин","вокал","вол","волан","волк","волна","вона","елка","ива","ивановка","ик","икона","ил","инок","ион","кал","калан","калин","калина","канал","канва","каолин","кила","кило","кино","клан","клев","клен","клон","коала","кол","колена","кон","лава","лавина","лавка","лак","ланка","лев","левак","лен","лиана","лик","линовка","навал","навивка","накал","наклев","налив","наливка","нива","новик","нолик","овал","овен","овин","окалина","окание","океан","олеин","олива","оливка"],"керамзит":["акт","актер","атеизм","ерик","заем","замер","затек","зек","зет","зима","ик","икра","каре","карт","катер","кета","кит","крез","крем","криз","мазер","мазик","мак","макет","маки","маркиз","маркизет","март","мат","материк","мера","мерка","мета","метка","метр","метрика","ми","мизер","мир","мирза","мирт","мирта","митра","мрак","рак","ре","резак","резка","река","рема","ремиз","риза","ритм","таз","тазик","тезка","теизм","тема","терка","тик","тир","тире","трак","трек"],"электролиз":["ерик","зек","зеро","зет","зло","излет","ик","ил","илот","ирокез","киллер","кило","кит","клир","клозет","козел","кол","колер","колет","колит","корт","кот","котел","крез","креол","криз","крот","лектор","лет","лето","леток","лизол","лик","ликер","ликтор","литер","литр","лори","лот","ор","орел","орк","отек","отел","отрез","ре","релиз","реликт","рок","рол","ролик","ролл","рот","ротик","рэкет","тело","телок","терлик","тик","тир","тире","ток","толк","толки","тор","трек","трико","трио","трок","тэк","экер","экзот","эклер","эрот","этил"],"цистерна":["аист","анис","ант","арест","ариец","ас","асцит","иранец","истец","наст","натес","нацист","ранет","ранец","рант","ратин","ре","рента","ресница","ретина","рис","сан","сани","сатин","сатинер","сатир","сенат","сени","сера","серна","серница","сет","си","синец","сирен","сирена","ситар","ситец","стан","старец","стеарин","стена","стерин","сцена","таец","танец","теин","тени","терн","терц","терцина","тес","тесина","тина","тир","тиран","тире","тис","транс","цена","цент","центр","циан","цитра"],"развилка":["авар","аврал","акрил","ара","арак","арка","ваза","вал","вализа","валик","вар","варка","виза","вилка","вира","враки","завал","заика","зал","зала","залив","заливка","злак","злаки","ива","ик","икра","ил","кал","кара","квазар","кила","клавир","клир","криз","лава","лавка","лавр","лавра","лазка","лак","лар","ливр","лик","развал","разлив","разливка","рак","риза"],"пролепка":["елка","кал","капер","капор","каре","карп","клоп","кол","колер","копал","кора","крап","крапп","креол","креп","лак","лар","ларек","лепка","лепра","лерка","опак","опал","опека","опера","ор","орел","орк","паек","пак","пар","парк","парок","пекло","перка","перл","перо","покер","пол","пола","поле","полк","полка","поп","попка","попрек","пора","порка","прок","рак","ре","река","репа","репка","рок","рол","ропак"],"диалектизм":["ад","азид","акт","атеизм","деизм","дек","дека","дети","детка","дзета","диалект","диатез","диез","диета","еда","езда","елка","зад","задел","заем","зал","залет","затек","зек","зет","зима","злак","злаки","идеал","идеализм","излет","измаил","ик","ил","кадет","кал","кета","кизил","кила","кит","клад","клизма","климат","лад","лак","лед","леди","лет","лик","лимит","литка","мазик","мак","макет","маки","малек","малик","мат","мед","медиа","медик","мел","мета","метил","метка","метла","метлика","мзда","ми","миелит","миледи","таз","тазик","талик","тезка","теизм","телка","тема","тик"],"цветоножка":["акт","акцент","ант","ацетон","ацтек","важ","вежа","век","веко","вена","вено","венок","ветка","вето","вожак","вона","еж","енот","жакет","жена","женка","жетон","жнец","кант","квант","квота","кета","кожа","кон","конец","кот","навет","натек","нож","ножка","ножовка","нота","нотка","овен","овца","океан","окно","око","окова","оконце","окот","отек","отец","оценка","таец","тако","танец","танк","ток","тон","цвет","цветок","цеж","цена","цент","цокот"],"истекание":["аист","аистник","акт","анис","ант","ас","аскет","астеник","ик","икание","инки","иск","искание","истина","каинит","кант","кета","кисет","киста","кит","наитие","наст","натек","натес","натиск","нитка","саек","сак","саке","сан","сани","санки","сатин","секта","сенат","сени","сет","сетка","си","сиенит","сити","скат","скена","скитание","стан","стек","стека","стекание","стена","стенка","такси","танк","теин","тенек","тени","тес","тесак","тесание","тесина","теска","тик","тикание","тина","тис","тиски"],"молотилка":["акт","атолл","атом","ик","икота","ил","илот","кал","камлот","кила","кило","киото","кит","климат","кол","колит","ком","кома","коми","кот","лак","лик","литка","лом","ломик","ломка","ломота","ломтик","лот","лото","лоток","мак","маки","малик","мат","ми","милок","мол","молока","молоки","молот","мотка","моток","око","окот","откол","тако","талик","тик","тимол","тиокол","ток","толк","толки","том","томик"],"ланцетник":["акт","акцент","ант","ацтек","ацтеки","елка","ик","ил","кал","калин","кант","кета","кила","кит","китаец","клан","клен","клиент","кница","лак","ланцет","латинец","латник","лен","ленник","лента","ленца","лет","лик","линт","литка","наин","налет","натек","ненка","нитка","таец","талик","танец","танин","танк","теин","телка","тени","тик","тина","тлен","целина","цена","ценник","цент","циан","цикл","цинк"],"латифундия":["ад","алунит","ант","аудит","аул","аут","дан","дафния","дитя","длина","дуля","дунит","ил","инула","иуда","лад","лафит","линия","линт","литания","лития","лиф","лифт","луна","лунит","ля","нут","талия","тина","тиун","тиф","тля","тун","туна","туф","туфли","туфля","туя","удила","улан","улит","униат","фа","фал","фант","фат","фаут","фаялит","фиал","фиат","фила","филант","филин","филя","финал","финт","фита","фитин","флат","флинт","фунт","фут","яд","ял"],"перебивка":["абвер","абрек","бак","бар","барк","бек","бекар","берека","бивак","бирка","бра","брак","вабик","ваер","вар","веер","век","вера","верба","верк","вира","враки","евреи","ерик","ибер","иберка","ива","ик","икра","капер","каре","кариб","карп","кеб","кепи","кивер","кипа","краб","крап","креп","паб","паек","пак","пар","пари","парик","парк","перка","пиар","пик","пика","пике","пир","раб","рак","ре","рев","река","репа","репка"],"украшение":["акушер","анкер","аршин","ерик","ерш","ик","икра","ишак","каре","кашне","керн","кеш","кран","крашение","крен","крушение","крушина","кун","куна","курение","куш","кушание","нерка","ниша","нукер","рак","ре","река","решка","рикша","руина","рука","руна","рушник","укание","уран","урина","урна","ушан","ушник","шанкр","шар","шарик","шен","ши","шик","шина","шкура","шнек","шнека","шнур","шурин"],"накрывание":["авар","акание","акын","анвар","анкер","ара","арак","арека","арена","арка","аркан","арника","арык","ваер","ванна","вар","варан","вареник","варка","варнак","век","вена","веник","вера","верк","вина","вира","враки","ерик","ива","ик","икра","икры","инвар","иранка","каверна","канва","канна","кара","каре","каренина","керн","кивер","кран","крен","навар","навык","наин","накра","нанка","нарва","нары","нарыв","нарывание","нарывник","ненка","нерв","нерка","нива","нирвана","нрав","равнина","рак","рана","ранка","ре","рев","река","рык","рыкание"],"тартальщик":["акрил","акт","алтарь","альт","ара","арак","арка","артикль","аттик","ик","икра","ил","илька","кал","кара","карат","карт","карта","каталь","кила","киль","кит","клир","криль","лак","лар","ларь","лата","лик","литка","литр","рак","ракита","рать","такт","талик","тальк","тара","тиара","тик","тир","титр","титька","трак","тракт","трал","тральщик","трата","щи","щит"],"трогание":["агент","ант","арго","аргон","гаер","гарт","ген","героин","гетра","гиена","гит","гитан","гнет","го","гон","гонт","гора","горе","горин","горн","гран","гранит","грант","грена","грот","енот","иго","игра","ион","ирга","итог","нега","негр","нога","нота","онагр","ор","орган","ранг","ранет","рант","ратин","ре","регион","рента","ретина","ринг","рог","рот","рота","ротанг","танго","теин","тени","тенор","терн","тигр","тина","тир","тиран","тире","тога","тон","тор","торг","торги","тренога","трио","трог","трон"],"фильмоскоп":["ик","ил","ильм","иск","исполком","кило","киль","клип","клипс","клоп","кол","колос","ком","коми","копь","лик","лис","лиф","лом","ломик","лоск","лось","ми","милок","миф","мол","молоки","моль","мопс","мосол","окись","око","окоп","олимп","опись","осилок","ослик","осмол","ось","офис","пик","пим","писк","письмо","пифос","плис","поиск","покос","пол","полис","полк","поло","полок","помои","помол","посол","си","сикл","силок","силь","сильф","скип","скиф","скол","скоп","слип","слом","смоль","сок","соло","соль","сом","сопли","сопло","спил","спилок","фикс","фильм","флик","флокс","фол"],"галантерея":["агар","агат","агент","агнат","ангар","ангел","ант","ара","ареал","арена","гаер","галера","галерея","галета","гарант","гарт","ген","генерал","гетера","гетра","гнет","гран","гранат","грант","грена","лаг","лангет","лар","лата","легат","леер","лен","лента","лет","летяга","лея","ля","нагар","налет","нарта","натяг","нега","негр","рана","ранг","ранет","рант","ре","реагент","регата","регент","реле","ренегат","ренет","рента","рея","таган","талер","тара","таран","телега","терн","тлен","тля","трал","тяга","ял","яр","яранга","ятаган"],"шестиполье":["ель","ил","илот","лепет","лес","лесть","лет","летие","лето","летопись","лис","лист","литье","лось","лот","опись","опт","осел","ость","ось","отел","отель","пес","песо","пест","пилот","пистоль","питье","плес","плеть","плешь","плис","плот","плоть","пол","поле","полесье","полет","полис","политес","пост","постель","пот","потесь","село","сель","сельпо","сет","сеть","си","силь","сито","слет","слип","слот","соль","сопель","сопли","спель","спил","степ","степь","стиль","стол","столп","тело","тепло","тес","тесло","тип","тис","тишь","толь","топ","топсель","топь","шелест","шепот","шест","ши","шило","шип","шитье","шот","шпиль","штепсель","штиль","штос"],"голубизна":["агул","азу","аул","бал","баул","бизон","било","благо","блин","блуза","боа","бог","боинг","бола","бон","бона","бонза","боулинг","буги","буза","бузина","бунгало","газ","газолин","газон","галун","глаз","глина","глобин","глубина","го","гобан","гоби","гоблин","гол","голуба","гон","губа","губан","гул","гулин","загиб","загон","загул","зал","залог","залогин","зло","злоба","зоб","зола","зона","зуб","зубило","игла","иглу","иго","изба","ил","инула","ион","лаг","лагун","лгун","лига","линза","лоб","лобан","лог","лоза","лозина","лозунг","луб","луг","луза","лузга","луна","нагул","наиб","налог","низ","нога","нуга","оаз","обуза","угол","угон","улан"],"картинка":["акант","акт","ант","ара","арак","арка","аркан","арктика","арника","ик","икра","иранка","каик","канат","кант","кантри","кара","карат","карт","карта","картина","кика","кирка","кит","кран","краник","крик","кринка","накат","накра","нарта","натирка","нитка","рак","ракита","рана","ранка","рант","ратин","ратник","танк","тара","таран","тиара","тик","тина","тир","тиран","трак"],"композитор":["изотоп","ик","импорт","киото","кит","ком","коми","компот","копир","копт","корм","корт","кот","криз","крот","ми","мир","мирт","митоз","мор","мороз","морок","моток","мотор","око","окоп","окот","опор","опорок","опт","оптик","ор","орк","орок","откорм","отпор","отрок","пик","пим","пир","позор","помои","помор","порок","порт","портик","портки","пот","потир","поток","потомок","приз","приток","прок","проток","ритм","рок","рокот","ром","ропот","рот","ротик","тик","тип","тир","ток","том","томик","топ","топик","топор","топорик","тор","торизм","тормоз","трико","трио","трип","трок","тромп","троп","тропик"],"фруктоза":["азот","азу","азур","акт","аозт","аут","закут","зарок","заток","затор","карт","картуз","коза","кора","корт","кот","кофр","кофта","кроат","крот","курта","кутора","оаз","ор","орк","отказ","разок","рак","раут","роза","рок","рот","рота","рука","рута","таз","тако","ток","тор","торф","трак","трок","туз","тур","тура","турка","турок","туф","узор","указ","укор","урок","утка","уток","утор","уторка","утро","фа","факт","фактор","фарт","фартук","фат","фаут","фора","форт","фрак","фрукт","фтор","фура","фут","футор"],"телефонист":["енот","ил","илот","ион","лен","лес","лет","летие","лето","линт","лис","лист","лиф","лифт","лот","неолит","неофит","неф","нилот","нос","олеин","осел","осетин","остеит","остит","отел","отит","отлет","офис","офит","офсет","селен","селенит","селин","село","селфи","сени","сено","сет","си","силен","силон","сито","сифон","слет","слоение","слон","слот","соление","сон","сонет","софит","стилет","стол","столетие","стон","теин","теист","телефон","тело","тени","тент","тес","тесло","тест","тесто","тефлон","тефтели","тис","титло","тиф","тифон","тлен","тление","тон","тост","фелон","фен","фенол","фес","фестон","филе","финт","флинт","флот","фол","фон","фонетист"],"расшивание":["аванс","авар","анвар","анис","ара","арена","аршин","ас","ваер","вар","варан","васин","вена","вера","верша","вершина","вес","весна","вина","вира","вирша","вирши","вис","ерш","ива","иваси","инвар","ирис","ишиас","навар","навес","навис","нарва","нерв","нива","ниша","нрав","рана","раса","расшива","ре","рев","реванш","рис","саван","сан","сани","саше","сван","свара","сев","севр","сени","сера","серв","серна","си","синева","сирен","сирена","сшивание","шанс","шар","шен","ши","шина","ширина"],"подсыхание":["ад","анис","ас","аспид","дан","даос","депо","десна","дно","до","доспех","досыпание","дыхание","еда","ехидна","иод","ион","исход","насып","нос","ода","оса","осина","оспа","оспина","осыпание","осыхание","охание","пан","пас","пах","пена","пенис","пенс","пес","песо","пина","пион","подина","пони","посад","псина","псих","сад","сан","сани","сап","седина","сеид","сени","сено","си","синап","синод","сноп","сноха","сода","сон","сопа","соха","спад","спех","спина","сход","сын","хадис","хан","хаос","хасид","хна","ход","хон"],"кондуктор":["дно","до","док","доктор","донор","дорн","дрок","кнут","код","кок","кокон","кокор","кон","кондор","конкур","контур","корд","кордон","корт","корунд","кот","котурн","крот","кун","курд","курок","куток","норд","нут","нутро","одр","окно","око","окот","окурок","ор","орк","орок","отрок","род","рок","рокот","рондо","рот","ток","тон","тор","трок","трон","труд","тун","тур","турок","укор","урод","урок","урон","уток","утор","утро"],"баллончик":["бак","бал","балкон","балл","баллон","балок","банк","банчок","бачок","биллон","било","бич","бланк","блик","блин","блок","боа","бок","бокал","бола","бон","бона","бочка","ик","икона","ил","инок","ион","кабил","кал","калин","каолин","кила","кило","кино","клан","клич","клон","кол","колба","колчан","кон","кочан","лак","лик","лич","лоб","лобан","лобик","наиб","нолик","ночка","облик","очинка","очки","очник","чал","чан","чин","чина","чинка"],"психрограф":["арго","ас","гипс","гифа","го","гора","гофр","граф","гриф","иго","игра","ирга","ор","оса","оспа","офис","охра","пар","пари","пас","пафос","пах","пиар","пир","пирог","пирога","пирс","пифос","пора","порфир","порфира","прах","пригар","приор","прогар","просфира","профи","псих","рапс","распор","рис","риф","рог","роса","саго","сап","сапог","сапоги","сапфир","си","сиг","сироп","сопа","сор","софа","соха","спор","спора","фа","фапси","фарс","фиг","фига","фигаро","фора","форс","хаос","харрис","хор","храп","хрип"],"младенчик":["ад","дан","дачник","дек","дека","декан","длина","еда","елка","идеал","ик","ил","кал","калин","камин","качели","кила","клад","клан","клен","клич","лад","лак","лед","леди","ледник","лен","ленч","ленчик","лик","лиман","лич","мак","маки","малек","малик","мед","медиа","медик","медник","мел","мена","меч","мечник","ми","милан","мина","млечник","надел","наем","налим","намек","немка","чаек","чал","чан","чек","чека","челка","челн","чин","чина","чинка","член","членик"],"барабулька":["абак","акула","ара","араб","арабка","арак","арба","арка","аул","аура","баба","бабка","бак","бал","балка","балкар","бар","барак","барк","барка","баул","бра","брак","бук","бука","булка","бульб","бур","бура","бурак","бурка","бурлак","кабала","каббала","кал","кара","караул","клуб","краб","куб","кубарь","куль","кульбаба","лак","лар","ларь","луб","лук","лука","раб","раба","рак","рубака","рубка","рубль","рука","руль","улар","урал"],"пластика":["аист","акт","апилак","ас","атлас","ик","ил","иск","кал","капа","капитал","каста","кила","кипа","киста","кит","клип","клипс","клипса","лак","лапа","лапка","лапта","лапти","ласа","ласка","ласта","ластик","лата","лик","липа","липка","лис","лиса","лиска","лист","литка","пак","пакт","палас","палка","пас","паск","паста","пастила","пат","пиала","пик","пика","пила","пилка","писк","плакат","пластик","плата","плис","плиска","плита","плитка","сак","салат","салатик","салки","сап","сапа","сапка","си","сикл","сила","скала","скат","скип","слип","спил","спилка","стилка","такса","такси","талик","тапка","тапки","тик","тип","тис"],"клепочник":["ик","ил","инок","ион","кепи","кило","кино","клен","клик","клинок","клип","клич","клок","клон","клоп","кок","кол","колпик","кон","конек","кончик","копчик","лен","ленч","ленчик","лик","лич","нолик","оклик","олеин","очки","очник","пекло","печник","пик","пике","пикон","пилон","пинок","пион","плен","плечико","плечо","пол","поле","полк","пони","пончик","почин","почки","чек","челн","челнок","чело","чин","чип","член","членик"],"успокоение":["ик","инок","ион","иск","кепи","кино","кипу","кон","конус","кун","купе","купон","нос","носик","носок","окно","око","окоп","оникс","опекун","опенок","опоек","опус","осек","пенек","пение","пенис","пенс","пес","песик","пески","песо","песок","пик","пике","пикон","пинок","пион","писк","пискун","поение","поиск","покос","пони","понос","пук","пуск","сени","сено","си","скип","скоп","скуп","сноп","сок","сон","сопение","сук","сукно","суп","супин","супник","укос","упек","упоение","ус","усик","успение"],"патриотизм":["азот","ампир","аозт","атом","замор","запор","затор","зима","импорт","иприт","март","мат","ми","миозит","мир","мирза","мирт","мирта","митоз","митра","мор","оаз","омар","опт","ор","отит","паз","памир","пар","пари","паром","паротит","пат","патриот","пиар","пим","пир","пират","пирит","питта","поза","пора","порт","пот","потир","приз","призма","прима","примат","проза","риза","ритм","роза","ром","рот","рота","таз","тапир","тип","тир","титр","том","томат","топ","топаз","тор","торизм","торит","торт","трап","трио","трип","тромп","троп","тропа","трот"],"комарник":["ик","икона","иконка","икра","инок","ион","каик","камин","кармин","кика","кино","кирка","кок","кока","кокаин","ком","кома","комар","комарик","коми","комик","кон","конка","кора","коран","коринка","корка","корм","корма","кран","краник","крик","кринка","кромка","крона","мак","маки","маниок","манок","ми","микрон","мина","минор","минорка","мир","мор","мрак","нарком","нома","норка","норма","окрик","омар","ор","орк","оркан","рак","рок","ром","роман"],"барселона":["ара","араб","арба","ареал","арена","арсенал","ас","бал","баланс","балансер","бар","баран","барон","барс","бас","басон","бел","бес","блесна","боа","бола","бон","бона","бор","бора","бра","брас","лар","ласа","лен","лес","леса","лоб","лобан","набор","небо","нос","ор","орел","орлан","оса","осел","раб","раба","рана","раса","ре","роба","рол","роса","саба","сабан","сабо","сало","салон","сан","сбор","сбора","село","сено","сера","серб","серна","слон","сноб","сон","сор"],"работница":["аборт","ант","аорта","ара","араб","арба","арбат","бант","бар","баран","барин","барит","баритон","барон","батон","бинт","бит","бита","боа","бон","бона","бор","бора","борт","бот","бра","брат","братан","братина","ион","набат","набор","наиб","нарта","нота","обрат","ор","орбита","отара","раб","раба","работа","рана","рант","ратин","рацион","роба","рот","рота","табор","танцор","тара","таран","тиара","тина","тир","тиран","тон","тор","торба","торбан","торица","триба","трио","троица","трон","циан","цитра"],"драмкружок":["ад","ажур","аккорд","амур","дар","даур","джок","до","дож","док","дока","дом","домра","дрок","дружка","дружок","дужка","дума","думка","дура","дурак","дурра","жад","жар","жарок","жор","жук","кадр","код","кода","кожа","кожура","кок","кока","ком","кома","комар","кора","корд","корда","корж","корка","корм","корма","кромка","кружка","кружок","куда","кум","кума","кумжа","кураж","курд","курок","мажор","мак","мода","мор","морда","морж","мрак","муар","муж","мука","мура","ода","одр","омар","ор","орда","орк","раж","рак","род","рожа","рок","ром","руда","рука","удар","уж","укор","ум","умора","урод","урок"],"фонограмма":["агар","агроном","амфора","ангар","ара","арго","аргон","арфа","гамма","гном","гнома","го","гомон","гон","гонор","гора","гормон","горн","гофр","грамм","граммофон","гран","граф","графа","графоман","гром","маг","магма","мама","мамон","мамона","мана","манго","мара","маран","марафон","марго","могар","мор","морг","мормон","морф","нагар","нога","нома","норма","омар","онагр","ор","орган","рама","рана","ранг","рог","ром","роман","фа","фанг","фара","фараон","фон","фора","форма"],"разобщение":["анзор","бар","барин","барон","безе","береза","берзин","бизон","боа","бон","бона","бонза","бор","бора","борение","борщ","бра","бриз","бронза","забор","зебра","зерно","зеро","зоб","зона","зрение","ибер","изба","ион","набор","наиб","небо","низ","оаз","обещание","образ","обращение","обрез","обрезание","общение","община","озарение","ор","раб","ращение","ре","резание","резина","резон","риза","роба","роение","роза","роща","щербина","щи"],"темпограф":["ампер","арго","атом","гаер","гарем","гарт","герма","гетра","го","гора","горе","гофр","гофре","граф","гром","грот","маг","марго","март","мат","мера","мета","метр","метро","могар","мор","морг","море","морф","омар","омег","омега","омет","опера","опт","ор","пар","паром","пат","патер","перга","перо","поем","помет","помета","пора","порт","пот","проем","ре","рема","репа","рог","ром","рот","рота","тапер","тема","темп","тога","том","топ","тор","торг","торф","трап","треп","трог","тромп","троп","тропа","фа","фагот","фарт","фат","ферма","фетр","фогт","фора","форма","формат","форт","фрегат","фтор"],"намерзание":["азан","анамнез","ара","арена","заем","замена","замер","зима","знамение","знание","зрение","измена","мазание","мазар","мазер","мана","манер","манера","манна","мара","маран","марена","марзан","мена","мера","мерин","ми","мизер","мина","минер","мир","мирза","мнение","наем","наин","намаз","намин","нанизм","нарезание","нарзан","низ","размен","рама","рана","ранение","ре","резание","резина","рема","ремез","ремиз","риза"],"мажорность":["ант","артос","ас","астроном","атом","жанр","жар","жмот","жор","мажор","мант","манто","марс","март","марь","масон","масть","мат","матрос","мать","монстр","монтаж","мор","морж","морось","морс","мост","мотор","нарост","наст","нож","нома","норма","нос","носарь","нота","омар","ор","оса","осман","осмотр","осот","ость","ось","относ","раж","рамс","рант","рань","рать","рожа","рожон","рожь","ром","роман","романс","ронжа","роса","рост","рот","рота","сан","смотр","сом","сома","сон","сонм","сор","сорт","сота","срам","стаж","стан","стожар","стон","сторож","сторожа","сторона","страж","том","томан","тон","тор","торос","торс","транс","трон","трос","тьма"],"сотрясение":["енот","интерес","ион","нерест","нория","нос","ор","осетин","осетия","осетр","оссеин","остерия","острение","острие","ре","ренет","рея","реяние","рис","роение","россияне","рост","рот","сени","сено","серия","сет","сеяние","си","сирен","систр","сито","ситро","снос","снятие","сон","сонет","соня","сор","сорит","сорт","сотерн","сотня","соя","стерин","стерня","стон","стояние","строение","теин","тени","тенор","теория","терн","теряние","тес","тир","тире","тис","тон","тоня","тор","торс","трение","трио","троение","трон","трос","трясение","яр","яс"],"скиркание":["анис","анкер","ас","аскер","ерик","ик","икание","икра","инки","ирис","иск","искание","искра","каик","каре","кариес","кекс","керн","кика","кикс","киник","кирка","киска","кран","краник","крен","крик","кринка","нерка","рак","ре","река","рис","риск","риска","саек","сак","саке","сан","сани","санки","секира","сени","сера","серна","си","сирен","сирена","скак","сканер","скарн","скена"],"кристалл":["аист","акрил","акт","ас","ик","икра","ил","иск","искра","кал","карст","карт","кила","киста","кит","клир","лак","лар","ластик","лик","лис","лиса","лиска","лист","литка","литр","рак","раклист","ралли","рис","риск","риска","сак","салки","сатир","си","сикл","сила","ситар","скат","старик","стилка","стирка","такси","талик","тик","тир","тис","трак","трал"],"развеска":["авар","ара","арак","арека","арка","ас","аскер","ваер","ваза","вакса","вар","варка","век","вера","верк","вес","врез","врезка","заверка","завеса","засев","засека","зев","зева","зевака","зек","каверза","кара","каре","квазар","квас","краса","крез","развес","рак","раса","ре","рев","резак","резка","река","сааз","савка","саек","саз","сак","саква","саке","свара","сварка","сверка","сев","севр","сера","серв","сказ","сквер","срез","срезка"],"брандмауэр":["ад","амбар","амбра","амур","ара","араб","арба","аура","бадан","банда","бандура","бар","баран","бард","бра","будра","бунд","бур","бура","буран","бурда","бэр","даба","дама","дамба","дан","дар","даур","драма","дуб","дума","дура","дурман","дурра","мана","мара","марабу","маран","муар","мура","мэр","надруб","нард","раб","раба","рада","радар","рама","рана","раунд","руда","румб","румба","руна","удар","ум","умбра","уран","урна","эму","эра"],"лестница":["аист","анис","ант","ас","асцит","ил","истец","ланцет","латинец","лен","лента","ленца","лес","леса","лесина","лет","линт","лис","лиса","лист","налет","наст","настил","натес","нацист","сан","сани","сатин","селин","сенат","сени","сет","си","сила","силен","синец","ситец","сланец","слет","стан","стела","стена","сцена","таец","талес","танец","теин","тени","тес","тесина","тина","тис","тлен","целина","цена","цент","циан"],"нечистота":["аист","анис","ант","ас","атеист","енот","ион","наст","натес","начес","начет","нос","нота","оса","осетин","осина","остеит","остит","отит","отсчет","отчет","очес","сан","сани","сатин","сатинет","сенат","сени","сено","сет","си","сито","сон","сонет","сота","стан","стена","стон","счет","теин","теист","тени","тент","тес","тесина","теснота","тест","тесто","тета","тина","тис","титан","тон","тост","чан","час","чета","чин","чина","чистота"],"ландштурм":["ад","амур","ант","аул","аут","дан","дар","даур","дума","дура","дурман","дутар","душ","душа","лад","ламут","лар","луна","мант","манту","манул","март","марш","мат","муар","мул","мулат","мура","мураш","муштра","нард","нут","рант","раунд","раут","руда","руна","рута","талмуд","трал","транш","труд","туман","тун","туна","тундра","тур","тура","турман","туш","туша","удар","улан","улар","ум","урал","уран","урна","ушан","ушат","шалун","шар","шарм","шатун","шлам","шнур","шрам","штунда","штурм","штурман","шум","шут"],"пергамент":["агент","ампер","ант","гаер","гарем","гарт","ген","герма","гетера","гетман","гетра","гнет","гран","грант","грена","маг","манер","мант","март","мартен","мат","мена","менатеп","мент","мера","меренга","мета","метан","метр","наем","намет","нега","негр","нерпа","пан","панер","пар","пат","патер","пена","перга","ранг","ранет","рант","ре","реагент","регент","рема","ренегат","ренет","рента","репа","тапер","тема","темп","темпера","терем","терн","трап","треп","трепан","трепанг"],"полтинник":["ик","ил","илот","инки","инок","ион","кило","кино","кит","клип","клон","клоп","кол","колит","кон","копт","кот","лик","линотип","линт","литник","лот","никотин","нилот","нолик","опилки","опт","оптик","пик","пики","пикон","пилон","пилот","пинок","пион","питон","плот","плоткин","плотник","пол","политик","полк","пони","понт","пот","потник","тик","тип","типикон","ток","толк","толки","тон","тоник","топ","топик"],"зарастание":["азан","азарт","азиат","аист","анис","ант","ара","арена","арест","ас","астра","затес","зенит","зет","назарет","нарта","наст","натес","низ","рана","ранет","рант","раса","ратин","ре","резина","рента","ретина","риза","рис","сааз","саз","сазан","сан","сани","санитар","сарана","сатана","сатин","сатинер","сатир","сатира","сенат","сени","сера","серизна","серна","сет","си","синтез","сирен","сирена","ситар","срез","стан","старание","старина","стеарин","стена","стерин","страз","страна","таз","тара","таран","тараса","тезис","теин","тени","терн","тес","тесина","тиара","тина","тир","тиран","тире","тис","транс","тризна"],"часовенка":["аванс","аксенова","аксон","ас","вакса","век","веко","вена","вено","венок","вес","весна","вона","воск","канва","кача","квас","кон","коса","косач","кочан","навес","насечка","начес","нос","ночевка","ночка","овен","овес","овечка","океан","оса","осака","осанка","осек","осечка","очанка","очес","оческа","саван","савка","саек","саенко","сак","саква","саке","сан","сачок","сван","сванка","свеча","свечка","сев","севок","секач","сено","сечка","скена","сновка","сова","совка","сок","сон","чаек","чакан","чакона","чан","час","часок","чек","чека","чеснок"],"светолюбие":["бел","бес","билет","било","бит","болт","бот","бювет","бюст","вес","весло","вест","вето","вис","вол","ил","илот","лев","левит","лес","лет","летие","лето","лис","лист","лоб","лот","обвес","обет","облет","обсев","овес","осел","отбив","отвес","отел","отлив","отсев","свет","светило","светолюб","сев","село","сет","си","сито","слет","слив","слот","совет","ствол","стол","столб","тело","тес","тесло","тис","юс","ют"],"излишество":["вес","весло","вест","вето","взлет","визит","вис","воз","вол","зев","зет","зло","зов","излет","ил","илот","лев","левит","лес","лет","лето","лизис","лис","лист","лот","овес","осел","отвес","отел","отлив","отсев","свет","светило","своз","сев","село","сет","си","сити","сито","слет","слив","слитие","слот","совет","ствол","стол","тезис","тело","тес","тесло","тис","шевиот","шест","ши","шиит","шило","шов","шот","штос"],"передовица":["ад","ариец","ваер","вар","веда","ведро","веер","вера","вид","видео","вира","вица","вода","водица","вор","вред","дар","дверца","двор","дворец","дева","девица","депо","дерево","деревцо","диво","до","доверие","драп","древо","дрова","евреи","еда","ива","иод","ирод","овца","ода","одр","опера","ор","орда","пар","пари","певец","певица","перевод","перед","перец","период","перо","пиар","пиво","пир","повар","пора","право","привод","провидец","продавец","радио","ре","рев","редова","репа","репица","ров","род","цедра","цеп"],"бороздка":["ад","бак","бар","бард","барк","боа","бок","бор","бора","борода","бородка","борозда","бра","брак","брод","дар","до","добор","добро","доза","дозор","док","дока","дрок","забор","зад","задок","задор","зарок","зоб","кадр","кобза","кобра","код","кода","коза","кора","корд","корда","короб","краб","оаз","обзор","обод","обоз","оборка","образ","образок","оброк","ода","одр","око","ор","орда","орк","орок","раб","разок","рак","роба","род","роза","рок"],"курсистка":["аист","акт","акустик","ас","аут","ик","икарус","икра","иск","искра","искус","каик","кактус","карст","карт","кассир","каустик","кика","кикс","кирка","киска","киста","кит","крик","крутка","курс","курта","куртка","куст","кустик","кутас","рак","расист","раус","раут","рис","риск","риска","рука","русак","русист","руст","рустика","рута","сак","сакс","сатир","си","систр","ситар","скак","скат","скаут","скука","старик","стирка","страус","стук","сук","сука","сура","сурик","сусак","сутки","такси","тик","тир","тис","трак","трасс","трус","трусик","тур","тура","турка","турки","ус","усик","уста","утка"],"карабинер":["абак","абрек","акание","анкер","ара","араб","арак","арба","арека","арена","арка","аркан","арника","бак","бакен","банк","банка","банкир","бар","барак","баран","барин","барк","барка","баркан","баркин","барри","бек","бекар","бирка","бра","брак","бракер","ерик","ибер","иберка","ик","икебана","икра","иранка","кабан","кабаре","кабина","кара","карабин","каре","кариб","карра","кеб","керн","краб","кран","крен","наиб","накра","нерка","раб","раба","рабкрин","рак","рана","ранка","ре","река"],"присоска":["ас","ик","икра","иск","искра","иссоп","капор","каприс","карп","кассир","кипа","копир","кора","коса","крап","кросс","окрас","опак","описка","ор","орк","оса","оскар","оспа","пак","пар","пари","парик","парк","парок","пас","паск","пасс","пиар","пик","пика","пир","пирс","писк","поиск","пора","порка","присос","прок","рак","рапс","раскос","рис","риск","риска","рок","ропак","роса","сак","сакс","сап","си","сироп","скип","скоп","скопа","скрап","скрип","сок","сопа","сопка","сор","соска","спас","список","спор","спора","спрос","срок","ссора"],"тростник":["ик","инок","ион","иск","исток","кино","кит","кон","корт","кости","кот","крот","ктитор","нос","носик","оникс","ор","орк","остит","отит","оттиск","рис","риск","рок","рост","рот","ротик","си","сито","ситро","скот","сок","сон","сор","сорит","сорт","сотник","срок","сток","стон","стрит","тик","тир","тис","титр","ток","токсин","тон","тоник","тор","торит","торс","торт","тост","трико","трио","тритон","трок","трон","трос","трот"],"прокамбий":["ампир","бай","бак","бар","барий","барк","бирка","боа","бой","бок","бор","бора","бра","брак","бром","ик","икра","камбий","капор","кариб","карп","кий","кипа","кобра","ком","кома","комар","коми","копир","кора","корм","корма","краб","край","крап","крой","май","майор","мак","маки","ми","микроб","мир","мираб","мойка","мор","мрак","омар","опак","опий","ор","орк","паб","пай","пак","памир","пар","пари","парик","парк","парок","паром","пиар","пик","пика","пим","пир","поимка","пойма","пора","порка","прибой","прима","примак","проба","пробка","прок","раб","рай","райком","рак","роба","рой","рок","ром","ромб","ромбик","ропак"],"фаршировка":["авар","ара","арак","арка","арфа","афиша","афишка","африка","вар","варка","вира","вирша","вор","воришка","враки","ива","ик","икра","ишак","кара","карра","каша","кирова","кифара","ковш","кора","кофр","кошара","кров","ор","орава","орк","ошва","рак","ракша","рафик","рикша","риф","ров","ровик","рок","фа","фавор","факир","фара","фарш","фиш","фишка","фора","фрак","шавка","шар","шарик","шаровка","шарф","шарфик","ши","шик","шифр","шифровка","шкаф","шквара","шкив","шов","шок"],"сурепка":["ас","аскер","капер","каперс","каре","карп","каупер","крап","креп","круп","крупа","купа","купе","курс","паек","пак","пар","парк","парсек","парус","пас","паск","паук","перка","пес","прус","прусак","пук","пурка","пуск","рак","рапс","раус","ре","река","репа","репка","репс","рука","русак","саек","сак","саке","сап","сапер","сера","серп","скрап","скрепа","скуп","сук","сука","суп","сура","сурепа","упек","упрек","ус"],"позерство":["вепс","вес","вест","вето","взор","воз","вопрос","вор","ворот","ворс","врез","зев","зеро","зет","зов","овес","озеро","опор","опрос","опт","ор","осетр","осот","остов","остров","отвес","отвоз","отпор","отрез","отсев","перо","перст","пес","песо","пест","повет","повтор","позер","позор","порез","порт","посев","пост","пот","провес","провоз","просвет","просев","просо","протез","протес","ре","рев","репс","ров","ропот","рост","рот","свет","своз","сев","севр","серв","серп","сет","совет","сор","сорт","спор","спорт","срез","створ","степ","стопор","строп","тес","топ","топор","тор","торос","торс","треп","троп","трос"],"долгоносик":["гид","го","год","годок","гол","голик","голод","голос","голосник","голосок","гон","динго","диск","дно","до","дог","док","дол","долг","донг","донос","досол","иго","идол","ик","ил","индолог","инок","иод","ион","иск","кило","кино","кинолог","клон","код","кол","колос","кон","конго","лик","линкос","лис","лисогон","лог","логик","локон","лоно","лоск","нолик","нос","носик","носок","окно","око","оксид","оникс","онколог","осилок","ослик","сгон","си","сиг","сикл","силок","силон","синод","синолог","склон","скол","слог","слон","слоник","сок","соло","солод","сон"],"градиент":["агент","ад","ант","гад","гаер","гарт","ген","гетра","гид","гидра","гидрант","гидрат","гиена","гит","гитан","гнет","гнида","град","гран","гранд","гранит","грант","грена","дан","дар","дерн","дети","детина","диета","динар","дрена","еда","игра","ирга","надир","нард","нега","негр","недра","ранг","ранет","рант","ратин","ре","редан","рента","ретина","ринг","теин","тени","терн","тигр","тина","тир","тиран","тире"],"старание":["аист","анис","ант","ара","арена","арест","ас","астра","нарта","наст","натес","рана","ранет","рант","раса","ратин","ре","рента","ретина","рис","сан","сани","санитар","сатин","сатинер","сатир","сатира","сенат","сени","сера","серна","сет","си","сирен","сирена","ситар","стан","старина","стеарин","стена","стерин","страна","тара","таран","теин","тени","терн","тес","тесина","тиара","тина","тир","тиран","тире","тис","транс"],"заклинание":["азан","акание","анализ","анилин","елка","заика","заикание","зал","зала","зек","зенки","злак","злаки","знак","знание","изнанка","ик","икание","ил","инки","казеин","казна","кал","калан","калин","калина","канал","канна","кизил","кила","кинза","клан","клен","лазание","лазка","лак","ланка","лен","ленник","лиана","лизание","лизин","лик","линза","наин","наказ","накал","нанка","ненка","низ","низание","низина","низка","никелин"],"гитлеровец":["веер","вертел","ветер","вето","виг","вол","вор","герц","гирло","гит","гитов","глот","го","гол","голец","горе","горец","горицвет","грот","евреи","иго","ил","илот","итог","лев","левит","леер","лет","летие","лето","ливер","ливр","литер","литовец","литр","лицо","ловец","лог","лори","лот","ор","орел","орлец","отел","отец","отлив","ре","рев","реле","ров","рог","рол","рот","творец","телец","тело","терц","тигр","тир","тире","тиролец","тор","торг","торги","торец","трио","трог","цвет","целое","цеолит"],"перебранка":["абак","абрек","анкер","ара","араб","арак","арап","арба","арека","арена","арка","аркан","бак","бакен","банк","банка","бар","барак","баран","барк","барка","баркан","бек","бекар","берека","бра","брак","бракер","кабан","кабаре","канапе","капа","капер","кара","каре","карп","карра","кеб","керн","кернер","краб","кран","крап","крен","креп","накра","накрап","нерка","нерпа","паб","паек","пак","пан","панер","панк","пар","пара","паренек","парк","пекан","пена","пенек","пенка","перка","раб","раба","рак","рана","ранка","рапа","ре","река","репа","репка"],"тигренок":["ген","героин","гит","гнет","го","гон","гонт","горе","горин","горн","грек","греки","гренки","грот","енот","ерик","иго","игрек","игрок","ик","инок","ион","итог","кег","керн","кино","кит","кон","корнет","корт","кот","крен","кретин","кретон","крот","негр","ор","орк","отек","ре","регион","ринг","рог","рок","рот","ротик","теин","тени","тенор","терн","тигр","тик","тир","тире","ток","тон","тоник","тор","торг","торги","трек","трико","трио","трог","трок","трон"],"расковка":["авар","ара","арак","арка","ас","вакса","вар","варка","вор","ворс","воск","какао","кара","каркас","каска","кварк","квас","ковка","кок","кока","кокс","кора","корка","корсак","коса","краков","краса","краска","кров","окрас","окраска","ор","орава","орк","оса","осака","оскар","рак","раса","ров","рок","роса","савка","сак","саква","свара","сварка","свора","скак","сковка","скок","сова","совка","сок","сор","срок"],"подсушина":["ад","анис","анус","ас","аспид","дан","даос","дно","до","душ","душа","индус","иод","ион","иуда","ниша","нос","ноша","ода","опус","оса","осина","оспа","оспина","пан","пандус","пас","пина","пион","подина","пони","посад","посуда","посудина","псина","пуд","пунш","сад","сан","сани","сап","си","синап","синод","сноп","сода","сон","сопа","спад","спина","суд","судно","суп","супин","суша","упад","ус","ушан","шанс","ши","шина","шип","шнапс","шоу","шпион","шпон"],"подседина":["ад","аденоид","анис","ас","аспид","дан","даос","дед","дедина","депо","десна","диод","дно","до","еда","иод","ион","нос","ода","оса","осина","оспа","оспина","пан","пас","пена","пенис","пенс","пес","песо","пина","пион","подина","подсад","пони","посад","псина","сад","сан","сани","сап","седина","сеид","сени","сено","си","синап","синод","сноп","сода","сон","сопа","спад","спина"],"маркировка":["авар","ара","арак","арка","вар","варка","вира","вор","враки","ива","ик","икра","каик","какао","камка","каморка","кара","караим","карма","карра","кварк","кивок","кика","кирка","кирова","ковка","коврик","кок","кока","ком","кома","комар","комара","комарик","коми","комик","кора","корка","корм","корма","краков","крик","кров","кромка","мавр","мак","маки","маковка","мара","марка","ми","мир","мирр","мор","мрак","окрик","омар","ор","орава","орк","рак","рама","рамка","ров","ровик","рок","ром"],"плательщик":["акт","альт","елка","ель","ик","ил","илька","кал","капель","капище","кельт","кепи","кета","кила","киль","кипа","кит","китель","клеть","клещ","клещи","клип","лак","лапти","лепка","лепта","лепщик","лет","лещ","лик","липа","липка","литка","литье","паек","пак","пакет","пакт","пальщик","пат","пик","пика","пике","пикет","пила","пилка","питье","пища","пищаль","платье","плащ","плащик","плетка","плеть","плита","плитка","талик","тальк","тапки","телка","теща","тик","тип","щека","щелк","щель","щепа","щепка","щетка","щи","щит"],"бледность":["бедность","бел","бель","бентос","бес","бетон","болт","боль","бон","бот","дело","день","дно","до","доблесть","дол","досье","ель","енот","лед","лен","леность","лень","лес","лесть","лет","лето","лоб","лось","лот","небо","ноль","нос","обдел","обед","обет","облет","олень","осел","осень","ость","ось","отбель","отдел","отел","отель","седло","село","сель","сено","сень","сет","сеть","след","слет","слон","слот","снедь","сноб","соль","сон","сонет","стенд","стол","столб","стон","тело","тень","тес","тесло","тлен","тодес","толь","тон"],"выбраковка":["абак","авар","ара","араб","арабы","арак","арба","арка","арык","бак","бар","барак","барк","барка","боа","бок","бор","бора","бра","брак","браковка","бровка","бык","вар","варка","вварка","вор","выбор","выборка","выварка","выковка","кабак","кавыка","какао","кара","кварк","кобра","ковка","ковы","кок","кока","кора","корка","краб","краков","кров","обрыв","ор","орава","орк","раб","раба","рак","роба","ров","рок","рыба","рыбак","рыбка","рывок","рык"],"проминание":["ампер","ампир","анемон","анион","аноним","ион","манер","мена","мера","мерин","ми","мина","минер","мини","минор","минреп","мир","мор","море","морена","наем","наин","намин","напор","неон","нерпа","нома","номер","нона","норма","омар","опера","ор","памир","пан","панер","панно","пар","пари","паром","пена","пенни","перина","перо","пианино","пиар","пим","пина","пинна","пион","пионер","пир","поем","помин","поминание","пони","понимание","пора","прием","прима","проем","промин","пронимание","ре","рема","репа","репина","ром","роман"],"жеребятина":["ант","ария","бант","баня","бар","бареж","барин","барит","батя","баян","берет","бета","бинт","биржа","бит","бита","бра","брат","братия","еж","жанр","жар","жарение","жбан","жена","жир","ибер","наиб","раб","раж","ранет","рант","ратин","ре","ребята","ренет","рента","ретина","рея","реяние","ржание","рябина","ряж","ряжение","таяние","теин","тени","терн","теряние","тина","тир","тираж","тиран","тире","треба","трение","триба","тяж","тяжба","яр"],"поджарка":["ад","ара","арак","арап","арка","дар","джок","до","дож","док","дока","драка","драп","дрок","жад","жар","жара","жарок","жопа","жор","кадр","капа","капор","кара","карда","карп","код","кода","кожа","кора","корд","корда","корж","кража","крап","ода","одр","опак","опара","ор","орда","орк","паж","пак","пар","пара","парад","парк","парок","пожар","пора","порка","продажа","прок","рада","раджа","раж","рак","рапа","род","рожа","рок","рокада","ропак"],"старпом":["артос","ас","атом","марс","март","мат","матрос","мопс","мор","морс","мост","омар","опт","ор","оса","оспа","пар","паром","пас","пасмо","пастор","пат","пора","порт","пост","пот","рамс","рапс","ром","роса","рост","рот","рота","сап","смотр","сом","сома","сопа","сор","сорт","сота","спор","спора","спорт","срам","стопа","строп","стропа","том","топ","тор","торс","трап","тромп","троп","тропа","трос"],"спаситель":["аист","альт","ас","ель","ил","лапти","лепта","лес","леса","лесс","лесть","лет","липа","лис","лиса","лист","литье","пас","пасс","пастель","пасть","пат","пес","пест","пила","писатель","питье","платье","плес","плеть","плис","плита","пьеса","сап","сель","сет","сеть","си","сиаль","сиеста","сила","силь","сласти","сласть","слет","слип","спас","спель","спесь","спил","сталь","стапель","стела","степ","степс","степь","стиль","талес","тес","тип","тис"],"слезинка":["анис","ас","елка","зал","зек","зенки","злак","злаки","знак","ик","ил","иск","казеин","кал","калин","кила","кинза","клан","клен","лак","лен","лес","леса","лесина","леска","лесник","лик","линза","лис","лиса","лиска","низ","низка","саек","саз","сак","саке","салки","сан","сани","санки","селин","сени","си","сикл","сила","силен","силенка","сказ","скена","слеза","слезник"],"синестрол":["енот","ил","илот","ион","лен","лес","лесс","лет","лето","линт","лис","лист","литер","литр","лори","лорнет","лот","неолит","нилот","нос","олеин","ор","орел","осел","осетин","осетр","оссеин","острие","отел","ре","рис","рол","рост","рот","селин","село","сени","сено","сет","си","силен","силон","силос","сирен","систр","сито","ситро","слет","слон","слот","снос","солист","солитер","сон","сонет","сор","сорит","сорт","сотерн","стерин","стирол","стол","стон","теин","тело","тени","тенор","терн","тес","тесло","тир","тире","тис","тлен","тон","тор","торс","трио","трон","трос"],"прабабушка":["абак","ара","араб","арабка","арак","арап","арба","арка","аура","баба","бабашка","бабка","бабуша","бабушка","бак","бар","барак","барк","барка","башка","бра","брак","бук","бука","бур","бура","бурак","бурка","капа","кара","карп","каша","краб","крап","круп","крупа","куб","купа","куш","паб","пак","пар","пара","параша","парк","парша","паук","паша","прабабка","пук","пурка","пушка","раб","раба","рак","ракуша","ракша","рапа","рубака","рубашка","рубка","рука","упарка","шапка","шар","шкура","шпур","шуба","шубка","шурпа"],"волшебница":["бал","бел","белица","било","блин","блинец","блиц","боа","боец","бола","болван","бон","бона","вал","валец","вена","вено","вешало","вина","вино","винцо","виола","вица","вобла","воин","вол","волан","волна","вона","ива","ил","ион","лев","левша","лен","ленца","ливонец","лицо","лоб","лобан","ловец","наиб","налив","небо","нива","ниша","ноша","обвал","обливанец","овал","овен","овин","овца","олеин","олива","ошва","целина","цена","циан","шаблон","шанец","шанц","шваб","шен","ши","шило","шилова","шина","шлиц","шобла","шов"],"фильдекос":["дек","деколь","дело","дефис","диск","до","док","дол","досье","едок","ель","идол","ик","ил","иод","иск","кило","киль","кисель","код","кол","колье","кофе","лед","леди","ледок","лес","лесок","лик","лис","лиф","лоск","лось","окисел","окись","оксид","осек","осел","ослик","ось","офис","седло","седок","сеид","село","селфи","сель","си","сикл","силок","силь","сильф","скиф","скол","след","сок","соль","феод","фес","фидель","фикс","филе","флик","флокс","фол"],"задержание":["ад","ажан","азан","азид","ара","арена","аренда","дан","дар","дарение","дежа","дереза","дерен","держание","дерзание","дерн","джаз","джин","диез","динар","драже","дрезина","дрена","дренаж","еда","еж","езда","жад","жадина","жанр","жар","жара","жарение","жена","жердина","жир","зад","задание","задира","заедание","заражение","здание","зрение","надир","надрез","наезд","нард","недра","нереида","низ","рада","раджа","радиан","раж","рана","рдение","ре","редан","резание","резеда","резина","ржание","риза"],"негритенок":["ген","генетик","героин","гит","гнет","гноение","го","гон","гонение","гонт","горе","горение","горин","горн","грек","греки","гренки","грот","енот","еретик","ерик","иго","игрек","игрок","ик","инок","интерн","ион","итог","кег","керн","кино","кит","кон","корнет","корт","кот","крен","кретин","кретон","кроение","крот","негр","неоген","неон","нонет","норник","ор","орк","отек","ре","регент","регион","ренет","рентген","ринг","рог","роение","рок","рот","ротик","теин","тенек","тени","тенор","терн","тигр","тик","тир","тире","ток","тон","тоник","тор","торг","торги","трек","трение","тренинг","трико","трио","трог","троение","трок","трон"],"исполком":["ик","ил","иск","кило","клип","клипс","клоп","кол","колос","ком","коми","лик","лис","лом","ломик","лоск","ми","милок","мол","молоки","мопс","мосол","око","окоп","олимп","осилок","ослик","осмол","пик","пим","писк","плис","поиск","покос","пол","полис","полк","поло","полок","помои","помол","посол","си","сикл","силок","скип","скол","скоп","слип","слом","сок","соло","сом","сопли","сопло","спил","спилок"],"напиток":["аконит","акт","ант","ик","икона","икота","инок","ион","кант","капот","катион","кино","кипа","кит","кон","копна","копт","кот","нитка","нота","нотка","опак","опт","оптик","оптика","пак","пакт","пан","панк","пат","пик","пика","пикан","пикон","пина","пинок","пинта","пион","питон","пони","понт","пот","потник","тако","танк","тапки","тик","тина","тип","ток","тон","тоник","тоника","топ","топик","топика","топка"],"космограф":["арго","ас","го","гора","горка","горком","гофр","граф","гром","кагор","ком","кома","комар","комсорг","кора","корм","корма","коса","кофр","маг","мак","марго","марс","могар","мор","морг","морок","морока","морс","морф","мрак","огарок","око","окрас","омар","ор","орк","орок","оса","оскар","осока","рак","рамс","рог","рок","ром","роса","саго","сак","скорм","смак","смог","сок","сом","сома","сор","сорога","сорока","софа","софора","срам","срок","фа","факс","фарс","фора","форма","форс","фрак"],"отмыкание":["аконит","акт","акын","ант","атом","атомник","енот","ик","икона","икота","инок","ион","камин","кант","катион","кета","кино","кит","ком","кома","комета","коми","кон","кот","мак","макет","маки","маниок","манок","мант","манто","мат","мена","мент","ментик","мета","метан","метка","ми","мина","митенка","монета","монетка","мотка","мыт","мытник","мыто","наем","намек","намет","натек","немка","немота","нитка","нома","нота","нотка","окание","океан","омет","отек","отмена","тако","танк","теин","тема","тени","тик","тина","тмин","ток","том","томан","томик","тон","тоник","тоника","тын"],"перековка":["ваер","вар","веер","век","веко","вера","верк","вор","капер","капок","капор","каре","карп","квакер","кварк","кепка","ковер","ковка","кок","кока","кора","корка","краков","крап","креп","кров","опак","опека","опера","ор","орк","паек","пак","пар","парк","парок","перка","перо","повар","поверка","покер","пора","порка","право","прок","рак","ре","рев","река","репа","репка","ров","рок","ропак"],"однолетка":["ад","акт","анекдот","ант","дан","дек","дека","декан","дело","детка","дно","до","док","дока","дол","еда","едок","елка","енот","кадет","кал","кант","катод","кета","клад","клан","клен","клон","код","кода","кодла","кол","колена","колено","колет","колода","колонат","кон","кот","котел","лад","ладо","лак","лед","ледок","лен","лента","лет","лето","леток","лодка","локон","лоно","лот","лото","лоток","надел","надкол","налет","натек","недокал","недотка","нота","нотка","ода","океан","оклад","окно","око","окот","отдел","отделка","отек","отел","откол","тако","талон","танк","телка","тело","телок","тлен","ток","толк","тон"],"каламбур":["абак","акула","аларм","амбал","амбар","амбра","амур","ара","араб","арак","арба","арка","аул","аура","бак","бал","балка","балкар","бар","барак","барк","барка","баул","бра","брак","бук","бука","булка","бур","бура","бурак","бурка","бурлак","кал","кара","караул","карма","клуб","клумба","краб","куб","кум","кума","лак","лама","лар","луб","лук","лука","мак","мала","мара","марабу","марал","марка","мрак","муар","мука","мул","мура","раб","раба","рак","рама","рамка","рубака","рубка","рука","румб","румба","улар","ум","умбра","урал"],"сберегание":["абрис","анис","ас","бар","барин","барс","бас","басни","бег","бега","бегание","берег","бес","бисер","бра","брас","бриг","гаер","ген","герб","гиена","граб","грабен","гран","грена","гриб","ибер","игра","ирга","набег","наиб","нега","негр","раб","ранг","ре","регби","ринг","рис","сагиб","саиб","сан","сани","сбег","сбегание","сгиб","сгребание","сени","сера","серб","серегин","серна","си","сиг","сирен","сирена","снег"],"лжеприсяга":["ария","ас","гаер","галс","гипс","гиря","глас","еж","жар","жига","жила","жир","игла","игра","ил","ирга","лаг","лаж","лар","лепра","лес","леса","лея","лига","липа","лис","лиса","ля","ляп","ляпис","паж","палея","палия","пар","пари","паря","пас","пелагия","перга","перила","перл","персия","пес","пиар","пила","пир","пирс","плес","плис","пляж","пляс","присяга","пряжа","пяла","раж","рапс","распил","ре","реалия","регалия","репа","репс","рея","рис","ряж","ряса","сап","сапер","сепия","сера","сериал","серия","серп","си","сиг","сила","слега","слип","спил","спирея","ял","яр","яс","ясли"],"присядка":["ад","адряс","ария","ас","аспид","дар","диск","драп","ик","икра","иск","искра","кадр","каприс","карп","кипа","крап","пак","пар","пари","парик","парк","паря","пас","паск","пиар","пик","пика","пир","пирс","писк","прядка","рак","ракия","рапс","рис","риск","риска","ряд","ряса","ряска","сад","садик","сак","сап","сард","си","сидр","скип","скирд","скирда","скрап","скрип","спад","яд","як","яр","ярд","ярка","яс"],"жироприказ":["жар","жарок","жир","жирок","жопа","жор","зажор","запор","зарок","ик","икра","капор","каприз","кариоз","карп","кипа","кожа","коза","копир","кора","корж","крап","криз","оаз","опак","ор","орк","паж","паз","пак","пар","пари","парик","парк","парок","пиар","пик","пика","пики","пир","пожар","поза","показ","пора","порка","приз","призрак","приказ","приор","проза","прозаик","прок","раж","разок","рак","риза","рожа","рожки","роза","рок","ропак"],"кронглас":["аксон","арго","аргон","ас","галс","гарсон","глас","го","гол","гон","гонка","гора","горка","горлан","горн","гран","кагор","кал","клан","клон","кол","кон","кора","коран","коса","кран","крона","лаг","лак","лар","лог","лоск","налог","нога","норка","нос","окрас","онагр","ор","орган","орк","оркан","орлан","оса","оскал","оскар","рак","ранг","раскол","рог","рок","рол","роса","саго","сак","сало","салон","сан","сгон","сгонка","скало","скарн","склон","скол","слог","слоган","слон","сок","солка","сон","сор","срок"],"оккультизм":["зло","золь","излом","измол","ик","ил","илот","ильм","кило","киль","кит","клик","клок","клотик","козлик","кок","кокиль","кол","колит","кольт","ком","коми","комик","кот","котик","кулик","куль","культ","кум","куток","лик","лом","ломик","ломтик","лот","лук","ми","милок","митоз","мол","моль","мул","мультик","муть","озимь","оклик","омуль","омут","отклик","тик","тимол","ток","толк","толки","толь","том","томик","туз","тузик","узик","укол","улит","ум","умолк","утиль","уток"],"троечник":["енот","ерик","ик","инок","ион","керн","кетч","кино","кит","кон","корнет","корт","корчи","кот","крен","кретин","кретон","крот","ор","орк","отек","очерк","очки","очник","ре","речник","рок","рот","ротик","теин","тени","тенор","терн","тик","тир","тире","ток","тон","тоник","тор","трек","тренчик","трико","трио","трок","трон","чек","черт","чертик","четки","чин","чир","чирок"],"киловатт":["автол","акт","актив","аттик","вал","валик","ватт","вилка","вилок","виола","виток","вокал","вол","волк","ива","ик","икота","ил","илот","кал","квота","кила","кило","кит","кол","колит","кот","лак","лик","литвак","литка","лот","овал","олива","оливка","отвал","отит","откат","отлив","отливка","тавот","тако","такт","талик","тик","титло","титовка","ток","толк","толки"],"персонал":["ас","лар","лен","лепра","лес","леса","налеп","напор","нерпа","нос","опал","опера","ор","орел","орлан","оса","осел","оспа","пан","панер","пар","пас","паслен","пена","пенал","пенс","перл","перлон","перо","персона","пес","песо","план","планер","плен","плена","плес","пол","пола","поле","пора","прасол","рапс","ре","репа","репс","рол","роса","сало","салон","салоп","сан","сап","сапер","село","сено","сера","серна","серп","слон","сноп","сон","сопа","сор","спор","спора"],"перепилка":["акрил","елка","ерик","ик","икра","ил","кал","капер","каре","карп","кепи","кила","кипа","клеппер","клип","клипер","клир","крап","крапп","креп","лак","лар","ларек","леер","лепка","лепра","лерка","лик","ликер","липа","липка","паек","пак","пар","пари","парик","парк","пепел","перила","перка","перл","пиар","пик","пика","пикап","пике","пила","пилка","пипка","пир","плеер","прилеп","прилепа","рак","ре","река","реле","репа","репка","реплика"],"перезаявка":["авар","ара","арак","арап","арека","арка","ваер","ваза","вар","варка","веер","век","вера","верк","врез","врезка","вяз","вязка","заверка","запев","заря","заявка","зверек","зев","зева","зевака","зек","каверза","капа","капер","кара","каре","карп","квазар","крап","крез","креп","пава","паек","паз","пак","пар","пара","парез","парк","паря","перевязка","перка","права","правка","рак","рапа","ре","рев","резак","резка","река","репа","репка","рея","явка","язва","як","яр","ярка"],"перерасход":["ад","адрес","ас","даос","дар","депо","до","доспех","драп","еда","ода","одр","опера","ор","орда","ордер","орех","оса","оспа","охра","пар","пас","пах","перед","перерод","переход","перо","пес","песо","пора","посад","прах","прореха","рапс","рапсод","распор","расход","ре","репа","репс","род","роса","сад","сап","сапер","сард","сера","сердар","середа","серп","сода","сопа","сор","соха","спад","спех","спор","спора","среда","сход","хаос","харпер","херес","ход","хор","храп"],"конокрад":["ад","аккорд","дан","дар","дно","до","док","дока","донор","дорн","дракон","дрок","кадр","код","кода","кок","кока","кокон","кокор","кон","кондак","кондор","конка","кора","коран","корд","корда","кордон","корка","корона","коронка","кран","крона","нард","народ","норд","норка","ода","одр","окно","око","окорка","ор","орда","орк","оркан","орок","радон","рак","род","рок","рондо"],"присыхание":["анис","ас","аспирин","ирис","нары","насып","нерпа","пан","панер","пар","пари","пас","пах","пена","пенис","пенс","перина","пес","пиар","пина","пир","пирс","писание","прах","псина","псих","рапс","ре","репа","репина","репс","рис","рысиха","сан","сани","сап","сапер","сени","сера","серна","серп","си","синап","сирен","сирена","спех","спина","спирин","сын","сыр","хан","хна","храп","хрен","хрип"],"перкуссия":["ерик","ик","иск","искус","кепи","кипу","кисея","креп","круп","купе","курия","курс","персик","персия","пес","песик","пески","пик","пике","пир","пирс","писк","пресс","прикус","прус","прусик","прусс","пук","пуск","ре","репс","рея","рипус","рис","риск","рупия","секс","сепия","серия","серп","си","скип","скрип","скуп","спикер","спирея","спуск","сук","суп","сурик","упек","упрек","ус","усик","як","яр","ярус","яс"],"фактограф":["агар","агат","акт","аорта","ара","арак","арго","арка","арфа","гарт","го","гора","горка","гофр","граф","графа","грот","кагат","кагор","кара","карат","карга","карт","карта","каторга","кора","корт","кот","кофр","кофта","крага","кроат","крот","ор","орк","отара","рак","рог","рогатка","рок","рот","рота","тако","тара","тога","ток","тор","торг","торф","трак","трог","трок","фа","фагот","факт","фактор","фара","фарт","фат","фата","фогт","фора","форт","фрак","фтор"],"принцесса":["анис","ариец","ас","иранец","испанец","нарцисс","нерпа","пан","панер","пар","пари","пас","пасс","пена","пенис","пенс","перина","пес","пиар","пина","пир","пирс","писец","пресс","пресса","принц","псина","ранец","рапс","ре","репа","репина","репица","репс","ресница","рис","сан","сани","сап","сапер","сапиенс","сеанс","сени","сера","серна","серница","серп","си","синап","синец","сирен","сирена","спас","спина","спица","сцена","сцеп","цена","цеп","циан"],"скарбница":["абак","абрис","анис","ара","араб","арак","арба","арка","аркан","арника","ас","бак","банк","банка","банкир","бар","барак","баран","барин","барк","барка","баркан","баркас","баркин","барс","бас","баск","баска","баски","басни","бикс","бирка","бра","брак","брас","ик","икра","иранка","иск","искра","кабан","кабина","кара","карабин","кариб","кираса","кница","краб","кран","краса","крица","наиб","накра","раб","раба","рак","рана","ранка","раса","рис","риск","риска","саба","сабан","саиб","сак","сан","сани","санки","сарацин","си","скарб","скарн","циан","цинк","цирк"],"монтажер":["ант","атом","еж","енот","жанр","жар","жена","жетон","жмот","жор","мажор","манеж","манер","манжет","мант","манто","март","мартен","мат","межа","мена","мент","мера","мета","метан","метр","метро","монета","монтаж","монтер","мор","море","морена","морж","наем","намет","немота","нож","нома","номер","норма","нота","омар","омет","ор","отмена","раж","ранет","рант","ре","рема","ремонт","рента","рожа","ром","роман","ронжа","рот","рота","тема","тенор","терн","том","томан","тон","тор","трон"],"органоид":["ад","арго","аргон","гад","гид","гидра","гнида","го","год","година","гон","гонор","гора","гордон","горин","горн","город","град","гран","гранд","дан","дар","динар","динго","дно","до","дог","донг","донор","дорн","дорога","дрога","иго","игра","иод","ион","ирга","ирод","надир","нард","народ","нога","норд","ода","одр","одрина","онагр","ор","орган","орда","радио","радон","ранг","ринг","рог","род","родина","рондо"],"тетралогия":["арго","ария","атлет","гаер","галиот","гарт","гетра","гетто","гирло","гиря","гит","глот","го","гол","гора","горе","грот","игла","иго","игра","ил","илот","ирга","итог","лаг","лар","латерит","легат","лет","летаргия","лето","летяга","лея","лига","литер","литера","литорея","литр","лог","лори","лот","ля","ор","оргия","орел","отел","отит","отлет","ре","реалия","регалия","рея","рог","рол","рот","рота","талер","талия","театр","тело","теория","тета","тетрил","тетя","тигр","тир","тире","титло","титр","тля","тога","тор","торг","торги","торит","торт","трал","трио","триолет","трог","трот","тротил","тяга","тягло","тягота","ял","яр"],"кантилена":["акание","акант","акт","анкета","ант","елка","ик","ил","кал","калан","калин","калина","канал","канат","канна","кант","катание","кета","кила","кит","клан","клен","клиент","лак","ланита","ланка","лантан","лата","латинка","латник","лен","ленник","лента","лет","лиана","лик","линт","литка","наин","накал","накат","налет","нанка","натек","ненка","нитка","талик","танин","танк","теин","телка","тени","тик","тина","тлен"],"пассажирка":["ара","арак","арап","арка","ас","жар","жара","жир","ик","икра","иск","искра","капа","каприс","кара","карп","касса","кассир","кипа","кираса","кража","крап","краса","паж","пак","пар","пара","пари","парик","парк","пас","паск","пасс","пассаж","пассажир","пиар","пик","пика","пир","пирс","писк","раж","рак","рапа","рапс","раса","расписка","рис","риск","риска","сажа","сак","сакс","сап","сапа","сапка","саржа","си","скип","скрап","скрип","спаржа","спас"],"семяпочка":["ас","камея","ком","кома","компас","коса","косач","мак","маяк","маячок","меч","мопс","моча","мочка","мясо","мяч","опак","опека","оса","осек","осечка","оспа","очес","оческа","паек","пак","пас","паск","пасмо","пес","песо","песок","печка","поем","почка","пояс","саек","сак","саке","сап","сачок","секач","сема","семя","сечка","скоп","скопа","смак","сок","сом","сома","сопа","сопка","соя","спячка","чаек","час","часок","чек","чека","як","яма","ямочка","яс"],"спецпроект":["копт","кореец","корсет","корт","косец","костер","кострец","кот","креп","крест","крестец","крот","опт","ор","орк","осек","осетр","острец","отек","отец","отсек","отцеп","перекоп","перекос","перец","перо","перст","пес","песец","песо","песок","пест","покер","поп","попрек","порт","пост","пот","потек","прекос","проект","прок","пропс","просек","проспект","протес","ре","репс","рецепт","рок","рост","рот","секрет","сектор","серко","серп","сет","скепт","скерцо","скоп","скот","сок","сор","сорт","спектр","спецкор","спор","спорт","срок","стек","степ","сток","стокер","строп","сцеп","терц","тес","ток","топ","тор","торец","торс","трек","треп","треск","трок","троп","трос","цеп"],"пеклевание":["вал","валек","валенки","валик","век","веление","великан","вена","веник","вилка","вина","елка","ива","ик","ил","кал","каление","калин","кепи","кила","кипа","клан","клев","клевание","клеение","клен","клепание","клип","лак","лапник","лев","левак","лен","лепка","лик","липа","липка","наклев","налеп","налив","напев","нива","павлин","паек","пак","паклен","пан","панк","пекан","пелевин","пелена","пеленка","пеликан","пена","пенал","пенек","пение","пенка","пик","пика","пикан","пике","пила","пилав","пилка","пина","плав","плавки","плавник","план","плева","плевание","плевна","плен","плена","пленка"],"раскрутка":["акт","актау","ара","арак","арка","ас","астра","аура","аут","кактус","кара","каракурт","карат","каркас","карра","карст","карт","карта","каска","каста","краса","краска","крутка","курс","курта","куртка","куст","кутас","рак","ракурс","раса","раскат","растр","раус","раут","рука","русак","руст","рута","сак","сакура","скак","скат","скатка","скаут","скука","старка","стук","сук","сука","сура","такса","тара","трак","траур","трус","тур","тура","турка","укатка","ус","уста","утка"],"славистика":["аист","акт","актив","ас","атлас","вакса","вал","валик","василиск","вассал","вата","ватка","вилка","вис","виски","влас","власти","ива","иваси","ик","ил","иск","кал","касса","каста","квас","киви","кила","киста","кит","класс","ксилит","лава","лавка","лак","ласа","ласка","ласта","ластик","лата","лик","лис","лиса","лиска","лист","листва","листик","литвак","литка","савка","сак","саква","сакс","салат","салатик","салки","свалка","свастика","сват","свист","свита","свитка","си","сикл","сила","силикат","сити","скала","скат","слава","славист","славистка","славка","сласти","слив","слива","сливка","сливки","ставка","стилка","такса","такси","талик","тик","тис","тиски"],"ретивость":["вес","вест","весть","весь","вето","вис","витье","вор","ворс","ерь","овес","ор","осетр","остеит","остит","острие","ость","ось","отвес","ответ","отит","отсвет","отсев","ре","рев","рис","ров","рост","рот","свет","свитер","сев","севр","серв","сет","сеть","си","сито","ситро","совет","сор","сорит","сорт","створ","стрит","твист","теист","тес","тест","тесто","тесть","тир","тире","тис","титр","тор","торит","торс","торт","тост","тостер","трест","треть","триест","трио","трос","трость","трот"],"стальник":["аист","акт","альт","анис","ант","ас","ик","ил","илька","иск","кал","калин","кант","кила","киль","киста","кисть","кит","клан","лак","лань","ластик","латник","лик","линт","линь","линька","лис","лиса","лиска","лист","литка","наст","настил","натиск","нитка","нить","сак","салки","сальник","сан","сани","санки","сатин","си","сиаль","сикл","сила","силь","синь","синька","скань","скат","сталь","стан","стилка","стиль","стланик","стлань","такси","талик","тальк","тальник","танк","тик","тина","тис","ткань"],"кастрация":["аист","акация","акт","актриса","акция","ара","арак","ария","арка","ас","астра","асцит","атаксия","ик","икра","иск","искра","кара","карат","карст","карт","карта","каста","кираса","киста","кит","краса","крица","рак","ракита","ракия","раса","раскат","рация","рис","риск","риска","ряса","ряска","сак","сатир","сатира","си","ситар","скат","старик","старка","стация","стая","стирка","такса","таксация","такси","тара","тиара","тик","тир","тис","трак","тряска","цирк","цитра","як","яр","ярка","яс"],"рублевка":["абвер","абрек","аул","бак","бал","бар","барк","баул","бек","бекар","бел","белка","бра","брак","буер","буерак","бук","бука","буква","букле","булка","бур","бура","бурав","бурак","буревал","бурка","бурлак","ваер","вал","валек","валер","вар","век","вера","верба","верк","вруб","елка","кал","каре","кеб","клев","клуб","краб","куб","курва","лавр","лак","лар","ларек","лев","левак","лерка","луб","лук","лука","раб","рак","ре","рев","река","рубка","рука","рукав","увал","увар","улар","урал"],"кардинал":["ад","акрида","акрил","ара","арак","арка","аркан","арника","дан","дар","динар","длина","драка","дранка","ик","икра","ил","иранка","ирландка","кадр","кал","калан","каландр","калин","калина","канал","кара","карда","кардан","кила","клад","клан","клир","кран","лад","ладан","лак","ланка","лар","лиана","лик","надир","накал","накра","нард","рада","радиан","радикал","рак","рана","ранка"],"решаемость":["арест","артос","ас","атом","ересь","ерш","ерь","марс","март","марш","марь","мастер","масть","мат","матерь","матрос","мать","мера","место","месть","мета","метеор","метр","метро","мор","море","морс","мост","мосье","мсье","омар","омет","ор","оса","осетр","ость","ось","рамс","рать","ре","рема","решето","ром","роса","рост","рот","рота","саше","сема","семь","сера","сет","сеть","смерть","смета","смотр","сом","сома","сор","сорт","сота","срам","старье","тема","темь","теорема","терем","термос","тес","тесьма","теша","том","тор","торс","трос","тьма","шамот","шар","шарм","шатер","шерсть","шест","шот","шрам","шрот","штора","шторм","штос"],"ветреность":["веер","вено","вентерь","верность","вес","вест","вестерн","весть","весь","ветер","вето","вонь","вор","ворс","енот","ересь","ерь","нерв","нерест","новь","нос","овен","овес","ор","осень","осетр","ость","ось","отвес","ответ","отсвет","отсев","ре","рев","ревень","ревность","ренет","ров","рост","рот","свет","светотень","сев","север","севр","сено","сень","сеньор","серв","сет","сеттер","сеть","соверен","совет","сон","сонет","сор","сорт","сотерн","створ","стернь","стон","тенор","тент","тень","терн","тернев","тес","тест","тесто","тесть","тон","тор","торс","торт","тост","тостер","трест","треть","троетес","трон","трос","трость","трот"],"песчинка":["анис","ас","ик","иск","кепи","кипа","начес","паек","пак","пан","панк","пас","пасечник","паск","пекан","пена","пенис","пенка","пенс","пес","песик","пески","песчаник","печка","печник","пик","пика","пикан","пике","пина","писк","псина","саек","саечник","сак","саке","сан","сани","санки","сап","секач","сени","сечка","си","синап","скена","скип","спина","спинка","спич","спичка","чаек","чан","час","часик","чек","чека","чепан","чин","чина","чинка","чип"],"преемство":["веер","вепс","вертеп","вес","вест","ветер","вето","вор","ворс","место","метеор","метр","метро","мопс","мор","море","морс","мост","овес","омет","опт","ор","осетр","отвес","отсев","перо","перст","пес","песо","пест","повет","поем","помет","порт","посев","пост","пот","провес","проем","промес","просвет","просев","протес","ре","рев","репс","ров","ром","рост","рот","свет","сев","север","севр","серв","серп","сет","смотр","совет","сом","сор","сорт","спор","спорт","створ","степ","строп","темп","терем","термос","тес","том","топ","тор","торс","треп","тромп","троп","трос"],"директива":["ад","акт","актер","актив","ваер","вар","веда","век","вера","вердикт","верк","ветка","вид","вира","враки","вред","дар","дверка","дева","девка","дек","дека","дериват","детва","дети","детка","диета","дрек","еда","ерик","ива","иврит","ик","икра","кадет","кадр","каре","карт","катер","квирит","кедр","кета","кивер","киви","кит","кредит","рак","ре","реактив","рев","река","тавр","твид","терка","тик","тир","тире","трак","трек"],"одалиска":["ад","ас","даос","диск","до","док","дока","дол","доска","идол","ик","ил","иод","иск","кадило","кал","кила","кило","клад","коала","код","кода","кодла","кол","коса","лад","ладо","лак","лаоска","ласа","ласка","лик","лис","лиса","лиска","лодка","лоск","ода","оклад","оксид","оса","осада","осадка","осадки","осака","оскал","ослик","сад","садик","садилка","садок","сак","салки","сало","си","сикл","сила","силок","скала","скало","склад","скол","сода","сок","солка"],"чертежница":["ант","ариец","арчинец","еж","жанр","жар","жарение","жена","жир","жнец","жница","жрец","жрица","иранец","наречие","начет","раж","ранет","ранец","рант","ратин","ре","ренет","рента","ретина","ржание","таец","танец","теин","тени","терн","терц","терцина","тина","тир","тираж","тиран","тире","трение","цеж","цена","цент","центр","циан","цитра","чан","чернец","черт","черта","чертеж","чета","чиж","чин","чина","чинар","чир","чтение","чтец","чтица"],"минорность":["ион","ирмос","ми","минор","мир","мирность","мирт","монист","монисто","монитор","монстр","мор","морось","морс","мост","мотор","нить","нос","ор","осмотр","осот","ость","ось","относ","рис","ритм","ром","рост","рот","си","синь","синьор","сито","ситро","смотр","сом","сон","сонм","сор","сорит","сорт","стон","тир","тис","тмин","том","тон","тор","торос","торс","трином","трио","трон","трос"],"барашкин":["абак","ара","араб","арак","арба","арка","аркан","арника","аршин","бак","банк","банка","банкир","бар","барак","баран","барашки","барин","барк","барка","баркан","баркин","башка","бирка","бра","брак","ик","икра","иранка","ишак","кабан","кабина","кара","карабин","кариб","каша","краб","кран","наиб","накра","ниша","раб","раба","рак","ракша","рана","ранка","рикша","шанкр","шар","шарик","ши","шик","шина"],"обмуровка":["амур","бак","бар","барк","боа","бок","бор","бора","боров","бра","брак","бровка","бром","бук","бука","буква","бур","бура","бурав","бурак","бурка","бурова","вар","вор","вруб","врубок","кворум","кобра","кобура","ком","кома","комар","кора","корм","корма","короб","корова","краб","кров","куб","кум","кума","курва","мавр","мак","мор","морок","морока","мрак","муар","мука","мура","обком","обкорм","оборка","оброк","обувка","око","окова","омар","ор","орк","орок","раб","рак","роба","ров","рок","ром","ромб","рубка","рука","рукав","румб","румба","убор","уборка","увар","укор","ум","умбра","умора","урок"],"чепрачник":["анкер","ерик","ик","икра","капер","каре","карп","кепи","керн","кипа","кран","крап","крен","креп","нерка","нерпа","паек","пак","пан","панер","паникер","панк","пар","пари","парик","парк","парник","пекан","пена","пенка","перина","перка","пернач","перчик","печка","печник","пиар","пик","пика","пикан","пике","пина","пинчер","пир","рак","ре","река","репа","репина","репка","речка","речник","чаек","чан","чек","чека","чепан","чепчик","черника","черпак","чин","чина","чинар","чинка","чип","чир","чича"],"сорокопут":["копт","корпус","корт","кот","крот","круп","купорос","курс","куст","око","окоп","окот","опор","опорок","опорос","опрос","опт","опус","ор","орк","орок","осот","откос","откуп","откус","отоскоп","отпор","отпуск","отрок","покос","порок","порт","пост","пот","поток","прок","прокос","прокус","просо","проток","прус","прут","пук","пуск","рок","рокот","ропот","рост","росток","рот","руст","скоп","скот","скуп","сок","сор","сорт","спор","спорок","спорт","спрут","спурт","срок","сток","стопор","строп","струп","стук","ступор","сук","суп","сурок","ток","топ","топор","тор","торос","торс","трок","троп","трос","труп","трус","тур","турок","укор","укос","укроп","упор","урок","ус","уток","утор","утро"],"косметолог":["глот","глоток","го","гол","голос","голосок","кег","клест","кол","колесо","колет","колос","ком","космолог","костел","кот","котел","лес","лесок","лет","лето","леток","лог","лом","лоск","лот","лото","лоток","лотос","мел","мелок","мелос","место","метол","могол","мол","молоко","молот","молоток","мосол","мост","мосток","моток","око","окоем","окот","омег","омет","омлет","осек","осел","оселок","осмол","осот","остеолог","отек","отел","откол","откос","отлог","отсек","село","сет","скол","скот","слет","слог","слом","слот","смог","сок","соло","сом","стек","стекло","стог","сток","стол","тело","телок","теолог","тес","тесло","ток","толк","том"],"разнолесье":["анзор","ас","ель","ересь","ерь","зал","залесье","занос","заросль","заслон","засол","зелень","зелье","зерно","зеро","зло","зола","золь","зона","лазер","лань","лар","ларь","леер","лен","лень","лес","леса","лоза","лось","ноль","нос","носарь","оаз","олень","ор","орел","орлан","оса","осел","осень","ось","разнос","рань","ре","резон","резь","реле","рельс","роза","розанель","рознь","рол","роль","роса","саз","сало","салон","сан","сезень","сезон","селен","село","сель","сено","сень","сеньор","сеньора","сера","сераль","серна","слеза","слон","соль","сон","сор","срез"],"жеманность":["анемон","анонс","ант","ас","атом","еж","енот","жена","жест","жесть","жетон","жмот","манеж","манжет","мант","манто","масон","масть","мат","мать","межа","мена","мент","место","месть","мета","метан","монета","монтаж","мост","мосье","мсье","наем","намет","нанос","наст","натес","нежность","немота","неон","нож","нома","нона","нонет","нос","нота","омет","оса","осень","осман","ость","ось","отмена","сажень","сан","сема","семь","сенат","сено","сень","сет","сеть","смена","смета","сом","сома","сон","сонант","сонет","сонм","сота","стаж","стан","стена","стон","тема","темь","тень","тес","тесьма","том","томан","тон","тонна","тоннаж","тьма"],"бережность":["бентос","берест","берет","бес","бестер","бетон","боже","бон","бор","борт","борть","бот","брест","бронь","еж","енот","ересь","ерь","жеребость","жест","жестер","жесть","жетон","жор","жостер","небо","нерест","нож","нос","обет","ор","осень","осетр","ость","ось","отребье","ре","ренет","рожь","рост","рот","сбор","сено","сень","сеньор","серб","сет","сеть","сноб","сон","сонет","сор","сорт","сотерн","стержень","стернь","стон","стрежень","тенор","тень","терн","тес","тон","тор","торс","трон","трос"],"поддирание":["ад","аденоид","анероид","дан","дар","дед","дедина","депо","дерн","динар","диод","днепр","дно","до","дорн","драп","дрена","еда","иод","ион","ирод","надир","напор","нард","народ","недра","нерпа","норд","ода","одр","одрина","опера","ор","орда","орден","пан","панер","пар","пардон","пари","пена","перина","период","перо","пиар","пина","пион","пионер","пир","поддир","подина","пони","пора","прадед","придание","приданое","радио","радон","ре","редан","репа","репина","род","родина"],"сенсуалист":["аист","алеут","алунит","анис","ант","анус","ас","аул","аут","есаул","ил","инула","лен","лента","лес","леса","лесина","лесс","лет","летун","линт","лис","лиса","лист","луна","лунит","налет","насест","наст","настил","натес","нут","сан","сани","сатин","сеанс","селин","сенат","сени","сет","си","сиеста","сила","силен","синус","сласти","слет","стан","станс","стела","стена","стул","суета","султан","талес","теин","тени","тес","тесина","тина","тис","тиун","тлен","туес","тулес","тун","туна","улан","улит","униат","ус","уста","утес"],"яхтсменка":["акт","ант","ас","аскет","камея","кант","кета","кнехт","мак","макет","мант","мат","мах","маяк","мена","мент","мета","метан","метка","мех","меха","мята","наем","намек","намет","наст","натек","натес","немка","саек","сак","саке","сан","секта","сема","семя","семянка","сенат","сет","сетка","скат","скена","смак","смена","смета","смех","стан","стая","стек","стека","стена","стенка","схема","танк","тема","темя","тес","тесак","теска","техас","хам","хан","хек","хна","як","яма","яс","яхта","яхтсмен"],"котировка":["автор","акт","актив","вар","вира","виток","вор","ворот","ворота","враки","втора","ива","ик","икота","икра","каик","карт","каток","кварк","квота","кивок","кика","киото","кирка","кирова","кит","ковка","коврик","кок","кока","кокор","кора","корка","корова","коровка","корт","кортик","кот","котик","краков","крик","кроат","кров","крот","око","окова","оковка","окорка","окот","окрик","ор","орк","орок","отвар","отковка","отрок","рак","рвота","ров","ровик","рок","рокот","рот","рота","ротик","тавр","тавро","тако","тик","тир","товар","ток","токовик","тор","трак","трико","трио","трок"],"малословие":["ас","вал","вес","весло","вилла","виола","вис","влас","вол","волос","ива","ил","ислам","лев","лес","леса","лис","лиса","ловелас","лом","маис","малов","масло","мел","мелос","месиво","ми","мол","молва","мосол","овал","овес","олива","омела","оса","осел","осмол","сало","самоволие","самолов","сев","село","сема","си","сила","символ","слалом","слив","слива","слово","слом","смола","сова","соло","солома","сом","сома"],"двусемянка":["ад","анус","ас","веда","ведун","век","вена","веня","вес","весна","вкус","внук","дан","дева","девка","дек","дека","декан","десна","дума","думка","еда","камея","квас","куда","кум","кума","кун","куна","мак","маяк","мед","медяк","мена","мука","навес","надкус","надув","наем","намек","немка","неявка","сад","саек","сак","саке","сан","сван","свая","сев","секунда","сема","семя","семянка","скена","смак","смена","суд","судак","сук","сука","сума","сумка","удав","ум","ус","явка","яд","як","яма","янус","яс"],"спекулянт":["клен","клест","клуня","кляп","кнут","кун","купе","куплет","купля","куст","лен","лес","лет","летун","лея","лук","ля","ляп","нут","пенс","пеня","пес","песня","пест","петля","плен","плес","плеск","плут","пляс","плясун","пук","пул","пуля","пункт","пуск","пустяк","сет","скепт","склеп","скуп","слепун","слет","сплетня","стек","степ","степняк","стук","стул","ступня","сук","суп","тес","тлен","тля","туес","тулес","тун","туя","уклея","упек","ус","утес","як","якут","ял","янус","яс"],"растушка":["акт","актау","ара","арак","арка","ас","астра","аура","аут","кара","карат","карст","карт","карта","картуш","каста","каша","краса","курс","курта","куст","кутас","куш","рак","ракуша","ракша","раса","раскат","ратуша","раус","раут","рука","русак","руст","рута","сак","сакура","скат","скаут","старка","старушка","стук","сук","сука","сура","суша","сушка","такса","тара","трак","трус","тур","тура","турка","туш","туша","тушка","ус","уста","утка","ушат","шар","шкура","штука","шуст","шут","шутка"],"сексология":["го","гол","голик","голос","иго","ик","ил","иск","кег","кегли","кегля","кило","кисея","кол","колесо","колея","колос","колосс","лес","лесок","лесс","лея","лик","лис","лог","логик","лоск","ля","окисел","око","осек","осел","оселок","осилок","ослик","осляк","осос","секс","сексолог","село","си","сиг","сикл","силок","силос","скол","слог","сок","солея","соло","сосок","соя","як","ял","ялик","яс","ясли"],"барахтание":["ант","ара","араб","арба","арбат","арена","бант","бар","баран","барин","барит","бархан","бархат","бахта","бета","бинт","бит","бита","бра","брат","братан","братание","братина","ибер","набат","наиб","нарта","раб","раба","рана","ранет","рант","ратин","рахит","ре","рента","ретина","тара","таран","тархан","теин","тени","терн","тиара","тина","тир","тиран","тире","треба","триба","хабанера","хабар","хан","харбин","хата","хит","хна","хрен"],"паромщик":["ампир","ик","икра","капор","карп","кипа","ком","кома","комар","коми","копир","кора","корм","корма","крап","мак","маки","ми","мир","мор","моща","мрак","омар","опак","ор","орк","ощипка","пак","памир","пар","пари","парик","парк","парок","паром","пиар","пик","пика","пим","пир","пища","поимка","пора","порка","пращ","прима","примак","прок","рак","рамщик","рок","ром","ропак","роща","щи","щипок"],"круповейка":["ваер","вар","век","веко","вера","верк","вой","вор","капер","капок","капор","каре","карп","каупер","квакер","кварк","кепка","ковер","ковка","койка","кок","кока","копейка","кора","корейка","корка","край","краков","крап","креп","кров","крой","кройка","круп","крупа","купа","купе","курва","курево","курок","опак","опека","опера","ор","орк","паек","пай","пак","пар","парк","парок","паук","перка","перо","повар","поверка","покер","пора","порей","порка","порука","право","прок","пук","пурка","рай","рак","ре","рев","рей","рейка","река","репа","репка","ров","рой","рок","ропак","рука","рукав","увар","укор","укроп","упек","упор","упрек","урок"],"сковородка":["ад","аккорд","ас","вар","вода","водка","вор","ворс","воск","даос","дар","двор","до","док","дока","доска","дрова","дрок","кадр","кварк","квас","ковка","код","кода","кок","кока","кокор","кокос","кокс","кора","корд","корда","корка","корова","коровка","корсак","коса","косок","краков","кров","овод","ода","одр","око","окова","оковка","окорка","окорок","окрас","ор","орда","орк","орок","оса","осадок","оскар","осока","рак","ров","род","родос","рок","рококо","роса","сад","садок","сак","сард","свод","сводка","свора","скак","сковка","сковорода","скок","сова","совка","совок","сода","сок","соковар","сор","сорока","срок"],"недоросль":["дело","день","дерн","дно","до","дол","долонь","донор","донос","дорн","досол","досье","дрель","ель","ерь","лед","лен","лень","лес","лоно","лорд","лось","лосьон","недосол","ноль","норд","нос","одр","олень","ор","орден","орел","ореол","осел","осень","осоед","ось","ре","рельс","род","родео","родос","рол","роль","рондо","седло","село","сель","сено","сень","сеньор","след","слон","снедь","соло","солод","солодь","соль","сон","сор"],"спартанец":["анапест","ант","ара","арап","арена","арест","ас","астра","нарта","наст","натес","нерпа","пан","панер","пантера","пар","пара","парта","пас","паста","пат","патан","патер","патера","пацан","пена","пенс","перст","пес","пест","рана","ранет","ранец","рант","рапа","рапс","раса","ре","рента","репа","репс","сан","сап","сапа","сапер","сатрап","сенат","сера","серна","серп","сет","спарта","стан","старец","стена","степ","страна","сцена","сцеп","таец","танец","тапер","тара","таран","терн","терц","тес","транс","трап","треп","трепан","цена","цент","центр","цеп"],"котельная":["акт","альт","ант","елка","ель","енот","кал","кальян","кант","кельн","кельт","келья","кета","клан","клен","клеть","клон","кол","колена","колет","колея","колье","кольт","кон","конь","кот","котел","кьят","лак","лань","лен","лента","лень","лет","лето","леток","лея","лот","ля","налет","натек","ноль","нота","нотка","океан","олень","отек","отел","отель","тако","талон","тальк","танк","телка","тело","телок","тень","ткань","тканье","тлен","тля","ток","толк","толь","тон","тоня","як","ял","ять"],"псалтирь":["аист","альт","ас","ил","лапти","лар","ларь","липа","лис","лиса","лист","литр","пар","пари","пас","пасть","пат","пиар","пиастр","пила","пир","пират","пирс","писарь","плис","плита","псарь","рапс","распил","рать","рис","сап","сатир","си","сиаль","сила","силь","ситар","слип","спил","спираль","спирт","сталь","стиль","тапир","тип","тир","тис","трал","трап","трип"],"сценограф":["агнец","арго","аргон","ас","гаер","ганец","гарнец","гарсон","ген","герц","го","гон","гонец","гора","горе","горец","горн","гофр","гофре","гран","граф","грена","нега","негр","неф","нога","ногаец","нос","онагр","ор","орган","оса","ранг","ранец","ре","рог","роса","саго","сан","сгон","сено","сера","серна","снег","сон","сор","софа","сфера","сцена","фа","фанг","фарс","фасон","фен","фес","фон","фора","форс","фосген","фреон","цена"],"старолесье":["алость","альт","арест","артель","артос","ас","ателье","ель","ересь","ерь","лар","ларь","лассо","леер","лес","леса","лесс","лесть","лет","лето","лось","лот","ор","орел","оса","осел","осетр","ость","ось","отел","отель","отрасль","рассол","рать","ре","реле","рельс","рол","роль","роса","рост","рот","рота","сало","сальто","село","сель","сера","сераль","серость","сестра","сет","сеть","сласть","слесарь","слет","слот","соль","сор","сорт","сота","ссора","сталь","старье","стела","стол","стрела","талер","талес","тело","тес","тесло","толь","тор","торс","трал","трасс","трель","трос"],"цитрусовод":["вид","вирус","вис","вор","ворот","ворс","двор","диво","до","дуст","иод","ирод","истод","овод","одр","ор","осот","остов","остров","отвод","рис","рисовод","ров","род","родос","родство","рост","рот","руст","свод","си","сидр","сито","ситро","сор","сорит","сорт","створ","суд","твид","тир","тис","тор","торос","торс","трио","триод","трос","труд","трус","тур","увод","урод","уродство","ус","утор","утро","цитрус"],"конферанс":["аксон","анкер","анонс","ас","аскер","канон","каре","кафе","кенаф","керн","кон","кора","коран","коса","кофе","кофр","кран","крен","крона","ксенон","нанос","ненка","неон","нерка","неф","нона","норка","нос","океан","окрас","ор","орк","оркан","оса","осек","оскар","рак","ре","река","ренонс","рок","роса","саек","саенко","сак","саке","сан","сено","сера","серко","серна","сканер","скарн","скена","сок","сон","сор","софа","срок","сфера","фа","факс","фанк","фарс","фасон","фен","фес","феска","фон","фора","форс","фрак","франк","фреон","фреска"],"винтокрыл":["виконт","вилок","вилы","вино","винт","виток","воин","вол","волк","вор","вторник","выкол","ик","икры","ил","илот","инок","ион","кило","кино","кит","клир","клон","ковы","кол","колит","кон","контры","корт","кот","кров","крот","крыло","ливр","ливы","лик","ликтор","линкор","линт","литр","лори","лот","лыко","нилот","новик","нолик","нырок","овин","ор","орк","отлив","отрыв","ров","ровик","рок","рол","ролик","рот","ротик","рывок","рык","рыло","рынок","твин","тик","тир","ток","толк","толки","тон","тоник","тор","трико","трио","трок","трон","тыл","тыловик","тын"],"смородина":["ад","анис","ас","дан","даос","дар","динамо","динар","дно","до","дом","домино","домна","домра","донор","донос","дорн","иод","ион","ирмос","ирод","маис","манси","марс","масон","ми","мина","минор","мир","мода","мор","морда","морс","надир","нард","народ","нома","номад","норд","норма","нос","ода","одр","одрина","омар","ор","орда","оса","осина","осман","радио","радон","рамс","рис","род","родина","родос","ром","роман","романс","рондо","роса","сад","сан","сани","сард","си","сидр","синдром","синод","смирна","смрад","сода","сом","сома","сон","сонм","сор","срам"],"завалинка":["аванзал","азан","анализ","анклав","ваза","вал","вализа","валик","виза","вилка","вина","завал","завалина","завалка","заика","зал","зала","залив","заливка","злак","злаки","знак","ива","ик","ил","казна","кал","калан","калин","калина","канава","канал","канва","кила","кинза","клан","лава","лавина","лавка","лазка","лак","ланка","лиана","лик","линза","навал","навалка","наказ","накал","налив","наливка","нива","низ","низка"],"пористость":["иссоп","опись","опор","опрос","опт","ор","осос","осот","остит","ость","ось","отит","отпор","отсос","пир","пирс","порт","пост","пот","потир","присос","просо","просос","рис","ропот","роспись","рост","рот","си","сироп","сирость","систр","сито","ситро","сор","сорит","сорос","сорт","спирт","спор","спорт","спрос","стопор","стрит","строп","тип","тир","тис","титр","топ","топор","топот","топь","тор","торит","торос","торс","торт","тост","трио","трип","троп","тропот","трос","трость","трот"],"скарбничий":["абрис","анис","ас","бай","бак","банк","банкир","бар","барий","барин","барк","баркин","барс","бас","баск","баски","басни","бикс","бирка","бич","бра","брак","брас","бричка","бричкин","ибис","ик","икра","инки","ирбис","ирис","иск","искра","кариб","кий","краб","край","кран","наиб","раб","рай","рак","рис","риск","риска","саиб","сак","сан","сани","санки","си","синай","синичка","сирийка","скарб","скарн","чай","чайник","чан","час","часик","чибис","чий","чин","чина","чинар","чинка","чир"],"монополист":["ил","илот","ион","лимон","линт","лис","лист","лом","ломонос","лоно","лот","лото","лотос","ми","мол","молот","монист","монисто","монолит","мопс","мосол","мост","нилот","нос","олимп","оплот","опт","осмол","осот","остолоп","относ","пилон","пилот","пим","пион","пистон","питон","плис","плот","пол","полином","полис","поло","полон","полотно","помин","помои","помол","помост","пони","понос","понт","посол","пост","пот","си","силон","сито","слип","слом","слон","слот","сноп","соло","соломит","сом","сон","сонм","сопли","сопло","спил","сплин","стол","столон","столп","стон","тимол","тип","тис","тмин","том","томпсон","тон","топ","топоним"],"пальметка":["акт","альма","альт","аптека","елка","ель","кал","капа","капель","каталь","кельт","кета","клеть","лак","лама","лампа","лапа","лапка","лапта","лата","лепка","лепта","лет","мак","макаль","макет","мала","малек","мат","матка","мать","мел","мель","мета","метка","метла","паек","пак","пакет","пакт","палетка","палка","пальма","пат","плакат","плата","платье","плетка","плеть","тальк","тальма","тапка","телка","тема","темп","темь","тьма"],"народник":["ад","андрон","анион","дан","дар","динар","дно","до","док","дока","донна","донник","дорн","дракон","дрок","ик","икона","икра","инок","иод","ион","ирод","кадр","канон","канонир","кино","код","кода","кон","конина","кора","коран","корд","корда","кран","крона","надир","наин","нард","народ","нона","норд","норка","норник","ода","одр","одрина","ор","орда","орк","оркан","радио","радон","рак","род","родина","родинка","родник","рок"],"головчинер":["венгр","вено","виг","вино","воин","вол","вор","ворон","ген","героин","гирло","гнев","го","говно","говор","гол","гон","гонор","горе","горин","горло","горн","горнило","гринев","иго","ил","ион","лев","легион","лен","ленч","ливер","ливр","лич","лог","лоно","лори","невролог","негр","нерв","нигрол","норов","ночлег","овен","овин","огниво","олегович","олеин","ор","орел","ореол","ороч","ре","рев","регион","ринг","ров","рог","рол","челн","чело","чин","чир","член","чрево"],"патерик":["акт","актер","ерик","ик","икра","капер","каре","карп","карт","катер","кепи","кета","кипа","кит","крап","креп","крипта","паек","пак","пакет","пакт","пар","пари","парик","парк","паркет","пат","патер","перка","пиар","пик","пика","пике","пикет","пир","пират","питер","рак","ре","река","репа","репка","тапер","тапир","тапки","терка","тик","тип","тир","тире","трак","трап","трек","треп","трепак","трепка","трип"],"гончаренко":["анкер","арго","аргон","гаер","ген","го","гон","гонка","гонор","гончак","гончар","гора","горе","горка","горн","горчак","гран","грач","грек","грена","греча","гречка","кагор","канон","каре","кег","керн","кон","конго","кора","коран","корона","корча","кочан","кочегар","кочерга","кран","крен","крона","нагон","нега","негр","ненка","неон","нерка","нога","нона","норка","ночка","огарок","огонек","океан","окно","око","онагр","ор","орган","орк","оркан","орок","ороч","очаг","очерк","очко","рак","ранг","ре","река","речка","речонка","рог","рогач","рок","чаек","чан","чек","чека"],"англомания":["агамия","агония","аналог","аналогия","ангина","ангиома","англия","англоман","анион","аномалия","аноним","гаолян","гимн","глина","гном","гнома","го","гол","гон","игла","иго","ил","имя","ион","лаг","лама","лиана","лига","лиман","лимон","лог","лом","ломаная","ля","маг","магия","магнолия","мала","малина","мана","мангал","манго","мания","манна","мгла","ми","миг","милан","миля","мина","минога","могила","мол","молния","молян","мяло","наган","нагон","наин","налим","налог","намин","намол","нога","нома","номинал","нона","ял","яма"],"субботник":["бикс","бинт","бит","биток","боб","бобик","бок","бокс","боксит","бон","бот","ботик","бубон","бук","букс","бунт","бут","бутик","бутон","ик","инок","ион","иск","исток","кино","кит","кнут","кон","конус","кости","кот","куб","кубист","кун","куст","нос","носик","нут","оникс","откус","си","сито","скот","сноб","сок","сон","сотник","сток","стон","стук","сук","сукно","сутки","тик","тис","тиун","ток","токсин","тон","тоник","тонус","тун","укос","ус","усик","уток"],"святочник":["виконт","вино","винт","вис","висок","виток","воин","воск","вотяки","вятич","ивняк","ик","инок","ион","иск","исток","кино","кит","кон","кости","кот","новик","нос","носик","овин","оникс","остяк","остяки","очки","очник","свиток","свояк","святки","си","синяк","сито","скот","скотч","совик","сок","сон","соня","сотник","сотня","соя","сток","стон","стояк","твин","тик","тис","ток","токсин","тон","тоник","тоня","чин","чистяк","чтиво","яичко","як","янки","яс","яство"],"гипнотизер":["ген","генотип","героин","гиперон","гипноз","гит","гнет","го","гон","гонт","горе","горин","горн","грот","енот","зенит","зерно","зеро","зет","зонт","иго","ион","иприт","итог","негр","низ","опитие","опт","ор","отрез","перо","петин","пион","пионер","пир","пирит","пирог","питер","питон","позер","понг","пони","понт","понтер","порез","порт","пот","потир","пригон","приз","притон","протез","протеин","ре","регион","резон","ринг","ринит","рог","рот","теин","тени","тенор","терн","тигр","тип","тир","тире","тон","топ","тор","торг","торги","треп","трио","трип","трог","трон","троп"],"навертка":["авар","акант","акт","актер","анвар","анкер","анкета","ант","ара","арак","арека","арена","арка","аркан","ваер","ванта","вар","варан","варка","варнак","вата","ватка","век","вена","вера","верк","ветка","врата","каверна","канат","канва","кант","кара","карат","карате","каре","карета","карт","карта","катер","катерна","катрен","квант","кентавр","керн","кета","кран","крен","навар","навет","накат","накра","нарва","нарта","натек","нектар","нерв","нерка","нрав","рак","ракета","рана","ранет","ранетка","ранка","рант","ре","рев","река","рента","таверна","тавр","танк","танкер","тара","таран","терка","терн","трава","травка","трак","трек"],"рамочник":["ик","икона","икра","инок","ион","камин","кармин","кино","ком","кома","комар","коми","кон","кора","коран","корм","корма","корча","корчи","корчма","кочан","кран","крона","мак","маки","маниок","манок","ми","микрон","мина","минор","минорка","мир","мор","моча","мочка","мрак","нарком","нома","норка","норма","ночка","омар","ор","орк","оркан","очинка","очки","очник","рак","рок","ром","роман","чан","чин","чина","чинар","чинка","чир","чирок"],"богаделка":["абак","ад","бак","бал","балда","балка","балок","бег","бега","беда","бедолага","бек","бел","белка","белок","благо","блок","блокада","боа","бог","боек","бок","бокал","бола","гад","галка","го","год","гол","даба","дек","дека","дело","до","дог","док","дока","дол","долг","еда","едок","елка","кагал","кал","кеб","кег","клад","коала","код","кода","кодла","кол","колба","лаг","лад","ладо","ладога","лак","лед","ледок","лоб","лог","лодка","обдел","обделка","обед","обклад","ода","оклад"],"проявление":["веер","вено","веня","веяние","вино","воин","вол","воля","вор","вяление","евреи","ил","ион","лев","леер","лен","лея","ливер","ливр","ливрея","лори","ля","ляп","неволя","нерв","нория","овен","овин","олеин","ор","орел","пелевин","пение","пеня","перелив","перелов","перл","перлон","перо","пиво","пилон","пион","пионер","пир","плеер","плен","плов","поение","пол","поле","полив","поля","пони","появление","прение","прения","прилов","пролив","пяление","рвение","ре","рев","реле","рея","реяние","ров","роевня","роение","рол","явление","явор","ял","яр"],"лисоферма":["ас","ил","ирмос","ислам","лар","лес","леса","лимфа","лис","лиса","лиф","лом","лори","маис","марс","масло","мел","мелос","мера","ми","мир","миф","мол","мор","море","морс","морф","олифа","омар","омела","ор","орел","оса","осел","офис","рамс","ре","рема","рис","риф","рифма","рол","ром","роса","сало","сафлор","село","селфи","сема","семафор","сера","сериал","си","сила","силомер","слом","смола","сом","сома","сор","софа","срам","сфера","фа","фал","фарс","ферма","фес","фиал","фила","филе","филер","фирма","флер","флора","фол","фора","форма","форс"],"эпидиаскоп":["ад","ас","аспид","даос","диаскоп","диск","до","док","дока","доска","ик","иод","иск","кипа","код","кода","коса","ода","оксид","опак","описка","оса","осадки","оспа","пак","пас","паск","пик","пика","пикап","пики","пипка","писк","подписка","подсак","поиск","поп","попка","посад","сад","садик","садок","сак","сап","си","скип","скоп","скопа","сода","сок","сопа","сопка","спад","эпика","эпископ","эпос"],"безрогость":["бег","бес","бог","бор","боргес","борт","борть","бот","брест","герб","го","горб","горе","горесть","горсть","гость","гроб","грот","ерь","зеро","зет","зоб","обет","обзор","обоз","обрез","озеро","ор","осетр","особь","осот","острог","ость","ось","отбор","отброс","отрез","отрог","ре","резь","робость","робот","рог","рогоз","рост","рот","сбег","сбор","серб","сет","сеть","собор","сор","сорт","срез","стог","тес","тор","торг","торос","торс","трог","трос"],"ворократия":["автор","акт","актив","ария","вар","вира","виток","вор","ворот","ворота","вотяки","вояка","враки","втора","вятка","ива","ик","икота","икра","карт","квота","киото","кирова","кит","кора","корова","корт","кот","кроат","кров","крот","око","окова","окот","ор","оратор","оратория","орк","орок","отвар","отрок","рак","ракия","рвота","ритор","ров","ровик","рок","рокот","рот","рота","ротик","ротор","тавр","тавро","тако","тик","тир","товар","ток","тор","трак","трико","трио","трок","трояк","явка","явор","як","яр","ярка","ярок"],"ламентация":["алтаец","анемия","ант","ил","имя","лама","ламаит","ланита","ланцет","лата","латания","латинец","лаяние","лен","лента","ленца","лет","лея","лиана","лиман","линт","ля","мала","малаец","малец","малина","малица","мана","мания","мант","мантия","мат","матица","маца","мел","мена","мент","меняла","мета","метан","метил","метла","метлица","ми","милан","миля","мина","мята","наем","налет","налим","намет","нация","таец","талия","танец","таяние","теин","тема","темница","темя","тени","тина","тлен","тля","тмин","целина","цена","цент","циан","ял","яма"],"табакерка":["абак","абрек","акт","актер","ара","араб","арабка","арак","арба","арбат","арека","арка","атака","бак","бар","барак","баретка","барк","барка","батрак","бек","бекар","бета","бра","брак","брат","кабак","кабаре","кара","карат","карате","каре","карета","карт","карта","катер","кеб","кета","краб","раб","раба","рак","ракета","ракетка","ре","река","табак","тара","терка","трак","треба","трек"],"стягивание":["авгит","агент","аист","анис","ант","ас","астения","вагин","васин","ватин","ваяние","вега","вена","веня","вес","весна","вест","виг","вина","винт","вис","витание","вития","гаитяне","ген","гиви","гиена","гинея","гит","гитан","гнев","гнет","ива","иваси","истина","навес","навет","навис","наитие","наст","натес","натяг","нега","негатив","нива","сан","сани","сатин","сван","сват","свая","свет","свита","свияга","сев","сенат","сени","сет","си","сиг","сиенит","синева","сити","сияние","снег","снятие","ставня","стан","стая","стена","стяг","таяние","твин","теин","тени","тес","тесина","тина","тис","тяга","яс","яства"],"отряхание":["ант","ария","архонт","атония","ахинея","енот","ион","неряха","нория","нота","ор","орех","охание","охра","ранет","рант","ратин","рахит","ре","рента","ретина","рея","рот","рота","таяние","теин","тени","тенор","теория","терн","тина","тир","тиран","тире","тихоня","тон","тоня","тор","тохар","трахея","трио","трон","хан","хартия","харя","хит","хитон","хна","хон","хор","хорея","хорт","хота","хрен","хрия","яр","яхонт","яхта"],"шпажистка":["аист","акт","ас","жатка","ик","иск","ишак","капа","каптаж","каста","каша","кипа","киста","кит","паж","пак","пакт","пас","паск","паста","пат","паша","пик","пика","пикша","писк","пташка","пшат","пшик","сажа","сак","сап","сапа","сапка","си","скат","скип","стаж","такса","такси","тапка","тапки","тик","тип","типаж","тис","шапка","ши","шик","шип","шпажист","шпат","шпик","штапик"],"замухрышка":["азу","азур","амур","амуры","ара","арак","арка","арык","аура","ашрам","замах","замша","казах","казуар","камаз","камыш","кара","карма","каша","крах","крыша","кум","кума","куш","мазар","мазурка","мак","мара","марка","марш","мах","махра","мрак","муар","муза","музыка","мука","мура","мураш","мурашка","мурза","муха","мушка","мыза","мышка","размах","разум","рак","ракуша","ракша","рама","рамка","рука","рык","рым","указ","ум","ураза","уха","хазар","хазары","хам","хамка","храм","хук","хурма","шар","шарм","шах","шкура","шрам","шум"],"смерзание":["анис","ас","заем","замер","замес","зима","зрение","измена","мазер","маис","манер","манси","марс","мена","мера","мерин","ми","мизер","мина","минер","мир","мирза","наем","низ","размен","рамс","расизм","ре","резание","резина","рема","ремез","ремиз","риза","рис","саз","сан","сани","сезам","сема","семена","семинар","сени","сера","серизна","серна","си","сирен","сирена","смена","смирна","срам","срез","срезание"],"лопаточка":["акт","кал","капа","капот","кача","клоп","коала","кол","копал","копт","кот","лак","лапа","лапка","лапочка","лапта","лата","лачка","лопата","лопатка","лот","лото","лоток","око","окоп","окот","опак","опал","опала","опалка","оплата","оплот","опт","откол","отпал","отпалка","очко","пак","пакт","палач","палка","палочка","паоло","пат","патока","пачка","плакат","плата","плато","платок","плач","плот","пол","пола","полк","полка","поло","полок","полочка","полчок","пот","потачка","поток","початок","почка","почта","тако","тапка","тапочка","тачка","ткач","ток","толк","толкач","толпа","толчок","топ","топка","точка","чал","чалка"],"каббалист":["абак","аббат","аист","акт","ас","атлас","баба","бабка","бабки","бак","бал","балка","балтика","бас","баск","баска","баски","бикс","бит","бита","блат","блик","ик","ил","иск","кабалист","кабил","кал","каста","кила","киста","кит","лак","ласа","ласка","ласта","ластик","лата","лик","лис","лиса","лиска","лист","литка","саба","саиб","сак","салат","салатик","салки","си","сикл","сила","скала","скат","слабак","стилка","табак","такса","такси","талиб","талик","тик","тис"],"ложбинка":["бак","бал","балкон","балок","банк","било","бланк","блик","блин","блок","боа","бок","бокал","бола","бон","бона","жабник","жабо","жало","жбан","жила","жилка","жинка","жлоб","ик","икона","ил","инок","ион","кабил","кал","калин","каолин","кила","кило","кинжал","кино","клан","клон","кожа","кол","колба","кон","лаж","лак","лик","лоб","лобан","лобик","ложа","ложбина","ложка","ложки","лонжа","наиб","нож","ножик","ножка","нолик","обжин","обжинка","облик"],"ущербность":["бентос","бес","бетон","бон","бор","борт","борть","борщ","бот","брест","бронь","брус","буер","бунт","бур","бурт","бустер","бут","бутон","енот","ерь","небо","нос","нут","нутро","обет","ор","осень","осетр","ость","ось","ре","ребус","рост","рот","руст","русь","сбор","сено","сень","сеньор","серб","сет","сеть","сноб","сон","сонет","сор","сорт","сотерн","сруб","стернь","стон","суборь","суть","тенор","тень","терн","тес","тон","тонус","тор","торс","трон","трос","трус","туер","туес","тун","тур","турне","убор","унтер","урон","ус","устье","утес","утор","утро","ущерб","щорс","щур"],"пересадка":["ад","адрес","ара","арак","арап","арека","арка","ас","аскер","дар","дек","дека","драка","драп","дрек","еда","кадр","капа","капер","каперс","кара","карда","каре","карп","кедр","крап","краса","креп","паек","пак","пар","пара","парад","парк","парсек","пас","пасека","паск","перед","перка","пес","рада","рак","рапа","рапс","раса","распад","ре","река","репа","репка","репс","сад","саек","саепек","сак","саке","сап","сапа","сапер","сапка","сард","сера","середа","середка","серп","скерда","скрап","скрепа","спад","спардек","среда"],"забавность":["абаз","аванс","азан","азот","ант","аозт","ас","база","бант","бас","басон","батон","боа","бон","бона","бонза","бот","ботва","ваза","вазон","ванта","вата","взнос","воз","вона","вонь","забота","занос","засов","затон","звон","знать","зоб","зов","зона","зонт","набат","навоз","навь","наст","новь","нос","нота","оаз","оса","ость","ось","отава","сааз","саба","сабан","сабза","сабо","саван","саз","сазан","сан","санбат","сван","сват","своз","сноб","сова","сон","соната","сота","стан","стон","таз","тон"],"полемист":["ил","илот","лес","лет","лето","лис","лист","лом","лот","мел","мелос","место","метил","метол","ми","мол","мопс","мост","олимп","омет","омлет","опт","осел","отел","пес","песо","пест","пилот","пим","плес","плис","плот","поем","пол","поле","полет","полис","политес","помет","пост","пот","село","семит","сет","си","сито","слет","слип","слом","слот","сом","сопли","спил","степ","стол","столп","тело","темп","тепло","тес","тесло","тимол","тип","тис","том","топ"],"оплавление":["вал","валлон","вена","вено","вилла","виллан","вина","вино","виола","воин","вол","волан","волна","вона","ива","ил","ион","лев","лен","липа","налеп","налив","напев","нива","новелла","овал","овен","овин","олеин","олива","опал","опевание","оплевание","павлин","пан","пелевин","пелена","пена","пенал","пение","пиво","пила","пилав","пилон","пина","пион","плав","плавление","план","плева","плевание","плевел","плевна","плен","плена","плов","повал","поение","пол","пола","поле","полив","полива","понева","пони"],"вкатывание":["авиетка","акание","акант","акт","актив","акын","анкета","ант","антиква","ванта","вата","ватин","ватка","ватник","век","вена","веник","ветка","веткин","вина","винт","втыкание","ива","ик","канат","канва","кант","катание","квант","квинта","кета","кит","навет","навивка","навык","накат","натек","нива","нитка","танк","твин","теин","тени","тик","тина","тыква","тыквина","тын"],"разжимание":["ажан","азан","ара","арена","еж","жанр","жар","жара","жена","жим","жир","заем","зажим","зажимание","замена","замер","замирание","зима","измена","инжир","мазание","мазар","мазер","мана","манеж","манер","манера","мара","маран","марена","маржа","марзан","межа","мена","мера","мерин","ми","мизер","мина","минер","мини","мир","мираж","мирза","наем","нажим","намаз","низ","раж","разжим","размен","рама","рана","ре","режим","резина","рема","ремиз","ржание","риза"],"барочник":["бак","банк","банкир","банчок","бар","барин","барк","баркин","барон","бачок","бирка","бич","боа","бок","бон","бона","бор","бора","бочар","бочка","бра","брак","бричка","ик","икона","икра","инок","ион","кариб","кино","кобра","кон","кора","коран","корча","корчи","кочан","краб","кран","крона","набор","наиб","норка","ночка","ор","орк","оркан","очинка","очки","очник","раб","рак","роба","рок","чан","чин","чина","чинар","чинка","чир","чирок"],"разметка":["азарт","акт","актер","ара","арак","арека","арка","заем","закат","замер","заметка","затек","зек","зет","каземат","камаз","камера","кара","карат","карате","каре","карета","карма","карт","карта","катер","кета","крез","крем","мазар","мазер","мак","макет","мара","марка","март","мат","матка","мера","мерка","мета","метка","метр","мрак","рак","ракета","рама","рамка","ре","резак","резка","река","рема","таз","тара","тезка","тема","терка","трак","трек"],"почетность":["енот","нос","ночь","опт","осень","осот","ость","ось","отечность","относ","отсчет","отчет","очес","пенс","пень","пес","песнь","песо","пест","печь","понос","понт","пончо","пост","пот","потесь","почесть","почет","сено","сень","сет","сеть","сноп","сон","сонет","сочень","степ","степь","стон","счет","тент","тень","тес","тест","тесто","тесть","течь","тон","топ","топот","топь","тост","точность","честь","четность"],"добавление":["ад","баден","бадин","бал","бдение","беда","бел","белена","бидон","било","блин","блонда","боа","бодание","бола","болван","болид","бон","бона","вал","веда","вена","вено","вид","видео","вина","вино","винодел","виола","владение","вобла","вода","воин","вол","волан","волна","вона","давило","давление","дан","двоение","дебил","дева","девон","делание","дело","диван","диво","длина","дно","до","доение","дол","долина","еда","ендова","ива","идеал","идол","ил","иод","ион","лад","ладо","лебеда","лев","лед","леди","лен","лоб","лобан","надел","надолб","наиб","налив","небо","невод","недолив","нива","обвал","обдел","обед","обида","овал","овен","овин","овладение","ода","одевание","олеин","олива"],"прорекание":["анкер","ерик","ик","икона","икра","инок","ион","капер","капонир","капор","капрон","каре","карп","кепи","керн","кернер","кино","кипа","кон","копание","копир","копна","кора","коран","корпение","кран","крап","крен","креп","кроение","крона","кропание","напор","нерка","нерпа","норка","окание","океан","опак","опарник","опека","опекание","опера","ор","орк","оркан","паек","пак","пан","панер","паникер","панк","пар","паренек","пари","парик","парк","парник","парок","пекан","пена","пенек","пение","пенка","перина","перка","перо","перрон","пиар","пик","пика","пикан","пике","пикон","пина","пинок","пион","пионер","пионерка","пир","поение","покер","пони","пора","порка","прение","приор","прок","проран","рак","ре","река","репа","репина","репка","роение","рок","рокер","ропак"],"сопревание":["анис","ас","ваер","вар","варение","васин","веер","вена","вено","вепс","вера","вес","весна","вина","вино","вира","вис","воин","вона","вор","ворс","воспарение","евреи","ива","инвар","ион","навес","навис","напев","напор","нерв","нерпа","нива","нос","нрав","овен","овес","овин","опасение","опевание","опера","ор","оса","осина","оспа","оспина","пан","панер","пар","пари","пас","пасение","пена","пение","пенис","пенс","перенос","перина","перо","персона","пес","песо","пиар","пиво","пина","пион","пионер","пир","пирс","повар","повеса","поение","понева","пони","пора","посев","право","прение","привес","принос","присев","прованс","провес","просев","просевание","псина","рапс","распев","рвение","ре","рев","репа","репина","репс","рис","ров","роение","роса","сан","сани","сап","сапер","сван","сварение","свора","сев","север","севр","сени","сено","сера","серв","серна","серп","си","синап","синева","сирен","сирена","сироп","сноп","сова","соверен","сон","сопа","сопение","сор","спина","спор","спора"],"геронтолог":["ген","геолог","глот","гнет","го","гогот","гол","гон","гонг","гонор","гонт","горе","горло","горн","грог","грот","енот","леггорн","лен","лет","лето","лог","логгер","лонгет","лоно","лорнет","лот","лото","негр","ор","орел","ореол","отгон","отел","отлог","отрог","ре","рог","рол","рот","тело","тенор","теолог","терн","тлен","тон","тор","торг","трог","трон"],"ферросплав":["ас","ваер","вал","валер","вар","вепс","вера","вес","весло","влас","вол","вор","ворс","лавр","лар","лев","лепра","лес","леса","овал","овес","опал","опера","ор","орел","оса","осел","оспа","пар","пас","пафос","перл","перо","пес","песо","плав","плева","плевра","плес","плов","повал","повар","повеса","пол","пола","поле","пора","посев","право","прасол","провал","провар","провес","прорва","просев","рапс","распев","распор","ре","рев","репа","репс","ров","ровер","рол","роса","сало","салоп","сап","сапер","сафлор","сверло","свора","сев","севр","село","сера","серв","серп","сова","солевар","сопа","сор","софа","сплав","спор","спора","сфера","фа","фавор","фал","фалреп","фарс","фес","флер","флора","фол","фора","форс","фраер"],"ограждение":["ад","ажгон","анероид","арго","аргон","гад","гаер","ген","героин","гид","гидра","гиена","гнида","го","год","година","гон","гора","горе","горение","горин","горн","град","гран","гранд","грена","гренаж","дан","дар","дарение","дежа","дерен","держание","дерн","джига","джин","динар","динго","дно","до","дог","доение","дож","донг","дорн","драже","дрена","дренаж","дрога","дрожание","дрожина","еда","еж","жад","жанр","жар","жаргон","жарение","жена","жеода","жердина","жига","жир","жиронда","жор","иго","игра","иод","ион","ирга","ирод","надир","нард","народ","нега","негр","негроид","недогар","недра","нереида","нога","нож","норд","ода","одежа","одр","одрина","онагр","ор","орган","орда","орден","радио","радон","раж","ранг","рдение","ре","регион","редан","ржание","ринг","рог","род","родина","роение","рожа","рождение","ронжа"],"половчанка":["анклав","вал","вокал","вол","волан","волк","волна","волок","волчанка","волчок","вона","кал","калан","канал","канва","капа","кача","клан","клапан","клон","клоп","коала","кол","колчан","кон","коновал","копал","копна","кочан","лава","лавка","лавочка","лавчонка","лак","ланка","лапа","лапка","лапочка","лачка","ловкач","локон","лоно","навал","наволочка","накал","начало","ночка","овал","окно","око","окова","окоп","опак","опал","опала","опалка","очанка","очко","пава","паволока","пак","палач","палка","палочка","пан","панк","паоло","пачка","плав","плавка","план","планка","плач","плов","повал","поклон","пол","пола","полк","полка","поло","полок","полон","полочка","полчок","пончо","почва","почка","чакан","чакона","чал","чалка","чан"],"притачка":["акт","апачи","ара","арак","арап","арка","арча","ик","икра","капа","кара","карат","карп","карт","карта","кача","кипа","кит","крап","крипта","пак","пакт","пар","пара","пари","парик","парк","парта","парча","пат","пачка","пиар","пик","пика","пир","пират","прачка","притча","причт","птичка","рак","ракита","рапа","тапир","тапка","тапки","тара","тачка","тиара","тик","тип","типчак","тир","ткач","трак","трап","трип","чакра","чара","чарка","чип","чир"],"интеграция":["агент","агнец","ант","ариец","ария","гаер","гаитяне","ганец","гарнец","гарт","ген","герц","гетра","гиацинт","гиена","гинея","гиря","гит","гитан","гнет","гран","гранит","грант","грация","грена","игра","инерция","интрига","иранец","ирга","наитие","натяг","нация","нега","негр","нитрация","ранг","ранет","ранец","рант","ратин","рация","ре","рента","ретина","рея","ринг","ринит","таец","танец","таяние","теин","тени","терн","терц","терцина","тигр","тина","тир","тиран","тирания","тире","тяга","цена","цент","центр","циан","цинга","цитра","яр"],"крупинка":["ик","икра","каик","карп","кика","кипа","кипу","кирка","кран","краник","крап","крик","крикун","кринка","круп","крупа","кукан","кун","куна","кунак","купа","пак","пан","панк","пар","пари","парик","парк","парник","паук","пиар","пик","пика","пикан","пина","пир","пук","пурин","пурка","рак","руина","рука","руна","уран","урина","урна"],"инфразвук":["азу","азур","вар","виза","вина","вира","внук","внуки","враки","врун","звук","знак","зуав","зурна","ива","ик","икра","инвар","карниз","кинза","кран","криз","круиз","кузина","кун","куна","курва","нива","низ","низка","нрав","рак","рафик","риза","риф","руина","рука","рукав","руна","увар","узик","узник","указ","уран","урина","урна","фа","фавн","факир","фанк","физрук","финка","фирн","фрак","франк","фура"],"алгебраист":["абрис","агар","агат","аист","алгебра","алебастр","ара","араб","арабист","арба","арбалет","арбат","ареал","арест","ас","астра","астрал","атлас","багет","бал","балет","бар","барит","барс","бас","бег","бега","бел","бес","бета","билет","бисер","бит","бита","блат","блистер","бра","брага","брас","браслет","брат","брест","бриг","габарит","гаер","галера","галета","галс","гарт","гебраист","герб","гетра","гит","гитара","глас","глист","глиста","граб","грабли","гриб","ибер","игла","игра","ил","ирга","лаг","лар","ласа","ласта","лата","легат","лес","леса","лет","лига","лис","лиса","лист","литер","литера","литр","раб","раба","раса","ре","реалист","регата","регби","регбист","рис","саба","сага","сагиб","саиб","салат","сатир","сатира","сбег","сгиб","селитра","сера","серб","сериал","сет","си","сиг","сигара","сигарета","сила","ситар","слега","слет","стела","стрела","талер","талес","талиб","тара","тес","тиара","тигр","тир","тире","тис","трал","треба","триба"],"салотопня":["ант","апостол","ас","лоно","лот","лото","лотос","ля","ляп","наст","нос","нота","опал","оплот","опт","оса","осот","оспа","относ","отпал","пан","паоло","пас","пат","план","платно","плато","плот","пляс","пол","пола","полнота","поло","полон","полоса","поля","поляна","понос","понт","посол","пост","пот","пояс","пяла","пята","пятно","сало","салон","салоп","салотоп","сан","сап","слон","слот","сноп","соло","сон","соня","сопа","сопло","сопля","сота","сотня","соя","стан","стая","стол","столон","столп","стон","стопа","талон","тля","толпа","тон","тоня","топ","ял","яс"],"мышкование":["акын","амвон","век","веко","векшин","вена","веник","вено","венок","вешка","вина","вино","вишенка","воин","вона","выем","выемка","вымоина","вымокание","вышина","вышка","ива","ик","икона","инок","ион","ишак","камин","камыш","кашне","кеш","кино","ковш","ковы","ком","кома","коми","кон","кошма","мак","маки","маниок","манок","мена","мешковина","мешок","ми","мина","моевка","мокша","монашек","мошка","мошна","мошник","мшаник","мышка","навык","наем","намек","намыв","немка","нива","ниша","новик","нома","ноша","овен","овин","окание","океан","омшаник","омывание","ошва","шванк","шен","ши","шик","шина","шкив","шмон","шнек","шнека","шов","шок"],"формование":["амвон","ваер","вар","вена","вено","вера","вина","вино","вира","воин","вона","вор","ворон","ворона","ефимова","ива","инвар","ион","мавр","маневр","манер","марево","мена","мера","мерин","ми","мина","минер","минор","мир","миф","мор","море","морена","морф","морфин","наем","неврома","нерв","неф","нива","нимфа","нома","номер","норма","норов","нрав","овен","овин","омар","ор","ре","рев","рема","риф","рифма","ров","ром","роман","фа","фавн","фавор","фен","ферма","фирма","фирн","фон","фонема","фора","форма","фреон"],"шнуровка":["вар","внук","вона","вор","врун","ковш","кон","конура","кора","коран","коршун","кран","кров","крона","кун","куна","курва","куш","норка","ноша","нрав","ор","орк","оркан","ошва","рак","ров","рок","рука","рукав","руна","увар","укор","уран","урна","урок","урон","ушан","ушко","шанкр","шар","шванк","шкура","шнур","шнурок","шов","шок","шоу","шуровка"],"апострофа":["аорта","апостроф","ара","арап","артос","арфа","ас","астра","опара","опор","опора","опрос","опт","ор","оса","осот","оспа","отара","отпор","офорт","пар","пара","параф","парта","пас","паста","пастор","пат","пафос","пора","порт","пост","пот","просо","профос","рапа","рапс","раса","ропот","роса","рост","рот","рота","сап","сапа","сатрап","сопа","сор","сорт","сота","софа","софора","спарта","спор","спора","спорт","стопа","стопор","строп","стропа","строфа","тара","топ","топор","тор","торос","торс","торф","трап","троп","тропа","трос","фа","фара","фарс","фарт","фат","фата","фора","форпост","форс","форт","фото","фтор"],"плодоножка":["ад","дан","джок","джонка","дно","до","дож","док","дока","дол","должок","жад","жало","жопа","кал","клад","клан","клон","клоп","код","кода","кодла","кожа","кол","колода","кон","копал","копна","лад","ладо","лаж","лак","лодка","ложа","ложка","локон","лонжа","лоно","надкол","нож","ножка","ода","оклад","окно","око","окоп","опак","опал","падло","паж","пак","пан","панк","паоло","план","плод","подножка","подол","подонок","поклон","пол","пола","полк","полка","поло","полок","полон"],"глодание":["ад","ангел","гад","ген","гид","гиена","глина","гнида","го","год","година","гол","гон","дан","дело","диалог","динго","длина","дно","до","дог","дол","долг","долина","донг","еда","игла","иго","идеал","идол","ил","иод","ион","лаг","лад","ладо","легион","лед","леди","лен","лига","лог","надел","налог","нега","недолга","нога","ода","олеин"],"пролезание":["анзор","зал","залп","запор","зерно","зеро","зло","зола","золение","зона","зрение","ил","ион","лазер","лар","леер","лен","лепра","линза","липа","лоза","лозина","лопари","лори","налеп","напор","нерпа","низ","оаз","озарение","олеин","опал","опера","ор","орел","орлан","паз","пан","панер","пар","парез","пари","пароли","пелена","пелерина","пена","пенал","пение","перезол","перила","перина","перл","перлон","перо","пиар","пила","пилон","пина","пион","пионер","пир","плаз","план","планер","плеер","плен","плена","поение","поза","позер","пол","пола","поле","ползание","пони","пора","порез","прение","приз","проза","ре","резание","резина","резон","реле","релиз","репа","репина","риза","роение","роза","рол"],"бюргерство":["бег","бегство","бес","бог","бор","боргес","борт","бот","брест","бювет","бюргер","бюро","бюст","вес","вест","вето","вор","ворс","герб","герр","го","горб","горе","гроб","грот","обвес","обет","обсев","овес","овсюг","ор","осетр","отвес","отсев","ре","ребро","рев","ревю","ров","ровер","рог","рост","ростр","рот","сбег","сбор","свет","сев","севр","серб","серв","сет","совет","сор","сорт","створ","стог","тес","тор","торг","торс","трог","трос","юг","юр","юс","ют"],"сапонит":["аист","анис","ант","ас","ион","наст","нос","нота","опт","оса","осина","оспа","оспина","пан","пас","пат","пина","пинта","пион","пистон","питон","пони","понт","пост","пот","псина","сан","сани","сап","сатин","си","синап","сипота","сито","сноп","сон","сопа","сота","спина","стан","стон","стопа","тина","тип","тис","тон","топ"],"королева":["ваер","вал","валек","валер","вар","век","веко","вера","верк","вокал","вол","волк","волок","вор","елка","кал","каре","клев","ковер","кол","колер","кора","корова","креол","кров","лавр","лак","лар","ларек","лев","левак","лерка","овал","око","окова","окрол","ор","орел","ореол","орк","орок","рак","раколов","ре","рев","река","ров","рок","рол"],"контрданс":["ад","аксон","акт","андрон","анонс","ант","артос","ас","дан","даос","дар","дно","до","док","дока","донна","дорн","доска","дракон","дрок","кадр","канон","кант","кантон","кантор","карст","карт","картон","кастор","катод","код","кода","кон","контра","кора","коран","корд","корда","корт","коса","костра","кот","кран","кроат","крона","крот","нанос","нард","народ","нарост","наст","натрон","нона","норд","норка","нос","нота","нотка","ода","одр","окрас","ор","орда","орк","оркан","оса","оскар","радон","рак","рант","род","рок","роса","рост","рот","рота","сад","садок","сак","сан","сард","скарн","скат","скот","сода","сок","сон","сонант","сор","сорт","сота","сотка","срок","стадо","стан","станок","сток","стон","строка","тако","танк","ток","тон","тонна","тор","торс","тоска","трак","транс","трок","трон","трос"],"выстилание":["аист","алтын","анис","ант","ас","вал","валет","васин","ватин","вена","вес","весна","вест","ветла","вилы","вина","винт","вис","витание","влас","власти","вылет","ива","иваси","ил","истина","латины","латы","лев","левит","лен","лента","лес","леса","лесина","лет","ливы","линт","лис","лиса","лист","листва","лысина","навес","навет","навис","наитие","налет","налив","насилие","наст","настил","натес","нива","сан","сани","сатин","сван","сваны","сват","свет","свита","сев","селин","сенат","сени","сет","си","сиенит","сила","силен","силин","синева","сити","слет","слив","слива","сливание","слитие","стан","стела","стена","сын","сыта","талес","твин","теин","тени","тес","тесина","тина","тис","тлен","тыл","тын"],"подносчик":["диск","дичок","дно","до","док","донос","доносчик","ик","инок","иод","ион","иск","кино","код","кон","нос","носик","носок","окно","око","окоп","оксид","оникс","очипок","очки","очко","очник","пик","пикон","пинок","пион","писк","поднос","поиск","покос","пони","понос","пончик","пончо","почин","почки","си","синод","скип","скоп","сноп","сок","сон","спич","чин","чип"],"нейтралист":["аист","алтей","анис","ант","антей","арест","артист","ас","атеист","атлет","ил","иней","лай","лайнер","лар","латерит","лей","лен","лента","лес","леса","лесина","лет","линт","лис","лиса","лист","литер","литера","литр","налет","наст","настил","натес","натрий","нейрит","нитрат","рай","ранет","рант","ратин","ре","реалист","рей","рейн","рейс","рений","рента","ретина","рис","сайт","сан","сани","сатин","сатинер","сатинет","сатир","селин","селитра","сенат","сени","сера","сериал","серна","сет","си","сила","силен","синай","сирен","сирена","ситар","слет","стайер","стан","старт","стеарин","стела","стена","стерин","стилет","стрела","стрит","талер","талес","тарист","театр","теин","теист","тени","тент","терн","тес","тесина","тест","тета","тетрил","тина","тир","тиран","тире","тис","титан","титр","тлен","трал","транс","траст","трест","треста","третий","триест"],"финалистка":["аист","аистник","акант","акафист","акт","аналитик","анис","ант","ас","атлас","ик","ил","инки","инфикс","иск","истина","каинит","кал","калан","калин","калина","калиф","канал","канат","канифас","кант","каста","кафтан","кила","киста","кит","клан","ксилит","лак","ланита","ланка","ласа","ласка","ласта","ластик","лата","латинка","латник","лафа","лафит","лиана","лик","линт","лис","лиса","лиска","лист","листик","литка","литник","лиф","лифт","накал","накат","наст","настил","настилка","натиск","нитка","сак","салат","салатик","салатник","салки","сан","сани","санки","сатин","си","сикл","сила","силикат","силин","синклит","сити","скала","скат","скиф","стакан","стан","стилка","стланик","такса","такси","талик","танк","тик","тина","тис","тиски","тиф","фа","факс","факт","фал","фанат","фанатик","фанк","фант","фанта","фантик","фаска","фат","фата","фиал","фиалка","фиат","фикс","фила","филант","филин","финал","финалист","финик","финка","финт","фискал","фита","фитин","флат","флик","флинт"],"форштевень":["веер","вено","вентерь","верфь","ветер","вето","ветошь","вонь","вор","вошь","енот","ерш","ерь","нерв","неф","нефть","новь","овен","ор","ре","рев","ревень","ренет","решето","ров","рот","тенор","тень","терн","тернев","тон","тор","торф","трон","фен","фетр","фон","форт","фреон","фронт","фтор","шверт","шеврет","шевро","шеврон","шен","шеф","шов","шот","шофер","шрот","штевень","штоф"],"отпущенник":["енот","ик","инок","ион","кепи","кино","кипу","кит","кнут","кон","копт","кот","кун","кунин","купе","купон","неон","нептун","нонет","нут","опекун","опт","оптик","отек","откуп","пенни","петин","пик","пике","пикет","пикон","пинок","пион","питон","пони","понт","пот","потек","потник","пук","пункт","путник","теин","тени","тик","тип","типун","тиун","ток","тон","тоник","топ","топик","тун","тупик","унион","упек","уток","щекот","щенок","щи","щипок","щит","щиток","щуп"],"перетяжка":["акт","актер","еж","жакет","жар","капер","каре","карп","карт","катер","кета","крап","креп","крепеж","кряж","паек","паж","пак","пакет","пакт","пар","парк","паркет","паря","пат","патер","перекат","перка","пряжа","пряжка","пята","пятак","пятерка","пятка","раж","рак","ре","река","репа","репка","рея","ряж","тапер","терка","трак","трап","трек","треп","трепак","трепка","тряпка","тяж","тяпка","як","яр","ярка"],"консервы":["век","веко","вено","венок","верк","вес","вор","ворс","воск","выкос","вынос","керн","ковер","ковы","кон","крен","кров","нерв","нос","нырок","овен","овес","ор","орк","осек","ре","рев","ров","рок","рывок","рык","рынок","свекор","сев","севок","севр","сено","серв","серко","сквер","сок","сон","сор","срок","срыв","сын","сынок","сыр","сырок"],"доставка":["ад","адат","адвокат","акт","ас","вакса","вата","ватка","вода","водка","воск","давка","даос","дата","до","док","дока","доска","каста","катод","квас","квота","код","кода","коса","кот","ода","октава","оса","осада","осадка","осака","отава","отсадка","савка","сад","садок","сак","саква","сват","свод","сводка","скат","скот","сова","совка","сода","сок","сота","сотка","ставка","стадо","сток","тако","такса","тасовка","ток","тоска"],"мурмолка":["амур","аул","кал","кол","ком","кома","комар","кора","корм","корма","кум","кума","лак","лар","лом","ломка","лук","лука","мак","мол","мор","мрак","муар","мука","мул","мура","мурома","омар","ор","оракул","орк","рак","рок","рол","ром","рука","укол","укор","улар","ум","умолк","умора","урал","урок"],"нарколог":["арго","аргон","го","гол","гон","гонка","гонор","гора","горка","горлан","горло","горн","гран","кагор","кал","клан","клон","кол","кон","конго","кора","коран","корона","кран","крона","лаг","лак","лар","лог","локон","лоно","налог","нога","норка","огарок","окно","око","окрол","онагр","ор","орган","орк","оркан","орлан","орок","рак","ранг","рог","рок","рол"],"мексиканка":["акание","анис","ас","ик","иск","каемка","каик","камин","камка","камса","касание","каска","кекс","кика","кикс","киска","маис","мак","макание","маки","мана","манка","манси","маска","мекка","мена","ми","мина","миска","наем","намек","немка","саам","саами","саек","сак","саке","сакман","саман","самка","сан","сани","санки","сема","сени","си","сиамка","скак","скакание","скена","смак","смена"],"завтрашнее":["авар","азан","азарт","анвар","ант","ара","арена","ваер","ваза","ванта","вар","варан","вата","веер","вена","вера","верша","ветер","ветеран","врата","врез","ерш","завет","зев","зева","зет","навар","навет","назарет","нарва","нарта","нерв","нрав","рана","ранет","рант","ре","рев","реванш","ренет","рента","таверна","тавр","таз","тара","таран","терн","тернев","теша","трава","транш","шар","шатен","шатер","шверт","шеврет","шен"],"многоустка":["аксон","акт","ант","анус","ас","атом","аут","гном","гнома","гнус","го","гомон","гон","гонка","гонт","гумно","гута","кант","кнут","ком","кома","кон","конго","конус","коса","кот","куга","кум","кума","кумган","кун","куна","кунг","кунгас","куст","кутас","маг","мак","манго","мангуст","манок","мант","манто","манту","масон","мат","мост","мосток","мотка","моток","мука","муст","мустанг","мутон","наст","нога","нокаут","нома","нос","носок","нота","нотка","нуга","нут","окно","око","окот","омут","оса","осман","осока","осот","отгон","отгонка","откос","откус","относ","саго","сак","самогон","сан","сгон","сгонка","скат","скаут","скот","скотома","смак","смог","смотка","смута","сок","сом","сома","сон","сонм","сота","сотка","стан","станок","стог","сток","стон","стук","сук","сука","сукно","сума","сумка","тако","танго","танк","тога","ток","том","томан","тон","тонус","тоска","тукан","тумак","туман","тун","туна","тунг","угон","укос","ум","ус","уста","утка","утконос","уток"],"таможенник":["аконит","акт","анемон","анион","аноним","ант","антоним","атом","атомник","еж","енот","жакет","жена","женка","жетон","жим","жинка","жмот","ик","икона","икота","инок","ион","камин","канон","кант","кантон","катион","кета","кино","кит","кожа","ком","кома","комета","коми","кон","конина","кот","мак","макет","маки","манеж","манжет","маниок","манник","манок","мант","манто","мат","межа","мена","менонит","менонитка","мент","ментик","мета","метан","метка","ми","мина","митенка","монета","монетка","монтаж","монтажник","мотка","наем","наемник","нажим","нажин","нажитое","наин","намек","намет","намин","натек","нежин","немка","немота","ненка","неон","нитка","нож","ножик","ножка","нома","нона","нонет","нота","нотка","окание","океан","омежник","омет","отек","отжим","отжимка","отмена","таежник","тако","танин","танк","теин","тема","тени","тик","тина","тмин","ток","том","томан","томик","тон","тоник","тоника","тонина","тонна","тоннаж"],"медиатор":["ад","атом","дар","дерма","дети","диаметр","диета","до","дом","домра","дрема","дремота","еда","иод","ирод","март","мат","мед","медиа","мера","мета","метод","метода","метр","метро","ми","мир","мирт","мирта","митра","мода","мор","морда","море","ода","одр","омар","омет","ор","орда","радио","ре","рема","ритм","род","ром","рот","рота","тема","тир","тире","том","тор","трио","триод"],"космополит":["ик","ил","илот","иск","исполком","исток","кило","киото","кит","клип","клипс","клоп","кол","колит","колос","ком","коми","компост","компот","копт","кости","кот","лик","лис","лист","листок","лом","ломик","ломтик","лоск","лот","лото","лоток","лотос","ми","микст","милок","мол","молоки","молоко","молот","молоток","мопс","москит","мосол","мост","мостик","мосток","моток","око","окоп","окот","олимп","оплот","опт","оптик","осилок","ослик","осмол","осот","остолоп","откол","откос","отоскоп","пик","пилот","пим","писк","плис","плот","поиск","покос","пол","полис","полк","поло","полок","помои","помол","помост","посол","пост","пот","поток","потолок","потомок","си","сикл","силок","сито","скип","скол","скоп","скот","слип","слиток","слом","слот","сок","соло","соломит","сом","сопли","сопло","спил","спилок","сплоток","сток","стол","столик","столп","тик","тимол","тиокол","тип","тис","ток","толк","толки","том","томик","топ","топик"],"сокрытие":["ерик","ик","икры","иск","исток","кисет","кит","корсет","корт","костер","кости","кот","крест","крот","ор","орк","осек","осетр","острие","отек","отсек","ре","рис","риск","рок","рост","рот","ротик","рык","сектор","серко","сет","си","сито","ситро","скот","скрытие","сок","сор","сорит","сорт","соты","срок","срытие","стек","сток","стокер","стык","сыр","сырок","сырт","тес","тик","тир","тире","тис","ток","тор","торс","трек","треск","трико","трио","трок","трос"],"странность":["анонс","ант","артос","ас","нанос","нарост","насос","наст","натрон","нона","нос","носарь","нота","ор","оса","ость","ось","рант","рань","рать","роса","рост","рот","рота","сан","снасть","снос","сон","сонант","сор","сорт","сосна","сота","ссора","стан","станс","старость","старт","статор","стать","стон","страсть","тон","тонна","тор","торс","торт","тост","транс","трасс","траст","трон","трос","трость","трот"],"сантехника":["аист","акание","акант","акт","анис","анкета","ант","ас","аскет","астеник","ик","иск","канат","канна","кант","касание","каста","катание","кета","кисет","киста","кит","кнехт","наин","накат","нанка","наст","натек","натес","натеска","натиск","ненка","нитка","саек","сак","саке","сан","сани","санки","сантехник","сатин","секта","сенат","сени","сет","сетка","си","скат","скена","стакан","стан","станина","стек","стека","стена","стенка","стих","такса","такси","танин","танк","таскание","теин","тени","теннис","тенниска","тес","тесак","тесина","теска","теснина","техас","техник","техника","тик","тина","тис","хакас","хаки","хан","хасан","хата","хек","хит","хна"],"земляника":["амнезия","анемия","елка","заем","зал","зек","земля","земляк","землянка","зенки","зима","злак","злаки","змея","знак","знамя","измена","ик","ил","имя","казеин","кал","калин","камелия","камея","камин","кила","кинза","клан","клен","клизма","лак","лаяние","лен","лея","лик","лиман","линза","ля","лямка","мазик","мак","маки","малек","малик","мания","маяк","мел","мена","меняла","ми","милан","миля","мина","мякина","мялка","наем","налим","намек","немка","низ","низка","як","ял","ялик","яма","янки"],"капитулянт":["акт","алунит","ант","аттик","аул","аут","ик","ил","инула","кал","калин","кант","капитул","каплун","капля","капут","кила","кипа","кипу","кит","клан","клип","клуня","кляп","кнут","кулан","кун","куна","купа","купля","лак","лапник","лапти","латник","латук","лик","линт","липа","липка","липняк","литка","лук","лука","луна","лунатик","лунит","лунка","лупа","ля","ляп","нитка","нут","пак","пакля","пакт","палия","пан","панк","пат","паук","пик","пика","пикан","пила","пилка","пина","пинта","питта","плакун","план","плаун","плита","плитка","плитняк","плут","пуант","пук","пул","пула","пуля","пункт","путина","путник","пяла","пялка","пята","пятак","пятка","такт","талик","талия","танк","тапки","тик","тина","тип","типун","титан","титул","тиун","тля","тукан","тун","туна","туника","тупик","тут","тута","туя","тяпка","улан","улика","улит","улитка","униат","утка","утятина","утятник","як","якут","ял","ялик","янки"],"мемуарист":["аист","амур","арест","ас","аут","имам","маис","марс","март","мастер","мат","мем","мемуар","мера","мета","метр","ми","мим","мир","мирт","мирта","мистер","митра","муар","мумие","мура","муст","рамс","раус","раут","ре","рема","рис","ритм","руст","рута","саммит","самум","сатир","сема","семит","сера","серум","сет","си","ситар","смета","смута","срам","суета","сума","сумма","сура","тема","тес","тир","тире","тис","трус","туер","туес","тур","тура","ум","ус","уста","утес"],"гласность":["алость","альт","ант","ас","галс","гать","глас","глот","го","гол","гон","гонт","гость","лаг","лань","лассо","лог","лось","лот","льгота","наглость","налог","насос","наст","нога","ноль","нос","нота","оса","ость","ось","саго","сало","салон","сальто","сан","сгон","сласть","слог","слоган","слон","слот","снасть","снос","соль","сон","сосна","сота","сталь","стан","станс","стлань","стог","стол","стон","талон","танго","тога","толь","тон"],"вспухание":["анис","анус","ас","васин","вена","вепс","вес","весна","вех","веха","вина","вис","евнух","ива","навес","навис","напев","нива","нивх","пан","пас","пах","певун","пена","пенис","пенс","пес","пина","псина","псих","пух","сан","сани","сап","сван","свинуха","сев","сени","си","сивуха","синап","синева","спех","спина","суп","супин","ус","успех","уха","ухание","хан","хаус","хна"],"литограф":["арго","галиот","гарт","гирло","гит","гифа","глот","го","гол","голиаф","гора","гофр","граф","графит","гриф","грот","игла","иго","игра","ил","илот","ирга","итог","лаг","лар","лафит","лига","литр","лиф","лифт","лог","лори","лот","олифа","ор","офит","риф","рог","рол","рот","рота","тариф","тигр","тир","тиф","тога","тор","торг","торги","торф","трал","трио","трог","фа","фагот","фал","фарт","фат","фиал","фиат","фиг","фига","фигаро","фила","фита","флаг","флат","флирт","флора","флот","фогт","фол","фора","форт","фтор"],"мерзлость":["ель","ерь","зеро","зет","зло","злость","золь","зрелость","лес","лесть","лет","лето","лом","лось","лот","мел","мелос","мель","мерзость","место","месть","метол","метр","метро","мозель","мол","моль","мор","море","морель","морс","мост","мосье","мотель","мсье","омет","омлет","ор","орел","осел","осетр","ость","ось","отел","отель","отмель","отрез","ре","резь","рельс","рол","роль","ром","рост","рот","село","сель","семь","сет","сеть","слет","слом","слот","смерть","смоль","смотр","соль","сом","сор","сорт","срез","стол","тело","темь","термос","тес","тесло","толь","том","тор","торс","трель","трос"],"реальность":["алость","альт","ант","антресоль","арест","артель","артос","ас","ель","енот","ерь","лань","лар","ларь","лен","леность","лента","лень","лес","леса","лесть","лет","лето","лорнет","лось","лот","налет","нарост","наст","натес","ноль","нос","носарь","нота","олень","ор","орел","орлан","оса","осел","осень","осетр","ость","ось","отел","отель","отрасль","ранет","рант","рантье","рань","рать","ре","рельс","рента","рол","роль","роса","рост","рот","рота","сало","салон","сальто","сан","село","сель","сенат","сенатор","сено","сень","сеньор","сеньора","сера","сераль","серна","сет","сеть","слет","слон","слот","соль","сон","сонет","сор","сорт","сота","сотерн","сталь","стан","старье","стела","стена","стернь","стлань","стланье","стол","стон","стрела","талер","талес","талон","тело","тенор","тень","терн","тес","тесло","тлен","толь","тон","тор","торс","трал","транс","трель","трон","трос"],"лицеистка":["аист","акт","ас","аскет","асцит","ацтек","ацтеки","елка","ик","ил","иск","истец","истица","кал","кета","кила","кисет","кислица","киста","кит","китаец","клест","ксилит","лак","ластик","латекс","лес","леса","леска","лет","лик","лис","лиса","лисица","лиска","лист","листик","литка","лицеист","саек","сак","саке","салки","секта","сет","сетка","си","сикл","сила","силикат","ситец","сити","скат","скиталец","слет","слитие","стек","стека","стела","стилка","таец","такси","талес","талик","телка","тес","тесак","теска","тик","тис","тиски","цикл"],"дровяник":["вид","вино","водник","воин","вор","двор","дворик","дворник","дворня","диво","дно","до","док","дорн","дояр","дровни","дрок","ивняк","ик","инок","иод","ион","ирод","кино","код","кон","корд","кров","новик","норд","нория","овин","одр","ор","орк","ров","ровик","род","родник","родня","рок","ряд","рядно","рядок","явор","яд","ядро","як","янки","яр","ярд","ярок"],"красавчик":["авар","ара","арак","арка","арча","ас","вакса","вар","варка","вира","вис","враки","врач","вскрик","ива","ик","икра","иск","искра","каик","кара","карачки","каркас","каска","кача","качка","кварк","квас","кика","кикс","кираса","кирка","киска","кичка","краса","краска","крачка","крик","рак","раса","рис","риск","риска","савка","сак","саква","свара","сварка","си","скак","скачка","скачки","чакра","чара","чарка","час","часик","чир"],"врастание":["аванс","авар","аист","анвар","анис","ант","ара","арена","арест","ас","астра","ваер","ванта","вар","варан","вариант","васин","вата","ватин","вена","вера","верста","вес","весна","вест","вина","винт","вира","вис","врата","ива","инвар","навар","навес","навет","навис","нарва","нарта","наст","натес","неврит","нерв","нива","нрав","рана","ранет","рант","раса","ратин","ре","рев","рента","ретина","рис","саван","сан","сани","санитар","сатин","сатинер","сатир","сатира","сван","свара","сват","сватание","свет","свита","свитер","сев","севр","сенат","сени","сера","серв","сервант","серна","сет","си","синева","сирен","сирена","ситар","стан","старание","старина","стеарин","стена","стерва","стерин","страна","таверна","тавр","тара","таран","твин","теин","тени","терн","тес","тесина","тиара","тина","тир","тиран","тире","тис","трава","транс"],"раскисание":["акание","анис","анкер","ара","арак","арека","арена","арка","аркан","арника","ас","аскер","ерик","ик","икание","икра","инки","иранка","ирис","иск","искание","искра","кара","каре","кариес","касание","касса","кассир","керн","кираса","кран","краса","крен","накра","нерка","рак","рана","ранка","раса","ре","река","рис","риск","риска","саек","сак","саке","сакс","сан","сани","санки","сеанс","секанс","секира","секс","сени","сера","серна","си","сирен","сирена","сканер","скарн","скена","скисание"],"чертовка":["автор","акт","актер","ваер","вар","век","веко","вектор","вера","верк","ветка","вето","веточка","вор","врач","втора","каре","карт","катер","квота","кета","кетч","ковер","кора","корвет","корт","корча","кот","кроат","кров","крот","овечка","овчар","ор","орк","отвар","отек","очерк","рак","рвота","ре","рев","река","речка","ров","рок","рот","рота","тавр","тавро","тако","терка","течка","ткач","товар","ток","тор","точка","трак","трек","трок","чаек","чек","чека","черва","черт","черта","чета","чрево"],"соблюдение":["бдение","бел","бес","бидон","било","блин","блюдо","болид","бон","дебил","дело","дно","до","доение","дол","идол","ил","иод","ион","лед","леди","лен","лес","лис","лоб","люди","небо","нелюди","нос","ню","обдел","обед","олеин","осел","седло","сеид","селен","селин","село","сени","сено","сеноед","си","силен","силон","синод","след","слоение","слон","слюни","сноб","соление","сон","юление","юс"],"окачивание":["акание","век","веко","вена","веник","вено","венок","венчик","вина","вино","воин","вона","ива","ик","икание","икона","инки","инок","ион","канва","кача","качание","кивание","киви","кино","кон","кочан","нива","новик","ночевка","ночка","овен","овечка","овин","овчина","окание","океан","очанка","очинка","очки","очник","чавкание","чаек","чаинка","чакан","чакона","чан","чек","чека","чин","чина","чинка"],"автокар":["авар","автор","акт","аорта","ара","арак","арка","вар","варка","вата","ватка","вор","врата","втора","кара","карат","карт","карта","квота","кора","корт","кот","кроат","кров","крот","октава","ор","орава","орк","отава","отара","отвар","отрава","рак","рвота","ров","рок","рот","рота","тавр","тавро","тако","тара","товар","товарка","ток","тор","трава","травка","трак","трок"],"субмарина":["абрис","амбар","амбра","амур","анис","анус","ара","араб","арба","ас","аура","бар","баран","барин","барс","бас","басма","басни","басурман","бимс","бра","брас","брус","бур","бура","буран","бурса","бусина","маис","мана","манси","мара","марабу","маран","марс","ми","мина","минус","мир","мираб","муар","мура","наиб","нимб","раб","раба","рама","рамс","рана","раса","раус","рис","рубин","руина","румб","румба","руна","русин","саам","саами","саба","сабан","сабур","саиб","саман","самар","самба","сан","сани","сауна","си","смирна","срам","сруб","сума","сура","сурна","ум","умбра","уран","урина","урна","ус"],"жительство":["вес","весло","вест","весть","весь","вето","вис","витье","воитель","вол","еж","ель","жест","жесть","живость","живот","жилет","жилье","житель","житье","ил","илот","лев","левит","лес","лесть","лет","лето","лживость","лис","лист","литье","ложе","ложь","лось","лот","овес","оливье","осел","остеит","остит","ость","ось","отвес","ответ","отел","отель","отит","отлет","отлив","отсвет","отсев","свет","светило","свиль","сев","село","сель","сет","сеть","си","силь","сито","слет","слив","слот","совет","сожитель","соль","ствол","стилет","стиль","стол","твист","теист","тело","тес","тесло","тест","тесто","тесть","тис","титло","толь","тост"],"подсыпание":["ад","анис","ас","аспид","дан","даос","депо","десна","дно","до","досыпание","еда","иод","ион","насып","нос","ода","оса","осина","оспа","оспина","осыпание","пан","пас","пена","пенис","пенс","пепси","пепсин","пес","песо","пина","пион","подина","пони","поп","посад","посыпание","псина","сад","сан","сани","сап","седина","сеид","сени","сено","си","синап","синод","сноп","сода","сон","сопа","спад","спина","сын"],"множитель":["еж","ель","енот","жетон","жилет","жилье","жим","житель","житье","жмот","ил","илот","ильм","ион","лен","лень","лет","лето","лимон","линт","линь","литье","ложе","ложь","лом","лот","мел","мель","мент","ментол","метил","метол","ми","мол","моль","мотель","нежить","неолит","нилот","нить","нож","ноль","олеин","олень","омет","омлет","отел","отель","отжим","отмель","теин","тело","темь","тени","тень","тимол","тлен","тмин","толь","том","тон"],"протяжение":["еж","енот","жетон","жир","жор","ион","нож","нория","опт","ор","отряжение","пение","пеня","перо","петин","пижон","пион","пионер","пир","питер","питон","поение","пони","понт","понтер","понятие","порт","пот","потение","потеря","потир","прение","прения","притон","протеже","протеин","пятно","ре","ренет","рея","реяние","роение","рот","ряж","ряжение","теин","тени","тенор","теория","терн","теряние","тип","тир","тире","тон","тоня","топ","тор","трение","треп","трио","трип","троение","трон","троп","тяж","яр"],"желчность":["еж","ель","енот","желчь","жест","жесть","жетон","лен","леность","ленч","лень","лес","лесть","лет","лето","ложе","ложь","лось","лот","нож","ноль","нос","ночь","олень","осел","осень","ость","ось","отел","отель","очес","село","сель","сено","сень","сет","сеть","слет","слон","слот","соль","сон","сонет","сочень","сочлен","стол","стон","счет","тело","тень","тес","тесло","течь","тлен","толь","тон","челн","чело","честь","член"],"автоклуб":["автол","акт","аул","аут","бак","бал","балок","баул","блат","блок","боа","бок","бокал","бола","болт","бот","ботва","бук","бука","буква","булка","бут","вал","вобла","вокал","вол","волк","втулка","кал","квота","клуб","кол","колба","кот","куб","лак","латук","лоб","локаут","лот","луб","лук","лука","обвал","обкат","обувка","овал","отвал","табло","табу","тако","ток","толк","туба","увал","укол","улов","уловка","утка","уток"],"опаривание":["авар","анвар","ара","арап","арена","ваер","вар","варан","вена","вено","вера","вина","вино","вира","воин","вона","вор","ива","инвар","ион","навар","напев","напор","нарва","нерв","нерпа","нива","нрав","овен","овин","опаивание","опара","опера","оправа","ор","орава","пава","павиан","пан","панева","панер","пар","пара","пари","парование","пена","перина","перо","пиар","пиво","пина","пион","пионер","пир","пирование","повар","понева","пони","пора","права","право","рана","рапа","ре","рев","репа","репина","ров"],"пуансовка":["аванс","аксон","анус","ас","вакса","вкус","внук","вона","воск","впуск","канаус","канва","капа","каунас","квас","кон","конус","копна","коса","кун","куна","купа","купава","купон","напуск","наука","нос","опак","опаска","опус","оса","осака","осанка","оспа","пава","пак","пан","панк","пас","паск","паук","псовка","пук","пуск","саван","савка","сак","саква","сан","сап","сапа","сапка","сауна","сван","сванка","скоп","скопа","скуп","сновка","сноп","сова","совка","сок","сон","сопа","сопка","сук","сука","сукно","суп","укос","ус"],"киприотка":["акт","ик","икота","икра","иприт","каик","капок","капор","капот","карп","карт","каток","кика","кипа","киприот","кирка","кит","кок","кока","копир","копирка","копт","кора","корка","корт","кортик","кот","котик","крап","крик","крипта","критик","критика","кроат","крот","окрик","опак","опт","оптик","оптика","ор","орк","пак","пакт","пар","пари","парик","парк","парок","пат","пиар","пик","пика","пики","пир","пират","пирит","пора","порка","порт","портик","портки","пот","потир","практик","приток","прок","прокат","рак","рок","ропак","рот","рота","ротик","тако","тапир","тапки","тик","тип","тир","ток","топ","топик","топика","топка","тор","трак","трап","трико","трио","трип","трок","троп","тропа","тропик","тропка"],"антиракета":["акание","акант","акт","актер","анкер","анкета","ант","антракт","ара","арак","арека","арена","ариетта","арка","аркан","арника","атака","аттик","ерик","ик","икра","иранка","канат","кант","кантата","кантри","кара","карат","карате","каре","карета","карт","карта","картина","катание","катарина","катер","катерна","катет","катрен","кератин","кератит","керн","кета","кит","кран","крен","кретин","накат","накра","нарта","натек","натирка","нектар","нерка","нитка","нитрат","рак","ракета","ракита","рана","ранет","ранетка","ранка","рант","ратин","ратник","ре","река","рента","ретина","такт","танк","танкер","тара","таракан","таран","тартание","тартинка","театр","теин","тени","тент","теракт","терка","терн","тета","тетка","тиара","тик","тина","тир","тиран","тире","титан","титр","трак","тракт","трата","трек"],"смертность":["енот","ерь","мент","мерность","местность","место","месть","метр","метро","монстр","монтер","мор","море","морс","мост","мосье","мотет","мсье","номер","нос","омет","ор","осень","осетр","ость","ось","ре","ремонт","ром","рост","рот","семь","сено","сень","сеньор","серость","сет","сеть","смерть","смесь","смотр","снос","сом","сон","сонет","сонм","сор","сорт","сотерн","стернь","стон","темь","тенор","тент","тень","термос","терн","тес","тест","тесто","тесть","том","тон","тор","торс","торт","тост","тостер","тотем","трест","треть","трон","трос","трость","трот"],"счаливание":["аванс","анис","ас","вал","васин","величина","вена","вес","весна","вина","вис","влас","ива","иваси","ил","лава","лавина","лавсан","ласа","лев","лен","ленч","лес","леса","лесина","лиана","лис","лиса","лич","личи","личина","навал","навес","навис","налив","наличие","насилие","начес","нива","саван","сан","сани","сван","свеча","сев","селин","сени","си","сила","силач","силен","силин","синева","слава","слив","слива","сливание","счал","чал","чан","час","челн","чин","чина","член"],"скворечня":["век","веко","вено","венок","веня","верк","верняк","вес","вор","ворс","воск","керн","ковер","кон","корея","крен","кров","нерв","нос","овен","овес","ор","орк","осек","очерк","очес","ре","рев","рея","ров","роевня","рок","свекор","сверчок","свояк","сев","севок","севр","сено","серв","серко","сквер","сок","сон","соня","сор","сорняк","соя","срок","чек","червяк","чеснок","чрево","явор","як","яр","ярок","яс"],"стендовик":["век","веко","веник","вено","венок","вес","вест","вестник","веткин","вето","вид","видео","виконт","вино","винт","вис","висок","виток","водник","воин","воск","девон","деист","дек","дети","диво","диск","дисконт","дно","до","док","досев","единство","едок","енот","ик","индекс","инок","иод","ион","иск","истод","исток","кино","киновед","кисет","кит","код","кодеин","кон","кости","кот","невод","новик","нос","носик","овен","овес","овин","оксид","оникс","осек","осетин","отвес","отек","отсев","отсек","свет","свиток","свод","сводник","сев","севок","седок","сеид","сени","сено","сет","си","синод","сито","скот","снеток","совет","советник","совик","сок","сон","сонет","сотник","стек","стенд","сток","стон","твид","твин","твиндек","теин","тени","тес","тик","тис","тодес","ток","токсин","тон","тоник"],"филофонист":["ил","илот","ион","линт","лис","лист","лиф","лифт","лоно","лот","лото","лотос","нилот","нос","осот","относ","офис","офит","си","силин","силон","сити","сито","сифон","слон","слот","соло","сон","софит","соффит","стол","столон","стон","тис","тиф","тифон","тон","филин","философ","финт","фитин","флинт","флот","фол","фон","фото","фотон"],"космонавт":["аксон","акт","амвон","ант","ас","атом","вона","воск","восток","кант","квант","квас","квота","ком","кома","кон","коса","кот","мак","манок","мант","манто","масон","мат","мост","мосток","мотка","моток","наст","нома","нос","носок","нота","нотка","окно","око","окова","окот","оса","осман","основа","осока","осот","остов","откос","относ","сак","сан","сван","сват","скат","скот","скотома","смак","смоква","смотка","сновка","сова","совка","совок","сок","сом","сома","сон","сонм","сота","сотка","стан","станок","сток","стон","тако","танк","ток","том","томан","тон","тоска"],"горечавка":["авар","агар","ара","арак","арго","арека","арка","арча","вага","ваер","вар","варка","вега","век","веко","вера","верк","вор","враг","врач","гаер","гаечка","го","гора","горе","горка","горчак","грач","грек","греча","гречка","кагор","кара","карга","каре","кача","кег","ковер","ковчег","кора","корча","корчага","кочегар","кочерга","крага","кров","овечка","овраг","овчар","овчарка","ор","орава","орк","очаг","очерк","рак","ре","рев","река","речка","ров","рог","рогач","рок","чага","чаек","чакра","чара","чарка","чек","чека","черва","чрево"],"полуостров":["вол","волос","вопрос","вор","ворот","ворс","лот","лото","лотос","олово","оплот","опор","опорос","опрос","опт","опус","ор","осот","остов","остолоп","остров","отлов","отлуп","отпор","плов","плот","плут","поворот","повтор","пол","поло","порт","посол","пост","посул","пот","просо","просол","прус","прут","пул","пуло","ров","рол","ропот","рост","рот","русло","руст","слово","слот","соло","сопло","сор","сорт","спор","спорт","спрут","спурт","ствол","створ","стол","столп","стопор","строп","струп","стул","ступор","суп","топ","топор","тор","торлоп","торос","торс","троп","трос","труп","трус","тур","улов","упор","упорство","ус","утор","утро"],"кресало":["ас","аскер","елка","кал","каре","кол","колер","кора","коса","креол","кресло","лак","лар","ларек","лерка","лес","леса","леска","лесок","лоск","окрас","ор","орел","орк","оса","осек","осел","оскал","оскар","рак","раскол","ре","река","рок","рол","роса","саек","сак","саке","сало","село","сера","серко","скало","склера","скол","сок","солка","сор","срок"],"скваттер":["акт","актер","арест","ас","аскер","аскет","ваер","вар","ватт","век","вера","верк","верста","верстак","верстка","вес","вест","ветка","каре","карст","карт","кастет","катер","катет","квартет","квас","кета","крест","рак","ре","рев","река","саек","сак","саке","сват","сверка","свет","сев","севр","секта","сера","серв","сет","сетка","скат","сквер","старт","стек","стека","стерва","тавр","такт","театр","текст","теракт","терка","тес","тесак","теска","тест","тета","тетка","трак","тракт","траст","трек","треск","треска","трест","треста"],"полуулыбка":["аул","бак","бал","балл","балок","балык","баул","блок","боа","бок","бокал","бола","бук","бука","булка","булла","бык","кал","клоп","клуб","кобыла","кол","колба","копал","копыл","куб","купа","купол","лак","лоб","луб","лук","лука","лупа","лыко","опак","опал","паб","пак","паук","пол","пола","полба","полк","полка","полубак","пук","пул","пула","пуло","пыл","укол","улыбка"],"левретка":["акт","актер","ваер","вал","валек","валер","валет","вар","веер","век","вера","верк","вертел","ветер","ветка","ветла","елка","кал","каре","карт","картвел","катер","кета","кларет","клев","клевер","клевета","клеврет","клеевар","лавр","лак","лар","ларек","лев","левак","леер","лерка","лет","рак","ре","рев","река","реле","тавр","талер","телек","телка","терка","трак","трал","трек","трелевка"],"выборность":["бон","боны","бор","боров","борт","борть","бостон","бот","бровь","бронь","быт","вонь","вор","ворон","ворот","ворс","выбор","выброс","вынос","высь","выть","новость","новь","норов","нос","обнос","обрыв","обрывность","ор","особь","осот","остов","остров","ость","ось","отбор","отброс","относ","отрыв","робость","робот","ров","ровность","рост","рот","рысь","сбор","сборы","сбыт","сноб","сныть","собор","сон","сор","сорт","соты","срыв","створ","стон","сын","сыр","сырт","сырть","тон","тор","торос","торс","трон","трос","тын"],"подбутовка":["ад","акт","аут","бак","боа","бок","бот","ботва","будка","бук","бука","буква","бут","вода","водка","до","добавок","док","дока","дуб","дубок","дукат","капот","капут","катод","квота","код","кода","копт","кот","куб","куда","купа","обвод","обводка","обдув","обдувка","обкат","обод","обувка","овод","ода","око","окова","окоп","окот","опак","опт","отвод","отводка","откуп","отпад","паб","паводок","падуб","пак","пакт","пат","паук","побудка","повод","подкова","подток","пот","поток","пуд","пук","табу","тако","ток","топ","топка","туба","увод","удав","упад","упадок","утка","уток"],"формалист":["аист","аорист","артос","арфист","ас","атом","ил","илот","ирмос","ислам","истома","лар","лафит","лимфа","лис","лиса","лист","литр","лиф","лифт","лом","лори","лот","маис","маоист","марс","март","масло","мат","матрос","ми","мир","мирт","мирта","митра","миф","мол","мор","моралист","морс","морф","мост","олифа","омар","ор","орфист","оса","офис","офит","рамс","рис","ритм","риф","рифма","рол","ром","роса","рост","рот","рота","сало","сатир","сафлор","си","сила","сирота","ситар","сито","ситро","слом","слот","смола","смотр","сом","сома","сор","сорит","сорт","сота","софа","софит","срам","стирол","стол","строфа","тариф","тимол","тир","тис","тиф","том","тор","торс","торф","трал","трио","трос","фа","фал","фарс","фарт","фат","фиал","фиат","фила","фирма","фита","флат","флирт","флора","флорист","флот","фол","фора","форма","формат","форс","форт","фтор"],"скульптура":["акт","альт","ас","аул","аут","кал","капут","карп","карст","карт","крап","круп","крупа","кулуар","куль","культ","культура","купа","курс","курта","куст","кустарь","кутас","лак","лар","ларь","латук","лук","лука","лупа","пак","пакт","палтус","пар","парк","парус","пас","паск","пасть","пат","патруль","паук","плут","прус","прусак","прут","псарь","пук","пул","пула","пулька","пульс","пульт","пурка","пуск","пустула","путь","рак","рапс","рать","раус","раут","рука","руль","русак","руст","русь","рута","сак","сап","скальп","скат","скаут","скрап","скула","скуп","спрут","спурт","сталь","струп","стук","стул","ступа","ступка","сук","сука","суп","сура","суть","тальк","трак","трал","трап","труп","трус","туаль","тулук","тулуп","тур","тура","турка","укус","улар","улус","ультра","урал","ус","уста","усталь","уступ","уступка","утка","утруска"],"синтетика":["аист","аистник","акт","анис","ант","ас","аскет","астеник","атеист","аттик","ик","икание","инки","иск","искание","истина","каинит","кант","кастет","катет","кета","кисет","киста","кит","китаист","наитие","наст","натек","натес","натиск","нитка","саек","сак","саке","сан","сани","санки","сатин","сатинет","секта","сектант","сенат","сени","сет","сетка","си","сиенит","синтетик","сити","скат","скена","скитание","стан","стек","стека","стена","стенка","такси","такт","танк","танкист","теин","теист","текст","тени","тент","тес","тесак","тесина","теска","тест","тета","тетка","тик","тикание","тина","тис","тиски","титан","титаник"],"апоцентр":["ант","ацетон","енот","напор","нерпа","нота","опера","опт","ор","отец","отцеп","пан","панер","пар","пат","патер","патрон","пена","перо","понт","понтер","пора","порт","пот","потерна","праотец","процент","ранет","ранец","рант","ре","рента","репа","рот","рота","таец","танец","танцор","тапер","тенор","терн","терц","тон","топ","тор","торец","трап","треп","трепан","трон","троп","тропа","цена","цент","центр","цеп"],"солдатик":["ад","аист","акт","ас","даос","диск","до","док","дока","дол","доска","идол","ик","икота","ил","илот","иод","иск","истод","исток","кадило","кал","катод","кила","кило","кислота","киста","кит","клад","код","кода","кодла","кол","колит","коса","кости","кот","лад","ладо","лак","ластик","лик","лис","лиса","лиска","лист","листок","литка","лодка","лоск","лот","ода","оклад","оксид","оса","осадки","оскал","ослик","отсидка","сад","садик","садок","сак","салки","сало","си","сикл","сила","силок","сито","скало","скат","скатол","склад","скол","скот","слиток","слот","сода","содалит","сок","солдат","солка","сота","сотка","стадо","стилка","сток","стол","столик","тако","такси","талик","тик","тис","ток","толк","толки","тоска"],"курлыкание":["акрил","акын","анкер","арлекин","арык","аул","елка","ерик","ик","икра","икры","ил","инула","каик","кал","калин","каникулы","каре","карелы","карлик","керн","кика","кила","кирка","клакер","клан","клен","клерк","клик","клика","клинкер","клир","клык","кран","краник","крен","крик","крикун","кринка","крылан","крынка","кукан","кукла","кулак","кулан","кулек","кулик","кулинар","кун","куна","кунак","курилка","лак","лар","ларек","лен","лерка","лик","ликер","лук","лука","луна","лунка","нары","нерка","нукер","рак","ре","река","руина","рука","рулена","руна","рык","рыкание","укание","улан","улар","улика","урал","уран","урина","урна"],"полузащита":["азиат","азот","азу","аозт","аул","аут","зал","зала","залп","запал","защип","защита","зло","зола","ил","илот","лапа","лапища","лапта","лапти","лата","липа","лоза","лопата","лот","луза","лупа","оаз","опал","опала","оплата","опт","отлуп","отпал","паз","пат","пауза","пиала","пила","пилот","пища","плаз","плата","плато","плащ","плита","плот","плут","поза","пол","пола","полати","пот","пуаз","пузо","пул","пула","пуло","пуща","таз","тип","толпа","толща","топ","топаз","туз","улит","уплата","щи","щит","щуп"],"подбрюшник":["бидон","бирюк","бок","бон","бор","брод","брюки","брюшко","бюро","дно","до","док","дорн","дрок","ик","индюк","инок","иод","ион","ирод","кино","код","кон","копир","корд","крюшон","кюрин","норд","ню","обдир","одр","ор","орк","пик","пикон","пинок","пион","пир","пони","пошиб","прок","пшик","род","родник","рок","рюш","ши","шик","шип","шок","шорник","шпик","шпион","шпон","шпор","шпорник","юниор","юнкор","юр","юрок"],"аморализм":["аларм","алмаз","ара","зал","зала","замор","зима","зло","зола","излом","измол","ил","имам","лама","ламаизм","лар","лоза","лом","лори","мазар","мала","мама","маоизм","мара","маразм","марал","ми","миазм","мим","мимоза","миома","мир","мирза","мол","мор","морализм","оаз","омар","ор","разлом","размол","рама","риза","роза","рол","ром"],"нечеткость":["енот","кетч","кон","конь","кость","кот","нос","ночь","октет","осек","осень","ость","ось","отек","отсек","отсчет","отчет","очес","сено","сень","сет","сеть","скетч","скот","скотч","снеток","сок","сон","сонет","сочень","стек","сток","стон","счет","текст","тенек","тент","тень","тес","тест","тесто","тесть","течь","ток","тон","тост","чек","чеснок","честь","четкость","четность"],"аркебузир":["абрек","азу","азур","арбуз","аркебуз","бак","бар","барк","барри","бек","бекар","бирка","бра","брак","бракер","бриз","буер","буерак","буза","бук","бука","бур","бура","бурак","бурка","бурки","бурре","ерик","зебра","зек","зуб","зубр","зуек","ибер","иберка","изба","ик","икра","каре","кариб","кеб","краб","крез","криз","круиз","куб","раб","разруб","рак","ре","резак","резка","река","риза","рубка","рубрика","рука","узбек","узбеки","узик","указ","урез","урезка"],"тромбонист":["бимс","бином","бинт","бит","бон","бор","борт","бостон","бот","бритт","бром","ион","ирмос","ми","минор","мир","мирт","монист","монисто","монитор","монстр","мор","морс","мост","мотор","моторист","нимб","нос","обмин","обнос","обои","ор","осмотр","осот","остит","отбор","отброс","отит","относ","рис","ритм","робот","ром","ромб","рост","рот","сбор","си","сито","ситро","смотр","сноб","собор","сом","сон","сонм","сор","сорбит","сорит","сорт","стон","стрит","тир","тис","титр","тмин","том","тон","тор","торит","торос","торс","торт","тост","трином","трио","тритон","тромб","тромбон","трон","трос","трот"],"постановка":["аванпост","аванс","акант","аксон","акт","ант","ас","вакса","ванта","вата","ватка","вона","воск","восток","канат","канва","кант","капа","капот","каптан","каста","квант","квас","квота","кон","копна","копт","коса","кот","накат","наст","нос","носок","нота","нотка","окно","око","окова","окоп","окот","октава","опак","опаска","опт","оса","осака","осанка","основа","осока","осот","оспа","остановка","остов","отава","откос","относ","пава","пак","пакт","пан","панк","пантовка","пас","паск","паста","паства","пат","патан","патока","покос","понос","понт","пост","постав","поставка","пот","потасовка","поток","псовка","саван","савка","сак","саква","сан","сап","сапа","сапка","сван","сванка","сват","скат","скоп","скопа","скот","сновка","сноп","сноповка","сова","совка","совок","сок","сон","соната","сопа","сопка","сота","сотка","ставка","стакан","стан","станок","сток","стон","стопа","стопка","тако","такса","танк","тапка","тасовка","ток","тон","топ","топка","тоска"],"опрятность":["нос","опор","опрос","опт","ор","осот","ость","ось","относ","отпор","понос","понт","порт","пост","пот","пояс","пронос","просо","протон","пряность","пясть","пятно","ропот","рост","рот","сноп","сон","соня","сор","сорт","сотня","соя","спор","спорт","стон","стопор","строп","тон","тоня","топ","топор","топот","топь","тор","торос","торс","торт","тост","трон","троп","тропот","трос","трость","трот","яр","ярость","яс","ять"],"методика":["ад","акт","атом","дек","дека","дети","детка","диета","до","док","дока","дом","домик","еда","едок","ик","икота","иод","кадет","катод","кета","кит","код","кода","ком","кома","комета","коми","кот","мак","макет","маки","мат","мед","медиа","медик","мета","метка","метод","метода","ми","мода","мотка","ода","омет","отек","тако","тема","тик","ток","том","томик"],"самобранка":["абак","аксон","амбар","амбра","ара","араб","арабка","арак","арба","арка","аркан","ас","бак","банк","банка","бар","барак","баран","баранка","баранок","барк","барка","баркан","баркас","барон","барс","бас","баск","баска","басма","басок","басон","боа","бок","бокс","бон","бона","бор","бора","бра","брак","брас","бром","кабан","камса","кара","карма","карман","кобра","ком","кома","комар","комара","кон","кора","коран","корм","корма","коса","краб","кран","краса","крона","мак","мана","манка","манок","мара","маран","марка","марс","маска","маскарон","масон","мор","морс","мрак","набор","накра","нарком","насморк","нома","норка","норма","нос","обман","обманка","окрас","омар","ор","орк","оркан","оса","осака","осанка","оскар","осман","османка","раб","раба","рак","рама","рамка","рамс","рана","ранка","раса","роба","рок","ром","роман","романс","ромб","роса","саам","саамка","саба","сабан","сабо","сак","сакман","саман","самар","самба","самбо","самка","сан","сарана","саркома","сбор","сбора","сборка","скарб","скарн","скоба","скорм","смак","сноб","собака","сок","сом","сома","сон","сонм","сор","срам","срок"],"легкоатлет":["акт","атлет","атолл","галл","гетто","глот","глотка","го","гол","елка","кал","катет","кег","кета","кол","колет","коллега","кот","котел","котлета","лаг","лак","легат","лекало","лет","лето","леток","лог","лот","октет","отек","отел","откат","отлет","тако","такт","телега","телек","телка","тело","телок","тета","тетка","тога","ток","толк"],"болгарин":["арго","аргон","багор","бал","бар","барин","барон","било","благо","блин","боа","бог","боинг","бола","бон","бона","бор","бора","бра","бриг","гирло","глина","глобин","го","гобан","гоби","гоблин","гол","гон","гора","горб","горбина","горин","горлан","горн","граб","грабли","гран","гриб","гроб","игла","иго","игра","ил","ион","ирга","лаг","лар","лига","лоб","лобан","лог","лори","набор","наиб","налог","нигрол","нога","онагр","ор","орган","орлан","раб","ранг","ринг","роба","рог","рол"],"отвержение":["веер","вено","веретено","ветер","вето","вино","винт","воин","вор","вторжение","евреи","еж","енот","жернов","жетон","живот","жир","жор","ион","неверие","неврит","нерв","нож","овен","овин","ор","рвение","ре","рев","ренет","ров","роение","рот","твержение","твин","творение","теин","тени","тенор","терн","тернев","тир","тире","тон","тор","трение","трио","троение","трон"],"каторжанин":["ажан","акант","аконит","акт","анион","ант","аорта","ара","арак","арка","аркан","арника","жакан","жанр","жар","жара","жарок","жатка","жинка","жир","жирок","жор","ик","икона","икота","икра","инок","ион","иранка","канат","канна","канон","канонир","кант","кантон","кантор","кантри","кара","карантин","карат","каротаж","каротин","карт","карта","картина","картон","картонаж","катион","кино","кит","кожа","кон","конина","контра","кора","коран","корж","корт","кот","кража","кран","кроат","крона","крот","нажин","наин","накат","накра","нанка","наркотин","нарта","натирка","натрон","нитка","нож","ножик","ножка","нона","норка","норник","нота","нотка","окарина","окраина","ор","орк","оркан","отара","раж","рак","ракита","рана","ранка","рант","ратин","ратник","ржанка","рожа","рожки","рок","ронжа","рот","рота","ротик","тако","танин","танк","тара","таран","тиара","тик","тина","тир","тираж","тиран","ток","тон","тоник","тоника","тонина","тонна","тоннаж","тор","трак","трико","трио","трок","трон"],"пронимание":["ампер","ампир","анемон","анион","аноним","ион","манер","мена","мера","мерин","ми","мина","минер","мини","минор","минреп","мир","мор","море","морена","наем","наин","намин","напор","неон","нерпа","нома","номер","нона","норма","омар","опера","ор","памир","пан","панер","панно","пар","пари","паром","пена","пенни","перина","перо","пианино","пиар","пим","пина","пинна","пион","пионер","пир","поем","помин","поминание","пони","понимание","пора","прием","прима","проем","промин","проминание","ре","рема","репа","репина","ром","роман"],"проножка":["жанр","жар","жарок","жопа","жор","капор","капрон","карп","кожа","кон","копна","кора","коран","корж","корона","кран","крап","крона","напор","нож","ножка","норка","окно","око","окоп","опак","опор","опора","ор","орк","оркан","орок","паж","пак","пан","панк","пар","парк","парок","пожар","пора","порка","порок","прок","раж","рак","рожа","рожок","рожон","рок","ронжа","ропак"],"браконьер":["абрек","анкер","бак","бакен","банк","бар","барк","барон","барьер","бек","бекар","бекон","боа","боек","бок","бон","бона","бор","бора","бра","брак","бракер","брань","брокер","бронь","ерь","каре","карьер","кеб","керн","кобра","кон","конь","кора","коран","корень","корь","корье","краб","кран","крен","крона","набор","небо","нерка","норка","океан","ор","орарь","орк","оркан","раб","рак","рань","ре","ребро","река","роба","рок","рокер"],"подалириус":["ад","ас","аспид","аул","даос","дар","даур","до","дол","драп","дуло","дупло","дура","идол","ил","иод","ирис","ирод","иуда","лад","ладо","лар","липа","лис","лиса","лопари","лорд","лори","луидор","лупа","ода","одр","одул","опал","опус","ор","орда","оса","оспа","падло","пар","пари","пароли","парус","пас","пиар","пила","пир","пирс","плис","плод","пол","пола","полис","полуда","пора","посад","посуда","посул","прасол","пруд","прус","пуд","пудра","пул","пула","пуло","радио","радиус","рапс","рапсод","распил","расплод","раус","рипус","рис","род","рол","роса","руда","русло","сад","сало","салоп","сап","сард","си","сидр","сила","силур","сироп","слип","сода","сопа","сопли","сор","спад","спил","спор","спора","суд","суп","сура","удар","удила","удило","удол","улар","упад","упор","урал","урод","ус"],"петрограф":["арго","гаер","гарт","герр","гетра","го","гора","горе","гофр","гофре","граф","грот","опера","опт","ор","пар","партер","парторг","пат","патер","перга","перо","пора","порт","портер","пот","претор","прогар","рапорт","ре","репа","рог","рот","рота","тапер","тога","топ","тор","торг","торф","трап","треп","трог","троп","тропа","фа","фагот","фарт","фат","фетр","фогт","фора","форт","фраер","фрегат","фтор"],"малоснежье":["ас","еж","ель","жало","желе","желна","жена","лаж","лань","лен","лень","лес","леса","ложа","ложе","ложь","лом","лонжа","лось","манеж","масло","масон","межа","мел","мелос","мель","мена","мол","моль","мосье","мсье","наем","намол","нельма","нож","ноль","нома","нос","олень","омела","оса","осел","осень","осман","ось","сажень","сало","салон","сан","селен","село","сель","сема","семена","семь","сено","сень","слом","слон","смена","смола","смоль","соль","сом","сома","сон","сонм"],"рассольник":["акрил","аксон","анис","ас","ик","икона","икра","ил","илька","инок","ион","иск","искра","кал","калин","каолин","кассир","кила","кило","киль","кино","клан","класс","клир","клирос","клон","кол","кон","конь","кора","коран","корь","коса","косарь","кран","криль","кроль","крона","кросс","лак","лань","лар","ларь","лассо","лик","линкор","линкос","линь","линька","лис","лиса","лиска","лори","лосина","лоск","лось","насос","нолик","ноль","норка","нос","носарь","носик","окись","окрас","оникс","ор","орк","оркан","орлан","оса","осина","осинка","оскал","оскар","ослик","ось","рак","рань","раскол","раскос","рассол","рис","риск","риска","рок","рол","ролик","роль","роса","росинка","сак","сакс","салки","сало","салон","сальник","сан","сани","санки","си","сиаль","сикл","сила","силок","силон","силос","силь","синь","синька","синьор","синьора","сиська","скало","скань","скарн","склон","скол","слон","слоник","снос","сноска","сок","солка","соль","сон","сор","соринка","соска","сосна","срок","ссора"],"гидропульт":["гид","гиль","гирло","гит","глот","го","год","гол","гриль","грот","грудь","гул","гурт","диоптр","до","дог","дол","долг","друг","дуло","дупло","дурь","иглу","иго","идол","ил","илот","иод","ирод","итог","литр","лог","лорд","лори","лот","луг","луидор","огпу","одр","одул","одурь","опт","ор","отгул","отлуп","пилот","пир","пирог","плод","плот","плоть","плуг","плут","пол","порт","пот","потир","потуги","прогул","пруд","прут","пуд","пул","пуло","пульт","путь","рог","род","рол","роль","рот","руль","рутил","тигр","тип","тир","толь","топ","топь","тор","торг","торги","трио","триод","триодь","триоль","трип","трог","троп","труд","труп","тур","угол","уголь","угорь","удило","удол","улит","упор","урод","утиль","утор","утро"],"картушка":["акт","актау","ара","арак","арка","аура","аут","кара","карат","карт","карта","картуш","катушка","каша","кашка","крутка","кукша","курта","куртка","куш","кушак","рак","ракуша","ракушка","ракша","ратуша","раут","рука","рута","тара","трак","тур","тура","турка","туш","туша","тушка","укатка","утка","ушат","шар","шкура","шкурка","штука","шут","шутка"],"экспромт":["ком","копт","корм","корт","кот","крот","мопс","мор","морс","мост","мэр","мэтр","опт","ор","орк","порт","пост","пот","поэт","прок","пэр","рок","ром","рост","рот","рэп","скоп","скорм","скот","смотр","сок","сом","сор","сорт","спор","спорт","срок","сток","строп","сэр","ток","том","топ","тор","торс","трок","тромп","троп","трос","тэк","экспорт","эмо","эпос","эрот","эскорт"],"подпилка":["ад","до","док","дока","дол","идол","ик","ил","иод","кадило","кал","кила","кило","кипа","клад","клип","клоп","код","кода","кодла","кол","копал","лад","ладо","лак","лик","липа","липка","лодка","ода","оклад","опак","опал","опилка","падло","пак","пик","пика","пикап","пила","пилка","пипка","плод","подпал","подпил","поилка","пол","пола","полип","полк","полка","поп","попка"],"мужичонка":["жим","жинка","жук","жучок","ик","икона","инок","ион","камин","кино","кожа","ком","кома","коми","кон","кочан","кум","кума","кумач","кумжа","кун","куна","куча","мак","маки","маниок","манок","ми","мина","моча","мочка","муж","мужик","мужичок","мужчина","мука","мучник","нажим","нож","ножик","ножка","нома","ночка","онуча","очинка","очки","очник","уж","ужимка","ужин","ум","умник","учан","чан","чиж","чин","чина","чинка","чужак","чум","чума"],"славистка":["аист","акт","актив","ас","атлас","вакса","вал","валик","вассал","вата","ватка","вилка","вис","влас","власти","ива","ик","ил","иск","кал","касса","каста","квас","кила","киста","кит","класс","лава","лавка","лак","ласа","ласка","ласта","ластик","лата","лик","лис","лиса","лиска","лист","листва","литвак","литка","савка","сак","саква","сакс","салат","салатик","салки","свалка","свастика","сват","свист","свита","свитка","си","сикл","сила","скала","скат","слава","славист","славка","сласти","слив","слива","сливка","ставка","стилка","такса","такси","талик","тик","тис"],"гастроли":["аист","аорист","арго","артос","ас","галиот","галс","гарт","гирло","гит","глас","глист","глиста","глот","го","гоист","гол","гора","грот","игла","иго","игра","ил","илот","ирга","итог","лаг","лар","лига","лис","лиса","лист","литр","лог","логист","лори","лот","ор","оса","рис","рог","рол","роса","рост","рот","рота","саго","сало","сатир","си","сиг","сила","сирота","ситар","сито","ситро","слог","слот","сор","сорит","сорт","сота","стирол","стог","стол","тигр","тир","тис","тога","тор","торг","торги","торс","трал","трио","трог","трос"],"неваляшка":["анклав","аянка","вал","валек","век","вена","веня","вешалка","вешка","веялка","елка","кал","калан","канал","канва","каша","кашне","квашня","кеш","клан","клев","клен","клеш","клешня","лава","лаваш","лавка","лак","ланка","лев","левак","левша","лен","лея","ля","навал","накал","наклев","неявка","шавка","шакал","шала","шалевка","шванк","швея","шелк","шен","шея","шкала","шквал","шлак","шлевка","шленка","шлея","шнек","шнека","шнява","яванка","явка","як","ял"],"канталупка":["акант","акт","актау","акула","ант","атака","аул","аут","кал","калан","канал","канат","кант","канталупа","капа","капкан","каплун","каптан","каптана","капут","каталка","катанка","клака","клан","клапан","кнут","кукан","кукла","кулак","кулан","кун","куна","кунак","купа","лак","ланка","лапа","лапка","лапта","лата","латук","лук","лука","луна","лунка","лупа","накал","накат","наука","нут","пак","пакт","палата","палатка","палка","пан","панк","пат","патан","патанка","паук","плакат","плакун","план","планка","плата","платан","плаун","плут","пуант","пук","пул","пула","пункт","танк","тапка","тукан","тун","туна","укатка","улан","уланка","уплата","утка"],"государь":["ад","арго","ас","гад","гарус","гарь","го","год","гора","град","градус","груда","грудь","гурда","гусар","гусь","даос","дар","даур","до","дог","досуг","дрога","друг","дуга","дура","дурь","ода","одр","одурь","ор","орда","оса","ось","рагу","раус","рог","род","роса","руда","русь","саго","сад","сард","сода","сор","суд","сударь","сура","угар","угода","угорь","удар","урод","ус"],"персонаж":["ас","еж","жанр","жар","жена","жопа","жор","напор","нерпа","нож","нос","опера","ор","оса","оспа","паж","пан","панер","пар","пас","пена","пенс","пеонаж","перо","персона","пес","песо","пожар","пора","раж","рапс","ре","репа","репс","рожа","ронжа","роса","сан","сап","сапер","сено","сера","серна","серп","сноп","сон","сопа","сор","спор","спора"],"гнилушка":["агул","аул","ашуг","галун","глина","гул","гулин","игла","иглу","ик","ил","инула","ишак","кал","калин","кила","клан","клуша","книга","куга","кулан","кун","куна","кунг","куш","лаг","лагун","лак","лгун","лига","лик","луг","лук","лука","луна","лунка","нагул","ниша","нуга","улан","улика","ушан","ушник","шаг","шалун","ши","шик","шина","шлаг","шлак","шланг","шуга"],"секстильон":["ель","ельник","енот","ик","ил","илот","инок","ион","иск","исток","кельн","кельт","кессон","кило","киль","кино","киносеть","кисель","кисет","кистень","кисть","кит","китель","клен","клест","клеть","клиент","клон","кол","колет","колит","колье","кольт","кон","конь","костел","кости","кость","кот","котел","лен","леность","лень","лес","лесник","лесок","лесс","лесть","лет","лето","леток","лик","линкос","линт","линь","лис","лист","листок","литье","лоск","лось","лот","неолит","никель","нилот","нить","нолик","ноль","нос","носик","носитель","окисел","окись","олеин","олень","оникс","осек","осел","осень","осетин","ослик","оссеин","ость","ось","отек","отел","отель","отсек","секс","сексот","селин","село","сель","сени","сено","сень","сет","сеть","си","сикл","силен","силок","силон","силос","силь","синель","синь","сито","склон","скол","скот","слет","слиток","слон","слоник","слот","снеток","снос","сок","солист","соль","сон","сонет","сотник","стек","стекло","стиль","сток","стол","столик","стольник","стон","теин","тело","телок","тельник","тени","тень","тес","тесло","тик","тис","тлен","ток","токсин","толк","толки","толь","тон","тоник"],"алебардник":["абак","абалкин","абердин","абрек","ад","акание","акрида","акрил","анкер","ара","араб","арак","арба","ареал","арека","арена","аренда","арка","аркан","арлекин","арника","бадан","баден","бадин","бак","бакалдин","бакен","баклан","бал","балда","балерина","балка","балкар","банда","банк","банка","банкир","бар","барак","баран","бард","бардак","барин","барк","барка","баркан","баркин","беда","бедра","бек","бекар","бел","белка","белки","бердан","берданка","берлина","бирка","бланк","блик","блин","бра","брак","бред","бредни","бренди","даба","дан","дар","дебил","дебри","дек","дека","декан","дерн","дилер","динар","длина","драка","дранка","дрек","дрена","еда","елка","ерик","ибер","иберка","идеал","ик","икебана","икра","ил","иранка","ирландка","кабан","кабаре","кабил","кабина","кадр","кал","калан","каландр","калибр","калин","калина","канал","кандела","кара","карабин","карбид","карда","кардан","кардинал","каре","кариб","кеб","кедр","керн","кила","клад","клан","клен","клир","краб","кран","крен","лад","ладан","лак","ланка","лар","ларек","лед","леди","ледник","лен","лерка","лиана","лидер","лик","ликер","надел","надир","наиб","накал","накра","нард","нардек","недра","нерка","раб","раба","рада","радиан","радикал","рак","рана","ранка","ре","редан","река"],"расточник":["аист","аконит","аксон","акт","анис","ант","аорист","аристон","артос","ас","ик","икона","икота","икра","инок","ион","иск","искра","исток","каноист","кант","кантор","кантри","каротин","карст","карт","картон","кастор","катион","кино","киста","кит","кон","контра","кора","коран","корт","корча","корчи","коса","косач","кости","костра","кот","кочан","кран","кроат","крона","крот","нарост","наст","натиск","нитка","ниточка","норка","нос","носик","нота","нотка","ночка","окрас","оникс","ор","орк","оркан","оса","осина","осинка","оскар","останки","очинка","очистка","очки","очник","рак","рант","ратин","ратник","рис","риск","риска","рок","роса","росинка","росичка","рост","рот","рота","ротик","сак","сан","сани","санки","сатин","сатир","сачок","си","сирота","сиротка","ситар","сито","ситро","скарн","скат","скот","скотина","скотч","сок","сон","сор","соратник","соринка","сорит","сорт","сота","сотка","сотник","срок","стан","станок","старик","старичок","стирка","сток","стон","сточка","строка","строчка","тако","такси","танк","тик","тина","тир","тиран","тис","ткач","ток","токсин","тон","тоник","тоника","тор","торс","тоска","точка","трак","транс","трико","трио","трок","трон","трос","чан","чароит","час","часик","часок","частник","чин","чина","чинар","чинка","чир","чирок","чистка"],"клирошанин":["акрил","анилин","анион","аршин","ик","икона","икра","ил","инки","инок","ион","ишак","кал","калин","канон","канонир","каолин","кила","кило","кино","клан","клир","клон","кол","кон","конина","кора","коран","кран","кринолин","крона","лак","лар","лик","линкор","лирик","лирика","лирник","лори","лошак","наин","наклон","ниша","нолик","нона","норка","норник","ноша","ор","орк","оркан","орлан","рак","рикша","рок","рол","ролик","шанкр","шар","шарик","ши","шик","шило","шина","шинник","ширина","ширинка","шкало","школа","шлак","шлир","шок","шорник"],"отпадание":["ад","адат","адепт","ант","антипод","дан","дата","депо","дети","детина","диета","дно","до","еда","енот","иод","ион","нота","ода","опадание","опт","отдание","отпад","падание","падина","пан","панда","пат","патан","педант","пена","пентод","петин","пина","пинта","пион","питон","подина","пони","понт","пот","теин","тени","тина","тип","тон","топ","топание"],"облакомер":["абрек","бак","бал","балок","бар","барк","бек","бекар","бел","белка","белок","беломор","блок","боа","боек","бок","бокал","бола","болеро","бор","бора","бра","брак","брелок","бром","елка","ермолка","кал","каре","кеб","кобра","кол","колба","колер","колоб","ком","кома","комар","кора","корабел","корм","корма","короб","краб","крем","креол","лак","лар","ларек","лерка","лоб","лобок","лом","ломбер","ломка","мак","маклер","малек","мел","мелок","мера","мерка","мол","молока","мор","море","морок","морока","мрак","обком","обкорм","облако","облом","обмер","обмерка","обмерок","обмол","обол","оборка","оброк","око","окоем","окрол","омар","омела","ор","орел","ореол","орк","орок","раб","рак","ре","река","рема","роба","рок","рол","ром","ромб"],"водоскат":["ад","акт","ас","вода","водка","воск","восток","даос","до","док","дока","доска","катод","квас","квота","код","кода","коса","кот","овод","ода","око","окова","окот","оса","осадок","осока","осот","остов","отвод","отводка","откос","отсадок","сад","садок","сак","сват","свод","сводка","скат","скот","сова","совка","совок","сода","сок","сота","сотка","стадо","сток","тако","ток","тоска"],"празеодим":["ад","азид","ампер","ампир","дар","деизм","депо","дерма","диез","до","доза","дом","домра","дормез","драп","дрема","еда","езда","зад","задор","заем","замер","замор","зампред","запор","зеро","зима","изомер","иод","ирод","мазер","мед","медиа","мездра","мера","мзда","ми","мизер","мир","мирза","мода","мопед","мор","морда","море","оаз","ода","одр","омар","опера","ор","орда","паз","памир","пар","парез","пари","паром","пемза","период","перо","пиар","пим","пир","подрез","поезд","поем","поза","позер","пора","порез","празем","приезд","прием","приз","призма","прима","проезд","проем","проза","радио","ре","рема","ремиз","репа","риза","род","роза","ром"],"обвислость":["било","бит","болт","боль","босс","бот","вис","вол","волос","волость","ил","илот","лис","лист","лоб","лосось","лось","лот","лото","лотос","облов","обои","обол","особь","осос","осот","остов","ость","ось","отбив","отлив","отлов","отсос","свиль","свист","си","сивость","силос","силь","сито","слив","слово","слот","соболь","солист","соло","соль","ствол","стиль","стильб","стол","столб","тис","толь"],"свекловод":["ввод","век","веко","вес","весло","вол","волк","волок","волос","воск","дек","дело","до","довесок","док","дол","досев","досол","едок","клев","код","кол","колесо","колос","лев","лед","ледок","лес","лесовод","лесок","лоск","овес","овод","око","осек","осел","оселок","осоед","свод","сев","севок","седло","седок","село","скол","след","слово","совок","сок","соло","солод"],"пестрядина":["ад","адепт","адрес","адряс","аист","анис","ант","арест","ария","ас","аспид","астения","дан","дар","деист","дерн","десант","десна","десятина","дети","детина","диарея","диета","динар","дитя","днепр","днестр","драп","дрена","еда","идея","надир","нард","нардист","нарпит","наряд","наст","натес","недра","нерпа","пан","панер","пар","пари","партия","паря","пас","пат","патер","паяние","педант","педиатр","пена","пенис","пенс","пенсия","пеня","перина","персия","перст","пес","песня","пест","петин","пиар","пиастр","пина","пинта","пир","пират","пирс","питер","прения","пресня","присед","прятание","псарня","псина","пята","радист","ранет","рант","рапс","распятие","ратин","рдест","ре","редан","редис","рента","репа","репина","репс","ретина","рея","рис","ряд","ряса","сад","сан","сани","сап","сапер","сард","сатин","сатинер","сатир","седина","сеид","сенат","сени","сепия","сера","серия","серна","серп","сет","си","сидерат","сидр","синап","сирен","сирена","ситар","снаряд","снятие","спад","спина","спинет","спирант","спирея","спирт","спринт","среда","средина","стадия","стан","стая","стеарин","стена","стенд","степ","стерин","стерня","тапер","тапир","таяние","теин","тени","терапия","терн","тес","тесина","тина","тип","тир","тиран","тире","тис","транс","трап","треп","трепан","трип","трясина","яд","яр","ярд","яс"],"чертилка":["акрил","акт","актер","елка","ерик","ик","икра","ил","кал","каре","карт","катер","качели","кета","кетч","кила","кит","кларет","клир","клич","лак","лар","ларек","ларчик","лерка","лет","летчик","лик","ликер","литер","литера","литка","литр","лич","рак","ре","река","реликт","речка","талер","талик","тарелки","телка","терка","терлик","течка","тик","тир","тире","ткач","трак","трал","трек","чаек","чал","чек","чека","челка","черт","черта","чертик","чета","четки","чир"],"карпенко":["анкер","анкерок","капер","капок","капор","капрон","каре","карп","кепка","керн","кнопка","кок","кока","кон","конек","конка","копна","кора","коран","корка","кран","крап","крен","креп","крона","напор","нерка","нерпа","норка","океан","опак","опека","опера","ор","орк","оркан","паек","пак","пан","панер","панк","пар","парк","парок","пекан","пена","пенка","перка","перо","покер","пора","порка","прок","рак","ре","река","репа","репка","рок","ропак"],"дорубание":["абердин","ад","анероид","баден","бадин","бар","бард","барин","барон","беда","бедра","бедро","бедуин","бенуар","бердан","бердо","бидон","боа","бодание","бон","бона","бор","бора","бра","бред","бредни","бренди","брод","будни","будра","буер","бунд","бур","бура","буран","бурда","дан","дар","даур","дебри","дерн","динар","дно","до","дорн","дрена","дуб","дубина","дура","дуриан","еда","ерунда","ибер","иод","ион","ирод","иуда","набор","надир","надруб","наиб","нард","народ","небо","недра","норд","обдир","обед","обида","ода","одр","одрина","ор","орда","орден","орудие","раб","радио","радон","раунд","ре","редан","роба","род","родина","рубин","руда","руина","руна","убор","удар","уран","урина","урна","урод","уродина","урон"],"машиновед":["ад","амвон","веда","вена","вено","вид","видео","вина","вино","вода","воин","вона","дан","дева","девон","демон","диван","диво","динамо","дно","до","дом","домен","домна","еда","ендова","ива","иод","ион","мед","медиа","мена","ми","мина","мода","мошна","наем","невод","нива","ниша","нома","номад","ноша","овен","овин","ода","ошва","шен","ши","шина","шмон","шов"],"душегрейка":["ад","акушер","ашуг","гад","гаер","гей","гейша","град","грек","груда","грудка","груша","гурда","дар","даур","дек","дека","дрек","друг","дуга","дура","дурак","душ","душа","еда","ерш","кадр","каре","кег","кедр","кеш","край","круг","куга","куда","курд","куш","рагу","рай","рак","ре","рей","рейд","рейка","река","решка","руда","рука","угар","удар","шаг","шар","шейк","шейкер","шкура","шуга"],"подмывание":["ад","амвон","веда","вена","вено","вид","видео","вина","вино","вода","воды","воин","вона","выем","вымоина","выпад","дан","дева","девон","демон","депо","диван","диво","динамо","дно","до","дом","домен","домна","домывание","дым","еда","ендова","ива","иод","ион","мед","медиа","мена","ми","мина","мода","мопед","наем","намыв","напев","невод","нива","нома","номад","овен","овин","ода","омывание","пан","пена","пиво","пим","пина","пион","подина","подмен","подмена","подмыв","подымание","поем","помин","понева","пони"],"посконина":["аксон","анион","анис","анонс","ас","ик","икона","инок","ион","иск","канон","кино","кипа","кон","конина","копна","коса","наин","нанос","нона","нос","носик","носок","окно","око","окоп","оникс","опак","описка","оса","осина","осинка","осока","оспа","оспина","пак","пан","панк","панно","пансион","пас","паск","пик","пика","пикан","пикон","пина","пинна","пинок","пион","писк","поиск","покос","пони","понос","псина","сак","сан","сани","санки","сап","сапонин","си","синап","скип","скоп","скопа","сноп","сок","сон","сонник","сопа","сопка","спина","спинка"],"лестность":["ель","енот","лен","леность","лень","лес","лесс","лесть","лет","лето","лось","лот","ноль","нос","олень","осел","осень","ость","ось","отел","отель","отлет","село","сель","сено","сень","сет","сеть","слет","слон","слот","снос","соль","сон","сонет","стол","стон","тело","тент","тень","тес","тесло","тест","тесто","тесть","тлен","толь","тон","тост"],"перевозчик":["веер","век","веко","верк","вече","вечер","вечерок","взор","воз","возчик","вор","врез","евреи","ерик","зверек","зев","зевок","зек","зеро","зов","ик","ирокез","кепи","кивер","ковер","копир","корчи","крез","креп","криз","кров","ор","орк","очерк","очки","перо","перчик","пивко","пиво","пик","пике","пир","позер","покер","порез","почерк","почки","привоз","приз","прок","ре","рев","резчик","ров","ровик","рок","чек","череп","черепок","чип","чир","чирок","чрево"],"пустышка":["акт","ас","аут","капут","купа","куст","кутас","куш","пак","пакт","пас","паск","пат","паук","пук","пуск","путы","пушка","пшат","пытка","пышка","сак","сап","скат","скаут","скуп","стук","ступа","ступка","стык","сук","сука","суп","суша","сушка","сыта","туш","туша","тушка","ус","уста","утка","ушат","шпат","штука","штык","штыка","шуст","шут","шутка"],"скейтборд":["бедро","бей","бейт","бек","бердо","бес","боек","бой","бок","бокс","боксер","бор","борт","боскет","бот","ботдек","бред","брест","брод","дек","декор","до","док","докер","дрек","дрок","едок","йод","йот","кеб","кедр","кейс","код","корд","корсет","корт","костер","кот","кредо","крест","крой","крот","обед","обет","одр","ор","орк","осек","осетр","отек","отсек","рдест","ре","рей","рейд","рейс","род","рой","рок","рост","рот","сбой","сбор","сброд","седок","сектор","серб","серко","сет","скейт","скот","сок","сор","сорт","срок","стек","сток","стокер","строй","тес","тодес","той","ток","тор","торс","трек","треск","трок","трос"],"сокредитор":["деист","дек","декор","деррик","дети","дикорос","диктор","директор","диск","до","док","докер","доктор","дрек","дрок","дротик","едок","ерик","ик","иод","ирод","иск","истод","исток","кедр","киото","кисет","кит","код","корд","коридор","короед","корсет","корт","костер","кости","кот","кредит","кредитор","кредо","крест","крот","одр","око","окот","оксид","ор","ордер","орк","оркестр","орок","осек","осетр","осоед","осот","острие","отек","откос","отроек","отрок","отсек","рдест","ре","редис","рекорд","рекордист","ректор","рис","риск","ритор","род","родео","родос","рок","рокер","рокот","рост","росток","ростр","рот","ротик","ротор","седок","сеид","сектор","серко","сет","си","сидр","сито","ситро","скирд","скот","сок","сор","сорит","сорт","сортир","срок","стек","сток","стокер","тес","тик","тир","тире","тис","тодес","ток","тор","торос","торс","трек","треск","триер","трико","трио","триод","трок","трос"],"делячество":["вес","весло","вест","вето","вече","вол","воля","двоетес","дело","до","дол","доля","досев","дятел","лев","лед","лес","лесовед","лет","лето","лея","лот","ля","овес","осел","отвес","отдел","отел","отсев","очес","свет","светоч","свод","сев","седло","село","сет","след","слет","слот","совет","солея","соя","ствол","стол","счет","тело","тес","тесло","тля","тодес","толчея","чело","яд","ял","яс","яство"],"самотек":["акт","ас","аскет","атом","кета","ком","кома","комета","коса","кот","мак","макет","мат","место","мета","метка","мост","мотка","омет","оса","осек","отек","отеска","отсек","саек","сак","саке","секта","сема","сет","сетка","скат","скот","смак","смета","смотка","сок","сом","сома","сота","сотка","стек","стека","сток","тако","тема","тес","тесак","теска","ток","том","тоска"],"наркоман":["ара","арак","арка","аркан","канна","канон","кара","карма","карман","ком","кома","комар","комара","кон","кора","коран","корм","корма","кран","крона","мак","мана","манка","манна","манок","мара","маран","марка","мор","мрак","накра","нанка","нарком","нома","нона","норка","норма","омар","ор","орк","оркан","рак","рама","рамка","рана","ранка","рок","ром","роман"],"корректура":["акт","актер","аут","каре","карт","картер","катер","катерок","каток","кета","кок","кока","кора","корка","корт","кот","кратер","кроат","крокет","крот","крутка","куратор","курок","курорт","курта","куртка","куток","кутора","ор","орк","отек","рак","раут","ре","реактор","река","рекрут","ректор","рок","рокер","рот","рота","рука","рута","тако","терка","террор","ток","тор","трак","траур","трек","трок","туер","тур","тура","турка","турок","укор","уретра","урок","утка","уток","утор","уторка","утро"],"заплетание":["азан","азиат","анализ","ант","зал","зала","залет","залп","запал","зенит","зет","зилант","излет","ил","лазание","ланита","лапа","лапина","лапта","лапти","лата","лен","лента","лепет","лепта","лет","летание","летие","лиана","линза","линт","липа","налеп","налет","низ","паз","палатин","пан","пат","патан","пелена","пена","пенал","пение","петин","пиала","пила","пина","пинта","плаз","план","планета","плата","платан","платина","плен","плена","плита","таз","теин","тени","тина","тип","тлен","тление"],"проступок":["копт","корпус","корт","кот","крот","круп","купорос","курс","куст","око","окоп","окот","опор","опрос","опт","опус","ор","орк","орок","осот","откос","откуп","откус","отпор","отпуск","отрок","покос","поп","порок","порт","пост","поступок","пот","поток","потоп","прок","прокоп","прокос","прокус","пропс","пропуск","просо","проток","прус","прут","пук","пуп","пупок","пупс","пуск","рок","рокот","ропот","рост","росток","рот","руст","скоп","скот","скуп","сок","сор","сорт","спор","спорок","спорт","спрут","спурт","срок","сток","стопор","строп","струп","стук","ступор","сук","суп","суппорт","сурок","ток","топ","топор","тор","торос","торс","трок","троп","трос","труп","трус","тур","турок","укор","укос","укроп","упор","урок","ус","уток","утор","утро"],"десантник":["ад","аист","акт","анис","ант","ас","аскет","астеник","дан","деист","деистка","дек","дека","декан","денник","дентин","десант","десикант","десна","дети","детина","детка","диета","диск","дискант","дискета","еда","ик","индекс","иск","кадет","кант","кета","кисет","киста","кит","наин","наст","натек","натес","натиск","ненка","нитка","сад","садик","саек","сак","саке","сан","сани","санки","сатин","седина","сеид","секта","сенат","сени","сет","сетка","си","скат","скена","стан","стек","стека","стена","стенд","стенка","такси","танин","танк","теин","тени","теннис","тенниска","тес","тесак","тесина","теска","теснина","тик","тина","тис"],"картошка":["акт","аорта","ара","арак","арка","какао","кара","карат","карт","карта","каток","каша","кашка","кок","кока","кора","корка","корт","кот","кошара","кошка","кроат","кроатка","крот","крошка","ор","орк","отара","рак","ракша","рок","рот","рота","тако","тара","ток","тор","трак","трок","шар","шкот","шок","шот","шрот","штакор","штора","шторка"],"параметрит":["ампер","ампир","апатит","ара","арап","ариетта","артрит","мара","март","мат","мера","мета","метр","метрит","ми","мир","мирр","мирт","мирта","митра","памир","пар","пара","параметр","пари","паритет","парта","партер","пат","патер","патера","петит","пиар","пим","пир","пират","питер","питта","прием","прима","примат","пример","примета","рама","рампа","рапа","рапира","раритет","ре","рема","репа","ритм","тапер","тапир","тара","театр","тема","темп","термит","тета","тиара","тип","тир","тире","титр","трап","трата","треп","триер","триера","трип","трирема"],"отвердение":["ведение","ведро","веер","вено","веретено","ветер","вето","вид","видео","вино","винт","воин","вор","вред","двоение","двор","девон","дерево","дерен","дерн","дети","диво","дно","до","доверие","доение","дорн","древо","дровни","евреи","енот","иод","ион","ирод","неверие","невод","неврит","недоверие","нерв","норд","овен","овин","одр","ор","орден","отведение","рвение","рдение","ре","рев","ренет","ров","род","роение","рот","твердение","твердо","твид","твин","творение","теин","тендер","тени","тенор","терн","тернев","тир","тире","тон","тор","трение","трио","триод","троение","трон"],"интерпол":["енот","ил","илот","ион","лен","лет","лето","линт","литер","литр","лори","лорнет","лот","неолит","нилот","олеин","опт","ор","орел","отел","перл","перлон","перо","петин","пилон","пилот","пион","пионер","пир","питер","питон","плен","плот","пол","поле","полет","пони","понт","понтер","порт","пот","потир","прилет","притон","пролет","протеин","ре","рол","рот","теин","тело","тени","тенор","тепло","терн","тип","тир","тире","тлен","тон","топ","тор","треп","трепло","трио","трип","трон","троп"],"канделябр":["абрек","ад","анкер","баден","бак","бакен","бал","банк","баня","бар","бард","барк","баян","беда","бедняк","бедра","бек","бекар","бел","белка","беляк","беляна","бердан","бланк","бра","брак","бред","дан","дар","дек","дека","декан","делянка","дерн","дрек","дрена","еда","елка","кадр","кал","каре","кеб","кедр","келарня","керн","клад","клан","клен","кляр","краб","краля","кран","крен","лад","лак","лар","ларек","лед","лен","лерка","лея","ля","лярд","надел","нард","нардек","наряд","недра","нерка","раб","рак","ре","редан","река","рея","ряд","ябеда","яд","як","ял","яр","ярд","ярка"],"конторка":["акт","ант","кант","кантор","карт","картон","каток","кок","кока","кокон","кокор","кон","конка","контора","контра","кора","коран","корка","корона","коронка","корт","кот","кран","кроат","крона","крот","норка","нота","нотка","окно","око","окорка","окот","ор","орк","оркан","орок","отрок","рак","рант","рок","рокот","рот","рота","тако","танк","ток","тон","тор","трак","трок","трон"],"стражник":["аист","акт","анис","ант","ас","жанр","жанрист","жар","жинка","жир","ик","икра","иск","искра","кант","кантри","карст","карт","киста","кит","кран","наст","натиск","нитка","раж","рак","рант","ратин","ратник","рис","риск","риска","сак","сан","сани","санки","сатин","сатир","си","ситар","скарн","скат","стаж","стан","старик","стирка","страж","стриж","стрижка","такси","танк","тик","тина","тир","тираж","тиран","тис","трак","транс"],"разыскания":["азан","акын","анис","ара","арак","ария","арка","аркан","арника","арык","ас","аянка","заика","заря","зарянка","знак","изыск","ик","икра","икры","иранка","иск","искра","казна","канзас","кара","карниз","кинза","кираса","кран","краса","криз","крыса","наказ","накра","нары","низ","низка","разиня","рак","ракия","рана","ранка","раса","риза","рис","риск","риска","рык","рысак","ряса","ряска","сааз","саз","сазан","сак","сан","сани","санки","си","синяк","сказ","скарн","сын","сыр","сырник","язык","як","янки","яр","ярка","яс"],"выплетание":["алтын","ант","вал","валет","ватин","вена","ветла","вилы","вина","винт","вплетание","вылет","вылетание","выпал","ива","ил","лапти","латины","латы","лев","левит","лен","лента","лепет","лепта","лет","летание","летие","ливы","линт","липа","навет","налеп","налет","налив","напев","наплыв","нива","павлин","пан","панты","пат","патлы","пелевин","пелена","пена","пенал","пение","петин","пила","пилав","пина","пинта","плав","план","плева","плевание","плевна","плен","плена","плита","пыл","пылание","пыление","пытание","твин","теин","тени","тина","тип","тлен","тление","тыл","тын"],"мышеловка":["вал","валек","век","веко","вешало","вешка","вокал","вол","волк","выем","выемка","выкол","вылом","вышка","елка","кал","калым","камыш","кеш","клев","клеш","ковш","ковы","кол","колыма","ком","кома","кошма","лак","лев","левак","левша","лом","ломка","лошак","лыко","мак","малек","малов","малыш","малышок","мел","мелок","мешок","моевка","мокша","мол","молва","мошка","мыло","мышка","овал","омела","ошва","шелк","шкало","шквал","школа","шлак","шлам","шлевка","шлем","шлык","шов","шок"],"номография":["агония","агроном","агрономия","арго","аргон","ария","армия","гармония","гимн","гиря","гифа","гном","гнома","го","гомон","гон","гонор","гора","горин","гормон","горн","гофр","гран","граф","графин","графиня","грим","гриф","грифон","гром","иго","игра","имя","ион","ирга","маг","магия","манго","мания","марго","мафия","ми","миг","мина","минога","минор","миограф","мир","миф","могар","монография","мор","морг","морф","морфин","моряна","нимфа","нога","нома","нория","норма","омар","онагр","ор","орган","оргия","ранг","рафия","ринг","риф","рифма","рог","ром","роман","фа","фанг","фиг","фига","фигаро","фирма","фирн","фон","фора","форма","яма","яр","ярмо"],"дефектолог":["глот","глоток","го","год","годок","гол","голод","дек","дело","дефект","до","дог","док","дол","долг","едок","кег","код","кол","колет","кот","котел","кофе","лед","ледок","лет","лето","леток","лог","лот","лото","лоток","око","окот","отдел","отек","отел","откол","отлог","телек","тело","телок","теолог","ток","толк","феод","флот","фогт","фол","фото"],"авиаспорт":["авар","авиатор","автор","аист","аорист","аорта","ара","арап","артос","ас","аспират","астра","вар","вата","вира","вис","вор","ворс","врата","втора","ива","опара","оправа","опт","ор","орава","оса","оспа","отава","отара","отвар","отрава","пава","пар","пара","пари","парта","пас","паста","паства","пастор","пат","пиар","пиастр","пиво","пир","пират","пирс","повар","пора","порт","пост","постав","пот","потир","потрава","права","право","правота","пристав","рапа","рапс","раса","рвота","рис","ров","роса","рост","рот","рота","сап","сапа","сатир","сатира","сатрап","свара","сват","свита","свора","си","сипота","сироп","сирота","ситар","сито","ситро","сова","сопа","сор","сорит","сорт","сота","спарта","спирт","спор","спора","спорт","справа","створ","стопа","строп","стропа","тавр","тавро","тапир","тара","тиара","тип","тир","тис","товар","топ","тор","торс","трава","трап","трио","трип","троп","тропа","трос"],"анаэробиоз":["абаз","абазин","азан","анабиоз","анаэроб","анзор","ара","араб","арба","ариозо","аэроб","аэробиоз","аэрон","база","базар","бар","баран","барин","барон","бизон","боа","бон","бона","бонза","бор","бора","борона","бра","бриз","бронза","бэр","забор","зоб","зона","изба","изобара","ион","набор","наиб","низ","оаз","обзор","обоз","обои","образ","озноб","озон","ор","раб","раба","рана","риза","роба","роза","эра"],"наибство":["аист","анис","ант","ас","бант","бас","басни","басон","бастион","батон","бинт","бит","бита","битва","боа","бон","бона","бот","ботва","васин","ватин","вина","вино","винт","вис","воин","вона","ива","ион","навис","наиб","наст","нива","нос","нота","овин","оса","осина","отбив","сабо","саиб","сан","сани","сатин","сван","сват","свита","си","сито","сноб","сова","сон","сота","стан","стон","твин","тина","тис","тон"],"мокасин":["аксон","анис","ас","ик","икона","инок","ион","иск","камин","кино","ком","кома","коми","кон","коса","маис","мак","маки","маниок","манок","манси","масон","ми","мина","миска","нома","нос","носик","оникс","оса","осина","осинка","осман","сак","сан","сани","санки","си","смак","снимок","сок","сом","сома","сон","сонм"],"ночесветка":["аксон","акт","ант","ас","аскет","век","веко","вена","вено","венок","вес","весна","вест","весточка","ветка","вето","веточка","вече","вона","воск","енот","кант","качество","квант","квас","квота","кета","кетч","кон","коса","косач","кот","кочан","навес","навет","наст","натек","натес","начес","начет","невеста","невестка","нос","нота","нотка","ночевка","ночка","овен","овес","овечка","океан","оса","осек","осечка","отвес","отек","отеска","отсев","отсек","отсечка","очес","оческа","саек","саенко","сак","саке","сан","сачок","сван","сват","свет","светоч","свеча","свечка","сев","севок","секач","секта","сенат","сено","сет","сетка","сеточка","сечка","скат","скена","скетч","скот","скотч","снеток","сновка","сова","совет","совка","сок","сон","сонет","сота","сотка","стан","станок","стек","стека","стена","стенка","стеночка","сток","стон","сточка","счет","тако","танк","тенек","тес","тесак","теска","течка","ткач","ток","тон","тоска","точка","чаек","чан","час","часок","чек","чека","чеснок","чесотка","чета"],"тетрадочка":["ад","адат","акт","актер","аорта","ара","арак","арека","арка","арча","дар","дата","дача","дачка","дек","дека","декор","детка","деточка","до","док","дока","докер","дочка","драка","дрек","дрок","еда","едок","кадет","кадр","кара","карат","карате","карда","каре","карета","карт","карта","катер","катет","катод","кача","кедр","кедрач","кета","кетч","код","кода","кора","корд","корда","корт","корча","кот","кредо","кроат","крот","ода","одр","октет","ор","орда","орк","отара","отдача","отек","откат","отрада","отчет","очерк","рада","рак","ракета","ре","река","речка","род","рок","рокада","рот","рота","тако","такт","тара","тачка","театр","теракт","терка","тета","тетка","тетрадка","течка","ткач","ток","тор","торт","точка","трак","тракт","трата","трек","трок","трот","чадо","чадра","чаек","чакра","чара","чарка","чек","чека","чердак","черт","черта","чета"],"терпимость":["ерь","импорт","ирмос","место","месть","метр","метрит","метро","ми","мир","мирт","мистер","мопс","мор","море","морс","мост","мосье","мотет","мсье","омет","опись","опт","оптиметр","ор","осетр","остеит","остит","острие","ость","ось","отит","периост","перо","перст","пес","песо","пест","петит","пим","пир","пирс","письмо","питер","питье","поем","помесь","помет","порт","портье","пост","пот","потесь","потир","прием","примесь","проем","промес","протес","протест","пьеро","ре","репс","рис","ритм","ром","рост","рот","семит","семь","серп","сет","сеть","си","сироп","сито","ситро","смерть","смотр","сом","сор","сорит","сорт","спирт","спор","спорт","степ","степь","стрит","строп","теист","темп","темь","термист","термит","термос","тес","тест","тесто","тесть","тип","типометр","тир","тире","тис","титр","том","топ","топь","тор","торит","торс","торт","тост","тостер","тотем","треп","трест","треть","триест","трио","трип","тромп","троп","трос","трость","трот"],"звездность":["вено","вес","вест","весть","весь","вето","взнос","водь","воз","вонь","девон","день","дзот","дно","до","досев","досье","енот","звено","звон","зев","зет","зов","зонд","зонт","невод","новь","нос","овен","овес","осень","ость","ось","отвес","отсев","свет","свод","своз","сев","сезон","сено","сень","сет","сеть","снедь","совет","сон","сонет","стенд","стеноз","стон","тень","тес","тодес","тон"],"обстановка":["абак","аванс","акант","аксон","акт","ант","ас","бак","банк","банка","бант","бас","баск","баска","басок","басон","батон","боа","бок","бокс","бон","бона","бостон","бот","ботва","вакса","ванта","вата","ватка","вона","воск","восток","кабан","канат","канва","кант","каста","квант","квас","квота","кон","коса","кот","набат","накат","наст","нос","носок","нота","нотка","обкат","обкос","обновка","обнос","окно","око","окова","окот","октава","оса","осака","осанка","основа","особа","осока","осот","остановка","остов","отава","откос","относ","саба","сабан","сабо","саван","савка","сак","саква","сан","санбат","сван","сванка","сват","скат","скоба","скот","сноб","сновка","собака","сова","совка","совок","сок","сон","соната","сота","сотка","ставка","стакан","стан","станок","сток","стон","табак","тако","такса","танк","тасовка","ток","тон","тоска"],"петрология":["гелиотроп","гирло","гиря","гит","глот","го","гол","горе","горло","грот","иго","ил","илот","итог","лет","лето","лея","литер","литорея","литр","лог","логотип","лори","лот","лото","ля","ляп","оплот","опор","опт","ор","оргия","орел","ореол","отел","отлог","отпор","отрог","перл","перо","петля","пилот","пир","пирог","питер","плот","пол","поле","полет","поло","полог","полотер","поля","порог","порт","пот","потеря","потир","потяг","прилет","пролет","пролог","ре","рея","рог","рол","ропот","рот","тело","теолог","теология","теория","тепло","тигр","тип","типолог","тир","тире","тля","топ","топор","тор","торг","торги","торлоп","треп","трепло","трио","трип","трог","троп","тягло","ял","яр"],"мотолодка":["ад","акт","атом","до","док","дока","дол","долото","дом","кал","камлот","катод","клад","код","кода","кодла","кол","колода","ком","кома","комод","кот","лад","ладо","лак","лодка","лом","ломка","ломота","лот","лото","лоток","мак","мат","мода","мол","молодка","молока","молоко","молот","молоток","мотка","моток","ода","оклад","око","окот","откол","тако","ток","толк","том"],"косхалва":["ас","вакса","вал","валах","вахлак","влас","вокал","вол","волк","воск","кал","квас","коала","кол","коса","лава","лавка","лак","лаоска","ласа","ласка","лоск","лох","овал","оса","осака","оскал","савка","сак","саква","сало","свалка","скала","скало","скол","слава","славка","словак","сова","совка","сок","солка","соха","хакас","хала","халва","хаос","хвала","холка"],"блокпост":["блок","бок","бокс","болт","бот","клоп","кол","колоб","колос","копт","кот","лоб","лобок","лоск","лот","лото","лоток","лотос","обкос","обол","око","окоп","окот","оплот","опт","осот","откол","откос","плот","покос","пол","полк","поло","полок","посол","пост","пот","поток","скол","скоп","скот","слот","сок","соло","сопло","сплоток","сток","стол","столб","столп","ток","толк","топ"],"пилотка":["акт","ик","икота","ил","илот","кал","капот","кила","кило","кипа","кит","клип","клоп","кол","колит","копал","копт","кот","лак","лапти","лик","липа","липка","литка","лот","опак","опал","опилка","опт","оптик","оптика","отпал","пак","пакт","пат","пик","пика","пила","пилка","пилот","плато","платок","плита","плитка","плот","поилка","пол","пола","полати","полк","полка","пот","тако","талик","тапки","тик","тип","ток","толк","толки","толпа","топ","топик","топика","топка"],"фигуристка":["агути","аист","акт","арфист","ас","аут","гарт","гарус","гит","гифа","граф","график","графит","гриф","гурт","гусар","гусит","гуситка","гута","игра","ик","икарус","икра","ирга","ирис","иск","искра","карст","карт","киста","кит","круг","куга","курс","курта","куст","кутас","рагу","рак","раус","раут","рафик","рис","риск","риска","риф","рука","русак","руст","рустика","рута","сак","сатир","сатирик","си","сиг","ситар","сити","скат","скаут","скиф","старик","стирка","стук","сук","сука","сура","сурик","сутки","такси","тариф","тигр","тик","тир","тис","тиски","тиф","трагик","трагус","трак","трус","трусик","тугрик","тур","тура","турка","турки","туф","угар","ус","усик","уста","утка","фа","факир","факс","факт","фарс","фарт","фартук","фат","фаут","фиат","фиг","фига","фигура","фигурист","фигурка","фикс","фикус","фита","фрак","фрукт","фуга","фугас","фура","фут"],"громыхание":["арго","аргон","гаер","гарем","ген","герма","героин","гиена","гимн","гном","гнома","го","гон","гора","горе","горин","горн","гран","грена","грех","грим","гром","иго","игра","ион","ирга","маг","манго","манер","манеры","марго","мах","мена","менгир","мера","мерин","мех","меха","ми","миг","мина","минер","минога","минор","мир","могар","монарх","монах","мор","морг","моргание","морген","море","морена","мох","мохер","мохна","наем","нары","нега","негр","нихром","нога","нома","номарх","номер","норма","огрех","омар","омег","омега","онагр","ор","орган","орех","охание","охра","ранг","ре","регион","рема","ринг","рог","ром","роман","рыгание","рым","хам","хан","химера","хна","хон","хор","хоры","храм","хрен","хром","хромание"],"болванка":["абак","анклав","бак","баклан","бал","балка","балкон","балок","банк","банка","бланк","блок","боа","бок","бокал","бола","болван","бон","бона","вал","вобла","вокал","вол","волан","волк","волна","вона","кабан","кал","калан","канал","канва","клан","клон","коала","кол","колба","кон","лава","лавка","лак","ланка","лоб","лобан","навал","накал","обвал","обвалка","облава","овал"],"плавунчик":["аул","вакулин","вал","валик","валун","вилка","вина","внук","внуки","внучка","вулкан","ива","ик","ил","инула","кал","калин","каплун","кила","кипа","кипу","клан","клип","клич","кулан","кулич","кун","куна","купа","купчина","куча","лак","лапник","лик","липа","липка","липучка","лич","лук","лука","лукич","луна","лунка","лупа","луч","лучик","лучина","лучинка","лучник","налив","нива","павлин","пак","пан","панк","паук","пик","пика","пикан","пила","пилав","пилка","пина","плав","плавки","плавник","плавун","плакун","план","плаун","плач","пук","пул","пула","пучина","пучка","увал","улан","улика","учан","училка","чал","чан","чин","чина","чинка","чип","чувак","чулан","чулки"],"дриопитек":["дек","декор","депо","депорт","дети","диктор","диоптр","до","док","докер","дрек","дрок","дротик","едок","ерик","идиот","ик","иод","иприт","ирод","кедр","кепи","киприот","кит","код","копир","копт","корд","корт","кот","кредит","кредо","креп","крот","одр","опитие","опт","оптик","ор","орк","отек","период","перо","пик","пике","пикет","пики","пир","пирит","питер","подтек","покер","порт","портик","портки","пот","потек","потир","предки","предок","приток","проект","прок","протеид","ре","род","рок","рот","ротик","тик","тип","тир","тире","ток","топ","топик","тор","трек","треп","трико","трио","триод","трип","трок","троп","тропик"],"софистка":["аист","акт","ас","ик","икота","иск","исток","киста","кит","коса","кости","кот","кофта","оса","офис","офит","сак","сакс","си","сито","скат","скиф","скот","сок","соска","сота","сотка","софа","софист","софит","сток","тако","такси","тик","тис","тиф","ток","тоска","фа","факс","факт","фат","фиаско","фиат","фикс","фита"],"подхвостье":["вдох","вепс","вес","вест","весть","весь","вето","вех","водь","восход","всход","вход","депо","деспот","до","досев","доспех","досье","овес","овод","опт","осоед","осот","остов","ость","ось","отвес","отвод","отповедь","отсев","отход","охвостье","пес","песо","пест","повесть","повет","поветь","повод","подвес","подвох","подсвет","подсев","посев","посох","пост","пот","потесь","поход","похоть","свет","свод","сев","сет","сеть","совет","спех","степ","степь","сход","тес","тодес","топ","топь","хвост","ход","хост"],"декларация":["ад","акация","акрида","акрил","акция","ара","арак","аралия","ареал","арека","ариец","ария","арка","аркадия","дар","дек","дека","диарея","дилер","драка","дрек","еда","елка","ерик","идеал","идея","ик","икра","ил","иракец","кадр","кал","кара","карда","каре","карелия","кедр","кила","клад","клир","кляр","краля","крица","лад","лак","лакрица","лар","ларек","ларец","лед","леди","лекция","лерка","лея","лидер","лик","ликер","ля","лярд","рада","радикал","рак","ракия","рация","ре","реакция","реалия","редакция","река","рея","ряд","цадик","цедра","цикада","цикл","цикля","цирк","яд","ядрица","як","ял","ялик","яр","ярд","ярка"],"сторонка":["аксон","акт","ант","артос","ас","кант","кантор","карст","карт","картон","кастор","кон","контора","контра","кора","коран","корона","короста","корт","коса","костра","кот","кран","кроат","крона","крот","нарост","наст","норка","нос","носок","нота","нотка","окно","око","окот","окрас","ор","орк","оркан","орок","оса","оскар","осока","осот","откос","относ","отрок","рак","рант","рок","рокот","роса","рост","росток","рот","рота","сак","сан","скарн","скат","скот","сок","сон","сор","сорока","сорт","сота","сотка","срок","стан","станок","сток","стон","сторона","строка","тако","танк","ток","тон","тор","торос","торс","тоска","трак","транс","трок","трон","трос"],"ломтерезка":["азот","акт","актер","аозт","атом","елка","ермолка","заем","закром","зал","залет","замер","замок","замор","зарок","затек","заток","затор","зек","зеркало","зеро","зет","злак","зло","зола","кал","камзол","камлот","каре","карт","катер","кета","кларет","клозет","коза","козел","кол","колер","колет","ком","кома","комар","комета","кора","корм","корма","корт","кот","котел","крез","крем","креол","кроат","крот","лазер","лак","лар","ларек","леер","лектор","лерка","лет","лето","леток","лоза","лом","ломка","лот","мазер","мазок","мак","макет","маклер","малек","март","мат","мел","мелкота","мелок","мера","мерзлота","мерка","мета","метелка","метеор","метка","метла","метол","метр","метро","мол","мор","море","мотка","мрак","оаз","омар","омела","омет","омлет","ор","орел","орк","отек","отел","отказ","отрез","разлет","разлом","размол","разок","рак","ре","резак","резка","река","реле","рема","ремез","роза","розетка","рок","рол","ром","рот","рота","таз","тако","талер","тезка","телек","телка","тело","телок","телорез","тема","теорема","терем","теремок","терка","ток","толк","том","тор","трак","трал","трек","трок"],"отливание":["автол","ант","вал","валет","ватин","вена","вено","ветла","вето","вина","вино","винт","виола","витание","воин","вол","волан","волна","вона","енот","ива","ил","илот","ион","лев","левит","лен","лента","лет","лето","линт","лот","навет","наитие","налет","налив","неолит","нива","нилот","нота","овал","овен","овин","олеин","олива","оливин","отвал","отел","отлив","талон","твин","теин","тело","тени","тина","тлен","тон"],"пескожил":["еж","ик","ил","иск","кепи","кило","клип","клипс","клоп","кол","лес","лесок","лик","лис","ложе","ложки","лоск","окисел","осек","осел","ослик","пекло","пес","песик","пески","песо","песок","пик","пике","писк","плес","плеск","плис","поиск","пол","поле","полис","полк","село","си","сикл","силок","скип","склеп","скол","скоп","слепок","слип","сок","сопли","спил","спилок"],"фалерист":["аист","арест","арфист","ас","аферист","ил","лар","лафет","лафит","лес","леса","лет","лис","лиса","лист","литер","литера","литр","лиф","лифт","лифтер","ре","реалист","рис","риф","сатир","селитра","селфи","сера","сериал","сет","си","сила","ситар","слет","стела","стрела","сфалерит","сфера","талер","талес","тариф","тес","тир","тире","тис","тиф","трал","фа","фал","фарс","фарт","фасет","фат","фес","фетр","фиал","фиат","фиеста","фила","филе","филер","фита","флат","флер","флирт"],"экспирация":["акция","ария","ас","ик","икра","ирис","иск","искра","каприс","карп","кипа","кипарис","крап","крица","пак","пар","пари","парик","парк","паря","пас","паск","паяц","пиар","пик","пика","пики","пир","пирс","писк","прииск","пэр","рак","ракия","рапс","рация","рис","риск","риска","рэп","ряса","ряска","сак","сап","си","скип","скрап","скрип","скрипица","спица","сэр","цирк","эпика","эра","эскарп","як","яр","ярка","яс"],"азартность":["азан","азарт","азот","анзор","ант","аозт","аорта","ара","артос","ас","астат","астра","занос","затон","затор","знать","зона","зонт","нарост","нарта","наст","нос","носарь","нота","оаз","ор","оса","ость","ось","отара","разнос","разность","рана","рант","рань","раса","рать","роза","рознь","роса","рост","рот","рота","сааз","саз","сазан","сан","сон","соната","сор","сорт","сота","стан","старт","статор","стать","стон","страз","страна","таз","тара","таран","тарань","тон","тор","торс","торт","тост","транс","траст","трата","трон","трос","трость","трот"],"глазомер":["арго","гаер","газ","газомер","гарем","герма","глаз","го","гол","гора","горе","греза","гроза","гром","егоза","заем","зал","залог","замер","замор","зеро","зло","зола","лаг","лазер","лар","лог","лоза","лом","маг","мазер","марго","мгла","мезга","мел","мера","могар","мозг","мол","мор","морг","море","оаз","омар","омег","омега","омела","ор","оргазм","орел","разлом","размол","ре","рема","рог","роза","розга","рол","ром"],"раскупорка":["ара","арак","арап","арка","ас","аура","какао","капа","капок","капор","кара","каркас","карп","карра","каска","кок","кока","кокс","кора","корка","корпус","корсак","корсар","коса","крап","краса","краска","крокус","круп","крупа","купа","курок","курс","кусок","окрас","окраска","опак","опара","опаска","опус","ор","орк","оса","осака","оскар","оспа","пак","пар","пара","парк","парок","парус","пас","паск","паук","покраска","пора","порка","порука","прок","прокраска","прокурка","прокус","прус","прусак","пук","пурка","пуск","рак","ракурс","рапа","рапс","раса","раскопка","распор","распорка","раус","рок","ропак","роса","рука","рупор","русак","сак","сакура","сап","сапа","сапка","скак","скок","скоп","скопа","скрап","скука","скуп","скупка","сок","сопа","сопка","сор","спор","спора","срок","сук","сука","суп","сура","сурок","укор","укос","укроп","упарка","упор","урок","ус"],"тормошение":["енот","ерошин","ерш","ион","мент","мерин","метеор","метр","метро","ми","минер","минор","мир","мирт","монитор","монтер","мор","море","мотор","номер","омет","ор","орошение","отроение","ре","ремонт","ренет","реноме","решето","ритм","роение","ром","рот","теин","тени","тенор","терем","термин","терн","тир","тире","тмин","том","тон","тор","торошение","торшон","трение","трином","трио","троение","трон","шен","ши","шмон","шот","шрот","шторм"],"пятистенка":["аист","акт","анис","ант","ас","аскет","аспект","астеник","астения","атеист","аттик","ик","иск","кант","кастет","катет","кепи","кета","кипа","кисет","кисея","киста","кит","наст","натек","натес","натиск","нитка","паек","пак","пакет","пакт","пан","панк","пантеист","пас","паск","пат","патент","паяние","пекан","пена","пенис","пенка","пенс","пенсия","пеня","пес","песик","пески","песня","пест","пестик","петин","петит","пик","пика","пикан","пике","пикет","пина","пинетка","пинта","писк","питта","псина","пята","пятак","пятка","саек","сак","саке","сан","сани","санки","сап","сатин","сатинет","секта","сектант","сенат","сени","сепия","септик","сет","сетка","си","синап","синяк","скат","скена","скепт","скип","снятие","спина","спинет","спинка","стан","стая","стек","стека","стена","стенка","степ","степняк","такси","такт","танк","танкист","тапки","таяние","теин","теист","текст","тени","тент","тес","тесак","тесина","теска","тест","тета","тетания","тетка","тетя","тик","тина","тип","тис","титан","тяпка","як","янки","яс"],"стогование":["авгит","автоген","агент","аист","анис","ант","ас","вагин","вагон","васин","ватин","вега","вена","вено","вес","весна","вест","вето","виг","вина","вино","винт","вис","воин","вона","гавот","ген","гиена","гит","гитан","гитов","гнев","гнет","го","говно","гоист","гон","гонт","енот","ива","иго","ион","итог","навес","навет","навис","наст","натес","нега","негатив","нива","нога","нос","нота","овен","овес","овин","огниво","оса","осетин","осина","основа","осот","остов","отвес","отгон","относ","отсев","саго","сан","сани","сатин","сван","сват","свет","свита","сгон","сев","сенат","сени","сено","сет","си","сиг","синева","сито","снег","сова","совет","сон","сонет","сота","стан","стена","стог","стон","танго","твин","теин","тени","тес","тесина","тина","тис","тога","тон"],"антисемит":["аист","аметист","анимист","анис","ант","ас","атеист","истина","маис","манси","мант","мастит","мат","мена","мент","мета","метан","ми","мина","мини","наем","наитие","намет","наст","натес","самнит","сан","сани","сантим","сатин","сатинет","сема","семит","сенат","сени","сет","си","сиенит","сити","смена","смета","стан","стена","теин","теист","тема","тени","тент","тес","тесина","тест","тета","тиамин","тина","тис","титан","тмин"],"широкость":["ик","иск","исток","киото","кисть","кит","корт","корь","кости","кость","кот","крот","окись","око","окот","ор","орк","орок","осот","ость","ось","откос","отрок","рис","риск","рок","рокот","роскошь","рост","росток","рот","ротик","си","сито","ситро","скот","сок","сор","сорит","сорт","срок","стишок","сток","тик","тир","тис","тишь","ток","тор","торос","торс","трико","трио","трок","трос","ши","шик","ширь","шкот","шок","шот","шрот","штос"]};
  let PLAYESTATE = {};
  let PLAYERSTATS = {};
  let doDeleteBlock;
  let allDoneWords = localStorage.getItem('allDoneWords');
  let tips = localStorage.getItem('tips');
  let sounds = localStorage.getItem('sounds');
  let isAdvShowed = localStorage.getItem('isAdvShowed');
  let isGameAdvShow = localStorage.getItem('isGameAdvShow');
  isAdvShowed = !!isAdvShowed;
  let loc = 0;
  let allStars = [];
  let isRules = false;
  let allLocations = Math.floor(allWords.length / 21);
  let lastLevel = 0;
  function fixDoneWords(allDoneWords) {
    let keys = Object.keys(allDoneWords);
    for(let i = 0; i < keys.length; i++){

      let k = keys[i];
      if(keys[i].indexOf('ё') !== -1){
        k = k.replace(/ё/g, 'е');
      }
      let words = allDoneWords[keys[i]] || allDoneWords[k];
      if(keys[i].indexOf('ё')  !== -1){
        words = words.map((word)=>word.replace(/ё/g, 'е'));
      }

      delete allDoneWords[keys[i]];

      if(words.length > 0){
        let allWords = wordsFromWords[k];
        words = words.filter((word)=>allWords.includes(word));
        allDoneWords[k] = words;
      }
    }
    return allDoneWords;
  }
  if(allDoneWords){
    allDoneWords = fixDoneWords(JSON.parse(allDoneWords));
    tips = Number(tips);
    sounds = sounds === 'true';
    setLoc();
    isGameAdvShow = !isGameAdvShow;
  }else{
    allDoneWords = {};
    isGameAdvShow = false;
    tips = 3;
    isRules = true;
    sounds = true;
    localStorage.setItem('sounds', true);
    localStorage.setItem('allDoneWords', JSON.stringify(allDoneWords));
    localStorage.setItem('tips', 3);

    allWords.forEach((key => {
      allDoneWords[key] = [];
    }));
    for(let i = 0; i < allWords.length; i++){
      allStars.push(0);
    }
  }

  let recentState = '';
  let recentStats = '';
  function setState() {
    const newData = JSON.stringify(PLAYESTATE);
    if(recentState === newData) return;
    recentState = newData;
    if(playerGame) playerGame.setData(PLAYESTATE).then((ignored) => {}).catch(()=>{
      playerGame.setData(PLAYESTATE).then((ignored) => {})
    });
  }
  function setStats() {
    const newData = JSON.stringify(PLAYERSTATS);
    if(recentStats === newData) return;
    recentStats = newData;
    if(playerGame) playerGame.setStats(PLAYERSTATS).then((ignored) => {}).catch(()=>{
      playerGame.setStats(PLAYERSTATS).then((ignored) => {})
    });
  }


  function setLastLevel() {
    for(let i = allWords.length-1; i >= 0 ; i--){
      if(allDoneWords[allWords[i]].length > 0){
        lastLevel = i;
        break;
      }
    }
  }

  function setLoc() {
    allWords.forEach((key => {
      if(allDoneWords[key]){
        allStars.push(testStar(allDoneWords[key].length, wordsFromWords[key].length))
      }else{
        allDoneWords[key] = [];
        allStars.push(0);
      }
    }));
    localStorage.setItem('allDoneWords', JSON.stringify(allDoneWords));
    setLastLevel();
    loc = Math.floor((lastLevel / 21));
    if(allStars.reduce((acc, st)=>{
      return acc + st;
    }, 0) < loc*32){
      loc--;
    }
    if(loc >= allLocations || loc < 0) loc = 0;
  }
  if(window.YaGames){
    window.YaGames.init({
      adv: {
        onAdvClose: wasShown => {
          if(!wasShown) advTime = true;
        }
      }
    }).then(ysdk => {
      YSDK = ysdk;
      initPlayer(ysdk);
      var isNativeCache = ysdk.yandexApp && ysdk.yandexApp.enabled;
      if ('serviceWorker' in navigator && !isNativeCache) {
        window.onload = function(){
          navigator.serviceWorker
                  .register('sw.js')
                  .then(function(reg) {
                    console.log('Registration succeeded. Scope is ' + reg.scope);
                  })
                  .catch(function(error) {
                    console.error('Trouble with sw: ', error);
                  });
        };
      }
      showAdv = () => {
        params({'showAdv': 1});
        ysdk.adv.showFullscreenAdv({
          callbacks: {
            onClose: function() {
              advTime = false;
              setTimeout(()=>{
                advTime = true;
              }, 220000);
            }
          }
        });
      };
    }).catch(e=>{
        console.log(e);
        doDeleteBlock = true;
        update();
    });
  }else{
    localStorage.setItem('offline', '1');
    doDeleteBlock = true;
  }
  function update() {
    if (document.querySelector('.levels')) {
      document.querySelector('.levels').dispatchEvent(new CustomEvent("updateAll"));
    }

  }
  function reachGoal(goal) {
    try{
      // eslint-disable-next-line no-undef
      ym(57682372,'reachGoal', goal)
      // eslint-disable-next-line no-empty
    }catch(ignored){}
  }

  function initPlayer(ysdk) {
    console.log(ysdk);
    ysdk.getPlayer().then(_player => {
      console.log('get player');

      // Игрок авторизован.
      playerGame = _player;
      let someTrue = false;
      let change = true;
      let offline = localStorage.getItem('offline');
      if(offline === '1'){
        offline = true;
        localStorage.setItem('offline', '0');
      } else{
        offline = false;
      }
      playerGame.getData(['allDoneWords'], false).then((dataObject) => {
        console.log(dataObject);
        if (dataObject.allDoneWords) {

          if(offline){
            const lastAllDoneWords = dataObject.allDoneWords;
            let newWords, lastWords;
            newWords = Object.keys(allDoneWords).reduce((k, key)=> k + allDoneWords[key].length, 0);
            lastWords = Object.keys(lastAllDoneWords).reduce((k, key)=> k + lastAllDoneWords[key].length, 0);
            if(newWords > lastWords){
              change = false;
              tips = localStorage.getItem('tips');
              if(tips){
                tips = Number(tips);
              }else{
                tips = 3;
              }
              PLAYERSTATS = {
                tips: tips
              };
              setStats();
            }
          }

          PLAYESTATE = dataObject;
          if(change){
            allDoneWords = fixDoneWords(dataObject.allDoneWords);
            localStorage.setItem('allDoneWords', JSON.stringify(allDoneWords));
          }else{
            PLAYESTATE.allDoneWords = fixDoneWords(allDoneWords);
            setState();
          }
        }  else{
          playerGame.setData({
            allDoneWords: allDoneWords
          }, false).then((ignored) => {});
        }
        if(someTrue){
          update();
        }
        someTrue = true;
      }).catch((e) => {
        console.log(e);
        if(someTrue){
          update();
        }
        someTrue = true;
      });
      playerGame.getStats(['tips'], false).then((dataObject) => {
        if (dataObject.tips && change) {
          tips = dataObject.tips;
          PLAYERSTATS = dataObject;
          localStorage.setItem('tips', tips);
          setStats();
        }else{
          playerGame.setStats({
            tips: tips
          }, false).then((ignored) => {});
        }
        if(someTrue){
          update();
        }
        someTrue = true;
      }).catch((e) => {
        console.log(e);
        if(someTrue){
          update();
        }
        someTrue = true;
      });
      ysdk.getPayments({ signed: false }).then(_payments => {
        // Покупки доступны.
        payments = _payments;
        payments.getPurchases().then(purchases => purchases.forEach(consumePurchase));
      }).catch(err => {
        console.log(err);
      });
    }).catch((e) => {
      console.log(e);
      localStorage.setItem('offline', '1');
      doDeleteBlock = true;
      update();
    });
  }
  let TIPS = 0;
  function consumePurchase(purchase) {
    if (purchase.productID === 'cart_item2') TIPS = 20;
    if (purchase.productID === 'cart_item3') TIPS = 50;
    if (purchase.productID === 'cart_item4') TIPS = 100;
    params({[purchase.productID]: 1});
    document.querySelector('.levels').dispatchEvent(new CustomEvent("buyTips"));
    payments.consumePurchase(purchase.purchaseToken);
  }
  function buyTips(item) {
    if(payments){
      let purchaseItem = 'cart_item' + item;
      payments.purchase(purchaseItem).then(purchase => {
        if(purchase.productID === purchaseItem){
          if(item === 1) TIPS = 5;
          if(item === 2) TIPS = 20;
          if(item === 3) TIPS = 50;
          if(item === 4) TIPS = 100;
          let it = 'buy-' + item;
          params({[it]: 1});
          document.querySelector('.levels').dispatchEvent(new CustomEvent("buyTips"));
          payments.consumePurchase(purchase.purchaseToken);
        }
      }).catch((e)=>{
        console.log("PAYMENTS ERROR: " + e);
      });
    }else{
      console.log('open auth');
      YSDK.auth.openAuthDialog().then(() => {
        // Игрок успешно авторизован, теперь объект Player будет инициализирован.
        console.log('успешно авторизован');
        initPlayer(YSDK);
      }).catch((ignored) => {// Игрок не авторизован.
      });
    }
  }







  function testStar(doneWordsLength, allWordsLength) {
    if(doneWordsLength === allWordsLength) return 3;
    let percent = Math.floor(doneWordsLength / allWordsLength * 100);
    if(percent >= 66) return 2;
    if(percent >= 33) return 1;
    return 0;
  }
  const NewAudioContext = (function() {

    try {
      window.AudioContext = window.AudioContext || window.webkitAudioContext;
      window.audioContext = new window.AudioContext();
    } catch (e) {
      console.log("No Web Audio API support");
    }
    /*
     * WebAudioAPISoundManager Constructor
     */
    var WebAudioAPISoundManager = function (context) {
      this.context = context;
      this.bufferList = {};
      this.playingSounds = {};
    };

    /*
     * WebAudioAPISoundManager Prototype
     */
    WebAudioAPISoundManager.prototype = {
      addSound: function (url) {
        // Load buffer asynchronously
        var request = new XMLHttpRequest();
        request.open("GET", url, true);
        request.responseType = "arraybuffer";

        var self = this;

        request.onload = function () {
          // Asynchronously decode the audio file data in request.response
          self.context.decodeAudioData(
                  request.response,

                  function (buffer) {
                    if (!buffer) {
                      console.log('error decoding file data: ' + url);
                      return;
                    }
                    self.bufferList[url] = buffer;
                  });
        };

        request.onerror = function () {
          console.log('BufferLoader: XHR error');
        };

        request.send();
      },
      stopSoundWithUrl: function(url) {
        if(this.playingSounds.hasOwnProperty(url)){
          for(var i in this.playingSounds[url]){
            if(this.playingSounds[url].hasOwnProperty(i)) {
              this.playingSounds[url][i].stop(0);
            }
          }
        }
      }
    };

    /*
     * WebAudioAPISound Constructor
     */
    var WebAudioAPISound = function (url, options) {
      this.settings = {
        loop: false
      };

      for(var i in options){
        if(options.hasOwnProperty(i)) {
          this.settings[i] = options[i];
        }
      }

      this.url = url + '.mp3';
      this.volume = 1;
      window.webAudioAPISoundManager = window.webAudioAPISoundManager || new WebAudioAPISoundManager(window.audioContext);
      this.manager = window.webAudioAPISoundManager;
      this.manager.addSound(this.url);
      // this.buffer = this.manager.bufferList[this.url];
    };

    /*
     * WebAudioAPISound Prototype
     */
    WebAudioAPISound.prototype = {
      play: function () {
        var buffer = this.manager.bufferList[this.url];
        //Only play if it loaded yet
        if (typeof buffer !== "undefined") {
          var source = this.makeSource(buffer);
          source.loop = this.settings.loop;
          source.start(0);

          if(!this.manager.playingSounds.hasOwnProperty(this.url)) {
            this.manager.playingSounds[this.url] = [];
          }
          this.manager.playingSounds[this.url].push(source);
        }
      },
      stop: function () {
        this.manager.stopSoundWithUrl(this.url);
      },
      getVolume: function () {
        return this.translateVolume(this.volume, true);
      },
      //Expect to receive in range 0-100
      setVolume: function (volume) {
        this.volume = this.translateVolume(volume);
      },
      translateVolume: function(volume, inverse){
        return inverse ? volume * 100 : volume / 100;
      },
      makeSource: function (buffer) {
        var source = this.manager.context.createBufferSource();
        var gainNode = this.manager.context.createGain();
        source.connect(gainNode);
        gainNode.gain.value = this.volume;
        source.buffer = buffer;
        // source.connect(gainNode);
        gainNode.connect(this.manager.context.destination);
        return source;
      }
    };

    return WebAudioAPISound;
  })();

  let wrongWordSound = new NewAudioContext('wrong-word2');
  let doneWordSound = new NewAudioContext('done-word');
  let starVolume = new NewAudioContext('star');
  let newLevel = new NewAudioContext('new-level');
  let clickSound = new NewAudioContext('click');

  const lettersMap = {
      'q' : 'й', 'w' : 'ц', 'e' : 'у', 'r' : 'к', 't' : 'е', 'y' : 'н', 'u' : 'г', 'i' : 'ш', 'o' : 'щ', 'p' : 'з', '[' : 'х', ']' : 'ъ', 'a' : 'ф', 's' : 'ы', 'd' : 'в', 'f' : 'а', 'g' : 'п', 'h' : 'р', 'j' : 'о', 'k' : 'л', 'l' : 'д', ';' : 'ж', '\'' : 'э', 'z' : 'я', 'x' : 'ч', 'c' : 'с', 'v' : 'м', 'b' : 'и', 'n' : 'т', 'm' : 'ь', ',' : 'б', '.' : 'ю','Q' : 'Й', 'W' : 'Ц', 'E' : 'У', 'R' : 'К', 'T' : 'Е', 'Y' : 'Н', 'U' : 'Г', 'I' : 'Ш', 'O' : 'Щ', 'P' : 'З', '[' : 'Х', ']' : 'Ъ', 'A' : 'Ф', 'S' : 'Ы', 'D' : 'В', 'F' : 'А', 'G' : 'П', 'H' : 'Р', 'J' : 'О', 'K' : 'Л', 'L' : 'Д', ';' : 'Ж', '\'' : 'Э', 'Z' : '?', 'X' : 'ч', 'C' : 'С', 'V' : 'М', 'B' : 'И', 'N' : 'Т', 'M' : 'Ь', ',' : 'Б', '.' : 'Ю'
  };

  function params(data) {
    try{
      // eslint-disable-next-line no-undef
      ym(57682372, 'params', data);
      // eslint-disable-next-line no-empty
    }catch(ignored){}
  }
  let iOS = /iPad|iPhone|iPod/.test(navigator.userAgent) && !window.MSStream;
  if(iOS){
    document.documentElement.addEventListener('gesturestart', function (event) {
      event.preventDefault();
    }, false);
  }
  export default {
    name: 'App',
    data(){
      return {
        levels: true,
        content: false,
        lvl: 0,
        letters: [],
        selectedLetters: [],
        wordFromLetter: '',
        numOfLevels: allWords.length,
        location: loc,
        allLocations: allLocations,
        stars: allStars,
        nowWords: [],
        doneWords: [],
        tipCount: tips,
        isBadWord: false,
        rules: isRules,
        levelsAnim: false,
        shop: false,
        newWord: '',
        animWord: '',
        words: '',
        getStar: -1,
        animWordStart: '',
        isSounds: sounds,
        advShowNow: false,
        showAdvTip: false,
        isAdvShowed: false,
        isSettings: false,
        showGameAdv: false,
        isGameAdvShow: false,
        wordWasIndex: -1
      }
    },
    computed:{
      allStars(){
        return this.stars.reduce((acc, el)=> acc+ el, 0);
      }
    },
    methods:{
      advTip(){
        if(this.tipCount > 0) return false;
        return !!(showAdv && advTime);
      },
      changeGameAdvShow(){
        this.isGameAdvShow = false;
        localStorage.setItem('isGameAdvShow', 'true');
      },
      updateAll() {
        allStars = [];
        loc = 0;
        setLoc();
        this.stars = allStars;
        this.location = loc;
        this.tipCount = tips;
        localStorage.setItem('tips', this.tipCount);
        this.isSounds = sounds;
        console.log('update');
        if (document.querySelector(".pre-download")) {
          document.querySelector(".pre-download").remove()
        }
        this.openLastLevel();
      },
      getLevel(lvl, notSound){
        if(this.isCloseLevelShow(lvl+1))return;



        if(lvl % 100 === 0){
          params({[lvl]: 1});
        }






        this.advShowNow = false;
        this.levelsAnim = false;

        if(!notSound){
          this.isGameAdvShow = isGameAdvShow;
        }

        if(this.isSounds && !notSound){
          newLevel.play();
        }

        this.getStar = -1;
        setTimeout(()=>{
          this.levels = false;
        }, 500);

        this.content = true;

        this.newWord ='';
        this.animWord ='';
        this.animWordStart = '';

        this.lvl = lvl;
        this.wordFromLetter = '';
        this.word = allWords[lvl];
        this.doneWords = allDoneWords[this.word];
        this.selectedLetters = [];

        if(this.doneWords.length === 0){

            if(lvl === 1){
                reachGoal('level2');
            }else if(lvl === 9){
                reachGoal('level10');
            }else if(lvl === 49){
                reachGoal('level50');
            } else if(lvl === 99){
                reachGoal('level100');
            }
        }

        this.letters = this.word.split('');
        this.nowWords = wordsFromWords[this.word].sort((a, b)=>{
          if(a.length > b.length) return 1;
          if(a.length < b.length) return -1;
          return 0;
        });
        setTimeout(()=>{
          document.querySelector('.words').scrollTo({
            left: 0,
            behavior: "smooth"
          });
        }, 200);
        if(showAdv && advTime){
          setTimeout(()=>{
            showAdv();
            this.advShowNow = true;
            setTimeout(()=>{
              this.advShowNow = false;
            }, 10000)
          }, 300)
        }
      },
      getLevelByLevelAndLocation(level){
        return (this.location*21) + level;
      },
      toggleSettings(){
        this.isSettings = !this.isSettings;
      },
      addBuyTips(){
        this.tipCount += TIPS;
        localStorage.setItem('tips', this.tipCount);
        PLAYERSTATS.tips = this.tipCount;
        setStats();
      },
      buyTip(item){
        buyTips(item);
      },
      sendParams(par){
        try{
          params(par);
          }catch(ignored){}

      },
      toggleRules(){
        this.rules = !this.rules;
        this.sendParams({'openRules': 1});
      },
      toggleShop(){
        this.shop = !this.shop;
      },
      switchSounds(e){
        this.isSounds = e.target.checked;
        localStorage.setItem('sounds', this.isSounds);
      },
      closeShowAdvTip(){
        this.showAdvTip = false;
      },
      isCloseLevelShow(level){
        level--;
        if(level === 0 || (lastLevel === level-1 && this.stars[lastLevel] > 0)) return false;
        return lastLevel < level;
      },
      isLevelDone(level){
        level--;
        if(lastLevel === level && this.stars[lastLevel] === 0) return false;
        return lastLevel >= level;
      },
      pressKey(e){
        if(!this.content) return;
        if(this.animWordStart !== '') return;
        let letter = e.key;
        if(letter === 'Backspace'){
          this.selectedLetters.pop();
          this.wordFromLetter = this.wordFromLetter.slice(0, -1);
        }else if(letter === 'Enter'){
          this.sendWord();
        } else{
          letter = letter.toLowerCase();
          if(lettersMap[letter]) letter = lettersMap[letter];
          for(let i = 0; i < this.letters.length; i++){
            if(letter === this.letters[i] && !this.selectedLetters.includes(i)){
              this.selectedLetters.push(i);
              this.wordFromLetter += letter;
              if(this.isSounds){
                clickSound.play();
              }
              break;
            }
          }
        }
      },
      testShowNextLevel(){
        if(this.lvl === allWords.length-1)return false;
        let nowLoc = Math.floor((this.lvl)/21);
        let nextLoc = Math.floor((this.lvl+1)/21);
        if(nowLoc !== nextLoc){
          return this.allStars >= nextLoc * 32;
        }
        return this.stars[this.lvl] > 0;
      },
      nextLevel(){
        if(this.testShowNextLevel()){
          this.getLevel(this.lvl+1);
        }
      },
      prevLocation(){
        if(this.location > 0){
          this.location--;
          if(this.isSounds){
            clickSound.play();
          }
        }
      },
      nextLocation(){
        if(this.location < this.allLocations-1){
          this.location++;
          if(this.isSounds){
            clickSound.play();
          }
        }
      },
      selectLetter(index){
        if(this.animWordStart !== '') return;
        if(this.isSounds){
          clickSound.play();
        }
        let ind = this.selectedLetters.indexOf(index);

        if(ind >= 0){
          this.selectedLetters.splice(ind, 1);
          this.wordFromLetter = this.wordFromLetter.slice(0, ind) + this.wordFromLetter.slice(ind+1);
        }else if(ind === -1 ){
          this.selectedLetters.push(index);
          this.wordFromLetter += this.letters[index];
        }
      },
      backMenu(){
        if(this.isSounds){
          clickSound.play();
        }

        this.levels =  true;
        this.levelsAnim =  true;
        setTimeout(()=>{
          this.content = false;
        }, 500);

      },
      addTip(){
        this.tipCount++;
        localStorage.setItem('tips', this.tipCount);
        PLAYERSTATS.tips = this.tipCount;
        setStats();
      },
      getTip(){
        if(this.animWordStart !== '') return;
        if(this.tipCount < 1){
          if(showAdv && advTime){
            params({'showRewarded': 1});
            advTime = false;
            setTimeout(()=>{
              advTime = true;
            }, 180000);
            let isShowed = false;
            setTimeout(()=>{
              isShowed = true;
            }, 3000);
            let that= this;
            YSDK.adv.showFullscreenAdv({
              callbacks: {
                onClose: function() {
                  if(isShowed){
                    that.addTip();
                  }else{
                    that.showAdvTip = true;
                    that.isAdvShowed = false;
                    if(!isAdvShowed){
                      localStorage.setItem('isAdvShowed', 'true');
                      isAdvShowed = true;
                      that.isAdvShowed = true;
                      that.addTip();
                    }
                  }
                }
              }
            });
          }else{
            this.toggleShop();
          }
          return;
        }
        if(allDoneWords[this.word].length === wordsFromWords[this.word].length) return;
        this.tipCount--;
        localStorage.setItem('tips', this.tipCount);
        PLAYERSTATS.tips = this.tipCount;
        setStats();

        let arr = wordsFromWords[this.word].slice();
        for(let i = 0; i < this.doneWords.length; i++){
          arr.splice(arr.indexOf(this.doneWords[i]), 1);
        }
        let rand = Math.floor(Math.random()*arr.length);
        this.wordFromLetter = arr[rand];
        this.sendWord();
      },
      sendWord(){
        if(this.animWordStart !== '' || this.wordFromLetter.length === 0) return;
        if(this.nowWords.includes(this.wordFromLetter) && !this.doneWords.includes(this.wordFromLetter)){
          this.animWordStart = this.wordFromLetter;
          let wordFromLetter = this.wordFromLetter;
          this.wordFromLetter = '';
          this.selectedLetters = [];
          setTimeout(()=>{
            try{
              let scrollEl = document.querySelector('.animWordStart');
              scrollEl.scrollIntoView({behavior: 'smooth', block: "center", inline: "center"});
            }catch(e){
              console.log('Ошибка показа');
            }
            if(this.isSounds){
              doneWordSound.play();
            }
            this.addWord(wordFromLetter);
            this.animWord = wordFromLetter;
            this.newWord = wordFromLetter;
            localStorage.setItem('allDoneWords', JSON.stringify(allDoneWords));
            PLAYESTATE.allDoneWords = allDoneWords;
            setState();
            setTimeout(()=>{
              this.animWordStart = '';
              this.animWord = '';

              if(!this.testStars()){
                if(showAdv && advTime){
                  setTimeout(()=>{
                    showAdv();
                    this.advShowNow = true;
                    setTimeout(()=>{
                      this.advShowNow = false;
                    }, 10000)
                  }, 300)
                }
              }

            }, 1000)
          }, 100);

        }else{
          this.isBadWord = true;
          if(this.isSounds){
            wrongWordSound.play();
          }

          if(this.doneWords.includes(this.wordFromLetter)){
            this.wordWasIndex = this.nowWords.indexOf(this.wordFromLetter);
            setTimeout(()=>{
              try{
                let scrollEl = document.querySelector('.wordWas');
                scrollEl.scrollIntoView({behavior: 'smooth', block: "center", inline: "center"});
              }catch(e){
                console.log('Ошибка показа');
              }
            }, 100);

            setTimeout(()=>{
              this.wordWasIndex = -1;
            }, 1200)

          }

          setTimeout(()=>{
            this.isBadWord = false;
            this.wordFromLetter = '';
            this.selectedLetters = [];
          }, 400)
        }
      },
      testStars(){
        let stars = testStar(allDoneWords[this.word].length, wordsFromWords[this.word].length);
        if(stars > this.stars[this.lvl]){
          setLastLevel();
          this.getStar = stars;
          this.stars.splice(this.lvl, 1, stars);
          if(this.isSounds){
            starVolume.play();
          }
          setTimeout(()=>{
            this.getStar = -1;
            if(this.location > 7){
              this.tipCount += 3;
            }else if(this.location > 4){
              this.tipCount += 2;
            }else{
              this.tipCount++;
            }
            localStorage.setItem('tips', this.tipCount);
            PLAYERSTATS.tips = this.tipCount;
            setStats();

            if(showAdv && advTime){
              setTimeout(()=>{
                showAdv();
                this.showAdv++;
                this.advShowNow = true;
                setTimeout(()=>{
                  this.advShowNow = false;
                }, 10000)
              }, 300)
            }
          }, 1000);
          return true;
        }
        return false;

      },
      addWord(word){
        this.doneWords.push(word);
      },
      openLastLevel(){
        try{
          if(this.stars[lastLevel] > 0 && (lastLevel+1) !== allWords.length ) this.getLevel(lastLevel + 1, true);
          else this.getLevel(lastLevel, true);
        }catch(ignored){};
      }
    },
    mounted: function() {
      this.$nextTick(function() {
        if (doDeleteBlock) {
          if (document.querySelector(".pre-download")) {
            document.querySelector(".pre-download").remove()
          }
        }
        this.openLastLevel();
        document.addEventListener('keydown', this.pressKey)
      })
    }
  }
</script>



<style>
  ::-webkit-scrollbar-button {
    background-repeat:no-repeat;
    width:6px;
    height:0;
  }

  ::-webkit-scrollbar-track {
    background-color: #261624;
    -webkit-border-radius: 5px;
    border-radius: 5px;
  }

  ::-webkit-scrollbar-thumb {
    -webkit-border-radius: 5px;
    border-radius: 5px;
    background-color: #ad63b6;
  }

  ::-webkit-resizer{
    background-repeat:no-repeat;
    width: 5px;
    height: 0;
  }

  ::-webkit-scrollbar{
    width: 5px;
    height: 13px;
  }
  @font-face {
      font-family: 'Ubuntu-Light';
      src: url('assets/Ubuntu-Light.ttf');
      font-weight: normal;
      font-style: normal;
  }
  html,body
  {
    width:100%;
    height:100%;
    font: 10px/1.5 Ubuntu-Light, sans-serif;
    -webkit-tap-highlight-color: transparent;
    -ms-user-select: none;
    -moz-user-select: none;
    -webkit-user-select: none;
    touch-action: manipulation;
    user-select: none;
  }
  .switchSettings{
    width: 60px;
    height: 40px;
    margin-left: 10px;

    background: url(assets/menu.png) center center no-repeat;
    background-size: 60%;

    margin-top: 15px;

    cursor: pointer;
  }
  .switchRules{
    font-size: 3.5rem;
    color: #faf5ac;
    cursor: pointer;
  }
  .switchShop{
    width: 55.6px;
    height: 39px;

    margin-right: 10px;

    background: url("assets/shop.png") center center no-repeat;
    background-size: 75%;

    margin-top: 15px;

    cursor: pointer;
  }

  .rules-blackout{
    position: absolute;
    left: 0;
    top: 0;

    width: 100%;
    height: 100%;
    background: rgba(0, 0, 0, 0.5);

    cursor: pointer;
    z-index: 9;
  }
  .main-blackout{
    z-index: 11;
  }
  .rules{
    position: absolute;
    left: 50%;
    top: 50%;
    transform: translate(-50%, -50%);



    padding: 10px 15px 15px 15px;
    width: 520px;

    font-size: 1.4rem;
    color: #302431;

    border: 3px solid #9e6db5;
    border-radius: 15px;
    background-color: rgba(250,250,250, 0.9);


    z-index: 12;
  }
  .rules__cross{
    position: absolute;
    top: 15px;
    right: 15px;

    width: 30px;
    height: 30px;

    background: url(assets/cross.png) center center no-repeat;
    background-size: 100%;
    cursor: pointer;
  }
  .rules__menu{
    font-size: 3rem;
      line-height: 3rem;
    text-align: center;
    color: #302431;

    margin: 5px 0 15px 0;
  }
  #app, .game, .levels{
    background: url(assets/background2.png) 50% no-repeat;
    background-size: cover;
  }
  @media (min-width: 1800px) {
    #app, .game, .levels{
      background: url(assets/background.png) 50% no-repeat;
      background-size: cover;
    }
  }
  #app, .game, .property, .levels, .levels__property{
    position: relative;

    width: 100%;
    height: 100%;
    -webkit-tap-highlight-color: transparent;
    -ms-user-select: none;
    -moz-user-select: none;
    -webkit-user-select: none;
    touch-action: manipulation;
    user-select: none;

    overflow: hidden;
  }
  .game{
    position: absolute;
    top: 0;
    left: 0;
    z-index: 4;
    animation: getGameLevel 0.4s ease-in forwards;
  }
  .levelsAnim{
    z-index: 5;
    animation: getLevels 0.4s ease-in forwards;
  }
  @keyframes getLevels {
    0%{
      transform: translateX(-100%);
    }
    100%{
      transform: translateX(0);
    }
  }
  @keyframes getGameLevel {
    0%{
      transform: translateX(100%);
    }
    100%{
      transform: translateX(0);
    }
  }
  .property{
    display: flex;
    flex-flow: column nowrap;
    justify-content: space-between;
  }


  .blur{
    position: absolute;
    top: 0;
    left: 0;
    width: 100%;
    height: 100%;
    background-color: rgba(0,0,0,0.1);
  }


  /*Уровни*/
  .levels__property{
    z-index: 2;
    display: flex;
    justify-content: center;
    flex-flow: column nowrap;
    align-items: center;
  }
  .levels{

  }
  .levelsTop{
    position: absolute;
    left: 0;
    top: 0;

    display: flex;
    justify-content: space-between;

    width: 100%;
    height: 60px;
    z-index: 3;
  }
  .levelsTop__allStars{

    display: flex;
    justify-content: center;
    align-items: center;

    padding: 0 8px;


    font-size: 2.5rem;
    line-height: 2.5rem;
    color: #a15eb9;

    background-color: white;

    border: 3px solid #a15eb9;
    border-top: none;

    border-radius: 0 0 18px 18px;

    letter-spacing: 2px;
  }


  .levels .menu-star{
    width: 20px;
    height: 20px;

    margin-left: 5px;

    background: url(assets/menu-star.png) center center no-repeat;
    background-size: 100%;
  }
  .levelsTop__allStars .menu-star{
    width: 22px;
    height: 22px;
    margin-left: 0;

    background: url(assets/menu-all-star.png) center center no-repeat;
    background-size: 100%;
  }
  .sounds{
    right: 30px;
    top: 50%;
    transform: translateY(-50%);
    position: absolute;

    width: 30px;
    height: 30px;

    background: url(assets/sounds-off.png) center center no-repeat;
    background-size: 100%;

    cursor: pointer;
  }
  .sounds-on{
    background: url(assets/sounds-on.png) center center no-repeat;
    background-size: 100%;
  }
  .levels-wrapper{
    position: relative;

    display: flex;
    flex-flow: row wrap;
    justify-content: center;
    align-items: center;

    width: 100%;
    height: auto;

    margin-top: 60px;
    padding: 10px;
  }
  .level{
    position: relative;

    display: flex;
    justify-content: center;
    align-items: center;

    width: 60px;
    height: 60px;


    background-color: white;
    border: 3px solid #9f66ad;
    border-radius: 50%;

    margin: 0 20px 30px 0;

    font-size: 2.9rem;
    color: #9f66ad;

    cursor: pointer;

    box-shadow: 0 0 5px hsla(0,0%,100%,.2);

  }
  .levels-wrapper::before, .levels-wrapper::after {
    content: '';
    width: 100%;
    order: 1;
  }
  .level:nth-child(7n){
    margin-right: 0;
  }
  .level:nth-child(n + 8) {
    order: 1;
  }
  .level:nth-child(n + 15) {
    order: 2;
  }
  .level-done{
    color: #bb9bc5;
    border-color: #bb9bc5;
    box-shadow: none;
  }
  .level_close{
      border-color: #cabdcf;
  }
  .close-level{
    position: absolute;
    top: 0;
    left: 0;

    width: 100%;
    height: 100%;

    border-radius: 50%;
    background: url(assets/close-level.png) center center no-repeat;
    background-size: 50%;

    cursor: auto;
  }
  .menu__level_stars{
    display: flex;

    justify-content: center;
  }
  .level .menu__level_stars{
    position: absolute;
    left: 0;
    bottom: -21px;

    width: 100%;

    cursor: auto;

    justify-content: space-around;
  }
  .menu__level_stars .menu-star{
    width: 15px;
    height: 15px;
    margin: 0;

  }



  /*Игра*/
  .property{
    z-index: 2;
  }
  /*Меню*/
  .menu{
    position: absolute;
    left: 0;
    top: 0;

    width: 100%;
    padding: 5px 0;

    display: flex;
    justify-content: space-around;
    align-items: center;


    color: white;

    background: rgba(0,0,0,0.1);

    z-index: 3;
  }
  .menu__button-back, .menu__tip, .menu__button-next-level{
    width: 30px;
    height: 30px;

    background: url(assets/bars.png) center center no-repeat;
    background-size: 100%;
    border: none;
    cursor: pointer;

    outline: none;
  }
  .menu__tip{
    position: relative;

    width: 24px;
    height: 38px;

    background: url(assets/tip.png) center center no-repeat;
    background-size: 100%;
  }
  .menu__tip_count, .advert{
    position: absolute;
    bottom: 0;
    right: -3px;

    display: flex;
    justify-content: center;
    align-items: center;

    padding: 0 4px;

    font-size: 0.7rem;

    background-color: #ad63b6;
    border-radius: 5px;
  }
  .advert{
    width: 15px;
    height: 15px;

    background: url("assets/advert.png") center center no-repeat white;
    background-size: 80%;
  }
  .menu__level, .menu__words-amount{
    font-size: 1.6rem;
    letter-spacing: 1px;
  }
  .menu__words-amount{
    min-width: 60px;
  }
  .menu__button-next-level{
    background: url(assets/angle-right_gray.png) center center no-repeat;
    background-size: 70%;
  }
  .menu__button-next-level, .menu__button-next-level:active{
    outline: none;
  }
  .menu__button-next-level_active{
    background: url(assets/angle-right_white.png) center center no-repeat;
    background-size: 70%;
  }
  .menu__button-next-level_active:active{
    transform: scale(0.98);
  }
  .menu__level .level_star{
    margin-right: 2px;

  }
  .level_star{
    width: 15px;
    height: 15px;

    background: url(assets/empty-star.png) center center no-repeat;
    background-size: 100%;

  }
  .level_full-star.getStar{
    animation: showFullStar 1s forwards;
  }
  .level_full-star{
    background: url(assets/menu-star.png) center center no-repeat;
    background-size: 100%;
  }
  @keyframes showFullStar {
    0%{
      transform: scale(1);
    }
    50%{
      transform: scale(2);
    }
    100%{
      transform: scale(1);
      background: url(assets/menu-star.png) center center no-repeat;
      background-size: 100%;
    }

  }
  .next-location, .prev-location{
    position: absolute;
    top: 50%;
    transform: translateY(-50%);

    width: 30px;
    height: 40px;


    background: url(assets/angle-right_white.png) center center no-repeat;
    background-size: 100%;

    cursor: pointer;
    z-index: 2;
  }
  .next-location:active{
    transform: translateY(-50%) scale(0.98);
  }
  .next-location{
    right: 5px;
  }
  .prev-location{
    left: 5px;
    transform: translateY(-50%) rotate(180deg);
  }
  .prev-location:active{
    transform: translateY(-50%) rotate(180deg) scale(0.98);
  }
  /*Блок со всеми словами*/
  .words{
    display: flex;
    flex-flow: column wrap;

    width: 100%;
    max-height: 59%;

    margin: 50px 0 10px 0;

    padding: 10px;

    overflow-x: auto;
  }
  .words::-webkit-scrollbar { width: 0; }
  .words__letters-block{
    display: flex;
    flex-flow: row nowrap;


    margin-bottom: 5px;
    padding-right: 30px;
  }
  .words__letters-block_done .words__letter, .action-block__letters .action-block__letter_selected{
    background-color: rgba(166,82,174,0.9);
    color: white;
  }
  .words__letter, .action-block__letter{
    display: flex;
    justify-content: center;
    align-items: center;

    width: 25px;
    height: 25px;

    margin: 1px;

    border-radius: 3px;

    font-size: 1.8rem;
    text-transform: uppercase;

    background-color: rgba(255, 255, 255, 0.9);

  }
  .animWord .words__letter{
    animation: 1s showNewWord forwards;
    /*animation-delay: 0.2s;*/
  }
  .newWord .words__letter{
    background-color: rgba(217, 109, 227, 0.9);
  }
  @keyframes  showNewWord{
    0%{
      background-color: rgba(255, 255, 255, 0.9);
    }
    100%{
      background-color: rgba(217, 109, 227, 0.9);
    }
  }
  /*Взаимодействие*/
  .action-block__done-word{
    min-height: 30px;

    font-size: 2.3rem;
    line-height: 2.3rem;
    text-align: center;
    color: white;
    text-transform: uppercase;
    letter-spacing: 1px;
  }
  .done-word{
    position: relative;
    display: inline-block;
  }
  .badWord{
    animation: tremor 0.05s ease-in-out infinite;
  }

  @keyframes tremor2 {
    0%{
      background-color: rgba(166,82,174,0.9);
    }
    100% {
      background-color: rgba(87, 41, 100, 0.9);
    }
  }

  .wordWas .words__letter{
    /*animation: tremor2 1s ease-in-out;*/
    background-color: rgba(87, 41, 100, 0.9);
  }



  /*Магазин*/
  .shop{
    min-height: 280px;
      border: 3px solid #9e6db5;
    border-radius: 15px;
      background-color: rgba(250,250,250, 0.9);

      height: 310px;

    min-width: 500px;
    width: 540px;
  }
  .shop .rules__menu{
    margin: 5px 0 15px 0;
      color: #514056;
  }
  .shop__cart{
    display: flex;
    justify-content: space-between;
    align-items: center;

      height: 225px;
  }
  .shop__cart__item{
      display: flex;
      flex-flow: column nowrap;
      justify-content: space-around;

    height: 100%;

    background-color: white;
      border: 1px solid #9e6db5;
    padding: 5px;
    border-radius: 10px;

    width: 150px;

      cursor: pointer;

  }
  .shop__cart__name{
    margin: 15px 0 5px 0;
    text-align: center;
      color: #9b6aab;
    font-size: 1.3rem;
      border-bottom: 1px solid #9b6aab;
  }
  .shop__cart__item_1, .shop__cart__item_2, .shop__cart__item_3, .shop__cart__item_4{
    position: relative;
    width: 100%;
    height: 130px;
      flex: 1 0;
  }

  .cart__item_tip{
    position: absolute;
    top: 80%;
    right: 25%;
    bottom: auto;
    font-size: 1.2rem;
    padding: 0 6px;
  }


  .shop__cart__item_2 {
    background: url("assets/cart__item-2.png") center bottom no-repeat;
    background-size: 40%;
  }
  .shop__cart__item_2 .cart__item_tip{
    right: 28%;
  }
  .shop__cart__item_3 {
    background: url("assets/cart__item-3.png") center bottom no-repeat;
    background-size: 50%;
  }
  .shop__cart__item_3 .cart__item_tip{
    right: 29%;
  }
  .shop__cart__item_4 {
    background: url("assets/cart__item-4.png") center bottom no-repeat;
    background-size: 70%;
  }
  .shop__cart__item_4 .cart__item_tip{
    right: 31%;
  }

  .shop__cart__buy-button{
    text-align: center;
    font-size: 1.5rem;

      color: #514056;
  }
  .shop__cart__buy-button:hover{
    box-shadow: none;
  }
  .shop__cart__buy-button:active{
    transform: scale(0.98);

  }
  .cart__item_tip{
    top: 83%;
  }






  @keyframes tremor {
    0%, 25% {
      left: -1px;
      transform: translateX(-5%);
    }
    50%, 100% {
      left: 1px;
      transform: translateX(5%);
    }
  }
  .action-block__letters{
    display: flex;
    justify-content: center;
    align-items: center;
    margin-bottom: 15px;
  }
  .action-block__letter{
    width: 40px;
    height: 40px;

    font-size: 2.4rem;
    margin-right: 5px;

    cursor: pointer;
    -ms-user-select: none;

    -moz-user-select: none;
    -khtml-user-select: none;


    -webkit-user-select: none;
  }
  .action-block__button-send{
    display: block;

    margin: 0 5px 2px 25px;

    width: 41px;
    height: 41px;

    background: url(assets/angle-right.png) center center no-repeat, rgba(255, 255, 255, 0.9);
    background-size: 17px 29px;

    border-radius: 3px;



    cursor: pointer;

    outline: none;
  }
  .action-block__button-send:active{
    transform: scale(0.98);
    outline: none;
  }
  @media (max-width: 600px) {
    .level{
      width: 55px;
      height: 55px;
      margin-right: 17px;
    }
  }
  @media (min-width: 1000px) {
    .rules__menu{
      font-size: 3.5rem;
      line-height: 3.5rem;
    }
    .rules{
      font-size: 2rem;
      padding: 20px 30px 30px 30px;
      width: auto;

      max-width: 650px;
    }

    .rules__cross{
      top: 25px;
      right: 25px;
      width: 35px;
      height: 35px;
    }

    .advert {
      width: 20px;
      height: 20px;
    }
    .game{
      padding-bottom: 150px;
    }



    .shop{
      width: 650px;
      height: 350px;
    }
    .shop__cart{
      height: 255px;
    }
    .shop__cart__item{
      width: 180px;
    }

    .shop__cart__name{
      font-size: 1.7rem;
    }

    .shop__cart__buy-button{
      font-size: 1.85rem;
    }




    .levels-wrapper{
      margin: 0 auto;
    }
    .property, .levels-wrapper{
      max-width: 1200px;
      margin: 0 auto;
    }
    .level{
      width: 90px;
      height: 90px;

      margin-bottom: 40px;

      font-size: 4.3rem;
    }
    .level .menu__level_stars{
      bottom: -27px;
    }
    .level_star{
      width: 22px;
      height: 22px;
    }


    /*Игра*/
    .menu__button-back, .menu__button-next-level, .prev-location, .next-location{
      width: 40px;
      height: 40px;
    }
    .menu__words-amount{
      font-size: 2rem;
    }
    .menu__level{
      font-size: 2rem;
    }
    .close-level{
      background-size: 50%;
    }
    .level_star, .level_star.menu-star{
      width: 20px;
      height: 20px;
    }
    .menu__tip{
      width: 32px;
      height: 50px;
    }
    .menu__tip_count{
      font-size: 1rem;
    }
    .cart__item_tip{
      font-size: 1.3rem;
    }



    .words{
      margin-top: 60px;
      padding: 20px;
    }
    .words__letter{
      width: 40px;
      height: 40px;

      font-size: 2.5rem;
    }
    .action-block__letter{
      width: 60px;
      height: 60px;
      font-size: 3.3rem;
    }
    .action-block__button-send{
      width: 62px;
      height: 62px;
    }
    .action-block__done-word{
      font-size: 2.7rem;
    }
  }

  .shop__cart__prices{
    display: flex;
    flex-flow: column nowrap;
    justify-content: space-between;
    align-items: center;
  }
  .last-price{
    display: none;
    position: relative;
    margin-right: 5px;
  }
  .now-price{
    margin-right: 4px;
  }
  .last-price:before{
    content: "";
    width: 2px;
    height: 90%;
    left: 40%;
    top: 1px;
    background-color: #ee4051;
    position: absolute;
    transform: rotate(120deg) translateX(-50%);
  }
  .adv-show{
    min-width: auto;
    width: 350px;
    text-align: center;
    font-size: 1.8rem;
  }
  .adv-show .rules__menu{
    font-size: 3rem;
  }
  .adv-show .rules__cross{
    width: 30px;
    height: 30px;
  }

  @media (min-width: 1000px) {
    .adv-show{
      padding: 20px;
      width: 350px;
      font-size: 2rem;
    }
    .adv-show .rules__menu{
      font-size: 3rem;
    }
    .adv-show .rules__cross{
      top: 26px;
      right: 22px;
      width: 32px;
      height: 32px;
    }
  }
  .ya-rules{
    padding: 5px 5px 10px 5px;
  }
  .ya-rules .rules__menu{
    font-size: 4rem;
  }
  .ya-button{
    width: 150px;
    padding: 5px 0;
    margin: 10px auto 0 auto;
    font-size: 2.3rem;
  }

  /*Настройки*/
  .settings{
    position: absolute;
    left: 0;
    top: 0;
    width: 220px;
    height: 100%;
    padding: 10px;
    margin-left: auto;


    background-color: white;




    z-index: 10;

    animation: showSettings 0.4s ease-in-out forwards;

    overflow-y: auto;

  }

  .settings ul{
    padding: 0;
  }
  .settings__blackout{
    background-color: rgba(0, 0, 0, 0.3);
    z-index: 3;

    cursor: pointer;
  }
  .settings__blackout{
    animation: showBlackout 0.4s ease-in-out forwards;
  }

  @keyframes showBlackout {
    0%{
      opacity: 0;
    }
    100%{
      opacity: 1;
    }
  }
  @keyframes showSettings {
    0%{
      transform: translateX(-100%);
    }
    100%{
      transform: translateX(0);
    }
  }
  .settings__header{
    text-align: center;
    font-size: 2rem;
    color: #111112;

    padding-bottom: 5px;
    border-bottom: 1px solid rgba(0,0,0,0.4);

    margin-bottom: 10px;
  }
  .settings li{
    display: flex;
    align-items: center;
    margin-top: 15px;
  }
  .settings__name{
    flex: 1;
    font-size: 1.5rem;
  }




  .checkbox {
    position: absolute;
    z-index: -1;
    opacity: 0;
    margin: 10px 0 0 20px;
    user-select: none;
    -webkit-tap-highlight-color: rgba(0, 0, 0, 0);
  }
  .checkbox + label {
    position: relative;

    width: 100%;

    display: flex;
    align-items: center;
    font-size: 1.7rem;


    cursor: pointer;
    padding-right: 50px;
  }

  .checkbox + label:before {
    content: "";
    position: absolute;
    top: 50%;
    transform: translateY(-50%);
    right: 0;
    width: 45px;
    height: 20px;
    border-radius: 15px;
    background: #CDD1DA;
    box-shadow: inset 0 2px 3px rgba(0, 0, 0, 0.2);
    transition: 0.2s;
  }
  .checkbox + label:after {
    content: "";
    position: absolute;
    top: 50%;
    transform: translateY(-53%);
    right: 28px;
    width: 21px;
    height: 21px;
    border-radius: 50%;
    background: white;
    box-shadow: 0 2px 5px rgba(0, 0, 0, 0.3);
    transition: 0.2s;
  }
  .checkbox:checked + label:after {
    right: 0;
  }
  .checkbox:checked + label:before {
    background: #a95dbc;
  }

  .settings__text{
    font-size: 1.7rem;
    color: #955ea5;

    cursor: pointer;
  }


  .our-games{
    font-size: 2rem;
    color: #7f3e90;
  }
  /*.wfw{*/
  /*  background: url(wfw.png) center center no-repeat;*/
  /*}*/
  .wfl{
    background: url(assets/wfl.png) center center no-repeat;
  }
  .crs{
    background: url(assets/crs.png) center center no-repeat;
  }
  .stm{
    background: url(assets/stm.png) center center no-repeat;
  }
  /*.tm{*/
  /*  background: url(tm.png) center center no-repeat;*/
  /*  border: 1px solid rgba(0,0,0,.05);*/
  /*  border-left: 0;*/
  /*  border-right: 0z§;*/
  /*  border-radius: 6px;*/
  /*}*/
  .my-game{
    width: 140px;
    height: 80px;
    background-size: 100%;
  }


  @media (min-width: 1000px) {
    .settings__header{
      font-size: 2.9rem;

      margin-bottom: 20px;
    }
    .my-game{
      width: 180px;
      height: 100px;

    }
    .settings{
      width: 300px;
    }
  }

  /*Реклама кроссвордов*/
  .advertCrossword{
    padding: 10px 0 0 0;

    overflow: hidden;
  }
  .advertCrossword .rules__menu{
    font-size: 2.2rem;
    line-height: 2.2rem;
  }
  .advertCrossword .rules__cross{
    width: 22px;
    height: 22px;
  }

  .advertCrossword__image{
    display: block;

    position: relative;

    width: 100%;
    height: 250px;

    border-top: 3px solid #9e6db5;

    background: url(assets/advertCross.png) center center no-repeat;
    background-size: cover;

    padding: 0 15px;

    cursor: pointer;
  }


  .advertCrossword__blur{
      position: absolute;
      top:0;
    left: 0;

    width: 100%;
    height: 100%;

    background-color: rgba(0,0,0,0.1);
  }
  .advertCrossword__text{
    position: relative;
    margin-top: 20px;
    text-align: center;
    color: white;
    font-size: 2.9rem;
    line-height: 2.9rem;

    text-shadow: 0 0 5px #9767ad;

  }

  .openCrossword {
    position: absolute;
    left: 50%;
    bottom: 15px;
    transform: translateX(-50%);

    padding: 4px 22px;

    border-radius: 8px;
    background: rgb(186,146,194);
    background: linear-gradient(180deg, rgba(186,146,194,1) 0%, rgb(185, 123, 191) 40%, rgb(154, 91, 160) 100%);

    font-size: 2.4rem;

    color: white;

  }

  @media (min-width: 1000px) {
    .advertCrossword .rules__menu {
      font-size: 2.5rem;
      line-height: 2.5rem;
    }
    .advertCrossword .rules__cross {
      top: 15px;
      right: 15px;
      width: 25px;
      height: 25px;
    }
  }


    @media (max-height: 350px) {
        .levelsTop__allStars{

            padding: 0 9px;

            font-size: 2.3rem;
            line-height: 2.3rem;

            border-width: 2px;

            height: 90%;

        }

    }
  a{
    text-decoration: none;
  }

</style>
