<template>
  <div id="app">
<!--    <div class="close-level-help prev-location next-location"></div>-->
    <div class="levels"
         @updateAll="updateAll()"
         @buyTips="addBuyTips()"
         v-show="levels" :class="[levelsAnim ? 'levelsAnim' : '']">
      <div class="blur"></div>
      <div class="opacity"></div>




      <div class="levelsTop">
        <div class="leftTopMenu">
          <div class="switchRules" @click="toggleRules()">?</div>
          <div class="switchShop" @click="toggleShop()"></div>

        </div>

        <div class="levelsTop__allStars">
          {{allStars}}/{{numOfLevels*3}}
        </div>
        <div class="menu-star"></div>
        <div class="sounds" @click="switchSounds" :class="isSounds ? 'sounds-on' : ''"></div>
      </div>



      <div class="levels__property">
        <div class="levels-wrapper">
          <div class="level" v-for="level in 21" :key="getLevelByLevelAndLocation(level)"
          @click="getLevel(getLevelByLevelAndLocation(level)-1)" :class="stars[getLevelByLevelAndLocation(level)-1] > 0 ? 'level-done' : ''">
            <div v-show="isLevelNumberShow(getLevelByLevelAndLocation(level))">{{getLevelByLevelAndLocation(level)}}</div>
            <div class="menu__level_stars">
              <div class="level_star" v-for="star in 3" :key="star"
                   :class="star <= stars[getLevelByLevelAndLocation(level)-1] ? 'menu-star' : ''"></div>
            </div>
            <div class="close-level" v-if="isCloseLevelShow(getLevelByLevelAndLocation(level))"></div>
          </div>
          <div class="prev-location" @click="prevLocation()" v-if="location > 0"></div>
          <div class="next-location" @click="nextLocation()" v-if="location < allLocations-1"></div>


        </div>
        <div class="close-location" v-show="allStars < location*32">
          <div class="big-close"></div>
          <div class="close-stars">
            {{allStars}}/{{location*33}}
            <div class="level_star"></div>
          </div>
        </div>
      </div>
      <div class="rules-blackout" v-show="rules" @click="toggleRules()"></div>
      <div class="rules-blackout" v-show="shop" @click="toggleShop()"></div>



      <div class="rules shop" v-show="shop">
        <div class="rules__cross shop__cross" @click="toggleShop()"></div>
        <h2 class="rules__menu">
          Магазин
        </h2>
        <div class="shop__cart">
          <div class="shop__cart__item">
            <div class="shop__cart__item_1">
              <div class="cart__item_tip menu__tip_count">5</div>
            </div>
            <div class="shop__cart__name">5 подсказок</div>
            <div class="shop__cart__buy-button" @click="buyTip(1)">29 рублей</div>
          </div>


          <div class="shop__cart__item">
            <div class="shop__cart__item_2">
              <div class="cart__item_tip menu__tip_count">20</div>
            </div>
            <div class="shop__cart__name">20 подсказок</div>
            <div class="shop__cart__buy-button" @click="buyTip(2)">99 рублей</div>
          </div>


          <div class="shop__cart__item">
            <div class="shop__cart__item_3">
              <div class="cart__item_tip menu__tip_count">50</div>
            </div>
            <div class="shop__cart__name">50 подсказок</div>
            <div class="shop__cart__buy-button" @click="buyTip(3)">199 рублей</div>
          </div>


          <div class="shop__cart__item">
            <div class="shop__cart__item_4">
              <div class="cart__item_tip menu__tip_count">100</div>
            </div>
            <div class="shop__cart__name">100 подсказок</div>
            <div class="shop__cart__buy-button" @click="buyTip(4)">299 рублей</div>
          </div>



        </div>

      </div>






      <div class="rules" v-show="rules">
        <div class="rules__cross" @click="toggleRules()"></div>
        <h2 class="rules__menu">
          Управление
        </h2>
        Добро пожаловать в игру "Слова из слова".
          Цель игры - составлять всевозможные слова из выданных вам слов.
          Нажимайте на буквы снизу, чтобы добавить или убрать эту букву из слова.
          Когда слово будет собрано - нажмите на стрелку, чтобы проверить, есть ли такое слово.
          Если у вас закончились идеи, нажмите на подсказку.
          Подсказки можно получить за звёзды, а также за просмотр рекламы.
          Уровень пройден на 33% - 1 звезда, 66% - 2 звезды, 100% - 3 звезды.
          Удачной игры!
      </div>



    </div>



    <div class="game" v-show="content">
      <div class="blur"></div>
      <div class="opacity"></div>


      <header class="menu">
        <button class="menu__button-back" @click="backMenu"></button>
        <div class="menu__words-amount">
          {{doneWords.length}}/{{nowWords.length}}
        </div>
        <div class="menu__level">
          УРОВЕНЬ {{lvl+1}}
          <div class="menu__level_stars">
            <div class="level_star" v-for="star in 3" :key="star"
                 :class="[star <= stars[lvl] ? 'level_full-star' : '',
                      getStar === star ? 'getStar' : '']"></div>
          </div>
        </div>
        <div class="menu__tip" @click="getTip()">
          <div class="advert" v-if="advTip() && !advShowNow"></div>
          <div class="menu__tip_count" v-else>{{tipCount}}</div>
        </div>
        <button class="menu__button-next-level"
                :class="[testShowNextLevel() ? 'menu__button-next-level_active' : '']"
                @click="nextLevel()">
        </button>
      </header>



      <div class="property">
        <div></div>






        <div class="words">
          <div class="words__letters-block"
               v-for="word in nowWords" :key = "word"
               :class="[doneWords.includes(word) ? 'words__letters-block_done' : '',
               animWord === word ? 'animWord' : '',
                animWordStart === word ? 'animWordStart' : '',
                newWord === word ? 'newWord' : '']">
            <div class="words__letter"
                 v-for="letter in word" :key = "letter + Math.random()"
                >{{doneWords.includes(word) ? letter : '' }}</div>
          </div>

        </div>





        <div class="action-block">
          <div class="action-block__done-word">
              <div class="done-word" :class="[isBadWord ? 'badWord' : '']" >{{wordFromLetter}}</div>
          </div>
          <div class="action-block__letters">
            <div class="action-block__letter"
                 @click="selectLetter(index)"
                 :class="[selectedLetters.includes(index) ?
                  'action-block__letter_selected' : '']"
                 v-for="(letter,index) in letters" :key="letter + Math.random()">{{letter}}
            </div>
            <button class="action-block__button-send" @click="sendWord"></button>
          </div>
        </div>
      </div>
    </div>

  </div>

</template>

<script>
  let advTime = true;
  let showAdv, playerGame, payments, YSDK;
  let allWords = [
    "милость", "формула", "арматура", "телёнок", "записка", "дизайнер", "пипетка", "животное", "желтозём", "буржуазия", "диаграмма", "хромосома", "щитовидка", "архаизм", "шизофрения", "яйцеклетка", "антоним", "бедняга", "трактат", "сожитель", "корчёвка",
    "жаркое", "рутина", "комедия", "ломбард", "анатомия", "баталист", "косточка", "экономия", "эвкалипт", "барашек", "боярышник", "двигатель", "гидрология", "голограмма", "громоотвод", "свиристель", "устройство", "ультиматум", "этимология", "юрисдикция", "абордаж",
    "подруга", "продукт", "единорог", "писатель", "вермишель", "язычество", "богатство", "стоматолог", "ускорение", "уничтожение", "заклёпка", "картёжник", "надёжность", "авиасалон", "аквариум", "арматурщица", "безматок", "блиндаж", "вафельщица", "горбуша", "джокер",
    "автор", "повесть", "жестокость", "мартышка", "жаворонок", "чернослив", "вафельница", "целомудрие", "блокнот", "буквоед", "нахлёстка", "боксит", "боровик", "брусок", "валькирия", "выкаливание", "деноминация", "инобытие", "корифей", "кульман", "надсечка",
    "блузка", "гвардия", "отслоение", "бездельник", "батиплан", "гортензия", "задевание", "ископаемое", "квашнин", "коллапс", "концессия", "лексика", "мединститут", "написание", "отблеск", "паутинка", "прорезка", "пугало", "синева", "синтепон", "смелость",
    "шарлотка", "агрономия", "эвристика", "авиамодель", "художество", "архаист", "воеводство", "выразитель", "купюра", "наложение", "обращение", "осознание", "поднебесная", "прелесть", "призвание", "прямота", "самозащита", "сроднение", "стенопись", "термометр", "фальшивка",
    "аэросъёмка", "вакуумметр", "ворсильщик", "забавник", "раздор", "сифонофора", "склёпщица", "стрела", "трешкоут", "щеглёнок", "студень", "томагавк", "абрикос", "боеголовка", "мармеладка", "декстрин", "кукарекание", "развозчица", "сценичность", "телебашня", "хлорка",
    "автомобиль", "ассиметрия", "газопровод", "сейсмограф", "бесшумность", "минутка", "подбородок", "подросток", "прообраз", "флорист", "штурмовик", "самоанализ", "кассатор", "проволока", "растирание", "хохотание", "пульсация", "самородок", "вентилятор", "амортизатор", "родник",
    "маркетинг", "инкубатор", "малахит", "паровоз", "русалочка", "валерьянка", "поломка", "двустволка", "гранатомёт", "программист", "потолок", "кооператив", "суходол", "забастовка", "странствие", "туземка", "снегурочка", "цесарка", "экскаватор", "напёрсток", "фиаско",
    "автомеханик", "адсорбент", "абажур", "всемирность", "глухонемота", "интрига", "адмирал", "крематорий", "монетарист", "коленка", "отстранение", "критика", "прибалтика", "разработка", "распилка", "костёр", "эмират", "удабривание", "федералист", "требование", "молодчина",
    "антисептик","металлург","микрофауна","декламация","окуривание","сберкасса","назревание","скапывание","скирдовоз","актинограф","югославка","пересушка","обтирка","паголенок","холстина","гарпунщик","ковроделка","тундрянка","дворянство","выработка","рутинность","камерунка","легковушка","пластеин","совнарком","поддувание","пустырник","гидростат","минотавр","флибустьер","тюрчанка","лоббистка","морзянка","экспедитор","автогигант","полярник","константа","боливийка","сортимент","повстание","провокатор","велогонщик","астероид","проминка","каллиграф","отгнивание","марказит","подсечка","каретник","проскачка","шпротина","авиадесант","полиритмия","библиотека","платинка","русистика","чалмоносец","буртование","крановщик","парусность","оргкомитет","платочек","обтирание","надхвостье","секундант","бульдозер","нитрование","самокатка","сопельщик","отрадность","экономист","тамплиер","прогалина","раздутость","франциско","африканер","пародонтоз","ликтрос","мерлушка","остекление","картавость","голкипер","экстремизм","акробат","паремейник","светокопия","разоритель","содержание","автосалон","конформист","бардачок","темперация","альпинист","кармелит","терновник","синекдоха","треуголка","казачество","подчеканка","метрдотель","самоохрана","бутылконос","пародист","оставление","некробиоз"
  ];
  let wordsFromWords = {
    "подруга": ["ад", "ар", "арго", "гад", "го", "год", "гора", "град", "груда", "гурда", "дар", "даур", "до", "дог", "дора", "драп", "дрога", "друг", "дуга", "огпу", "ода", "одр", "ор", "орда", "па", "пар", "подгар", "пора", "пруд", "пуд", "пудра", "пурга", "рагу", "рог", "род", "руда", "угар", "угода", "удар", "упад", "упор", "урод"],
    "автомобиль": ["авто", "автол", "аил", "альбом", "альт", "атом", "бал", "било", "бит", "бита", "битва", "блат", "боа", "бола", "болт", "боль", "бот", "ботва", "вал", "виола", "вобла", "вол", "вольта", "ива", "ил", "илот", "ильм", "лимб", "лоб", "лов", "лом", "ломота", "ломоть", "лот", "лото", "малов", "мат", "мать", "ми", "мол", "молва", "молитва", "молот", "молотьба", "моль", "мольба", "мольва", "мот", "мотив", "обвал", "облов", "облом", "обмол", "обои", "обол", "овал", "олива", "ом", "отбив", "отвал", "отлив", "отлов", "табло", "тал", "талиб", "тимол", "тол", "толь", "том", "тьма"],
    "маркетинг": ["агент", "акт", "анкер", "ант", "ар", "артем", "гаер", "гектар", "ген", "герма", "гетман", "гиена", "гит", "гитан", "гран", "гранит", "грант", "грек", "греки", "гренки", "игра", "игрек", "ик", "икра", "иман", "каин", "камин", "кантри", "каре", "кармин", "карт", "кат", "катрен", "кератин", "керн", "кета", "кит", "кран", "крем", "кретин", "маг", "мак", "макет", "маки", "манер", "мари", "март", "мартен", "мат", "мена", "мент", "мерин", "мерка", "метан", "метр", "метрика", "миг", "мигрант", "мир", "мирта", "митенка", "митра", "натр", "нега", "нектар", "немка", "нитка", "рак", "рант", "ратин", "ратник", "рема", "рента", "ринг", "ринк", "ритм", "танк", "танкер", "теин", "тени", "термин", "тигр", "тик", "тина", "тир", "тире", "трагик", "трак", "трек", "трен"],
    "автор": ["авто", "ар", "вар", "вор", "втора", "ор", "орт", "отвар", "рвота", "ров", "рот", "рота", "тавр", "тавро", "товар", "тора"],
    "блузка": ["азу", "аул", "бак", "бал", "баул", "блуза", "буза", "бук", "бука", "булка", "зал", "злак", "зуб", "кал", "клуб", "куб", "лак", "луб", "лук", "лука", "указ"],
    "жаркое": ["акр", "ар", "арк", "жар", "жарок", "жор", "кар", "каре", "кожа", "кора", "корж", "ор", "орк", "рак", "ре", "река", "рожа", "рок"],
    "рутина": ["анри", "ант", "ар", "аут", "натр", "нут", "рант", "ратин", "раут", "руина", "руна", "рута", "тина", "тир", "тиран", "тиун", "тун", "туна", "тур", "тура", "турин", "униат", "уран", "урина", "урна"],
    "абрикос": ["абрис", "акр", "ар", "арк", "ас", "бак", "бар", "барк", "барс", "бас", "баск", "баски", "басок", "бикс", "бирка", "боа", "бок", "бокс", "бора", "бра", "брак", "брас", "брик", "ик", "икра", "икс", "иск", "искра", "кар", "кариб", "киса", "кобра", "кора", "коса", "краб", "окрас", "ор", "орк", "орс", "оса", "оскар", "раб", "раис", "рак", "рис", "риск", "риска", "роба", "рок", "роса", "сабо", "саиб", "сбор", "сбора", "сборка", "сборки", "си", "скарб", "скоба", "сок", "сор", "срок", "бор"],
    "гвардия": ["ад", "ар", "ария", "вар", "варяг", "варяги", "виг", "вид", "вира", "враг", "гад", "гид", "гидра", "гиря", "град", "грива", "гряда", "дар", "ива", "игра", "ирга", "ряд", "яд", "яр", "ярд"],
    "записка": ["апис", "ас", "заика", "запас", "ик", "икс", "иск", "кипа", "киса", "па", "паз", "пак", "пас", "паск", "пик", "пика", "писака", "писк", "саз", "сапа", "сапка", "си", "сип", "сказ", "скип"],
    "комедия": ["дек", "до", "док", "дом", "домик", "едок", "идея", "ик", "имя", "иод", "код", "ком", "коми", "медик", "медяк", "ми", "ом", "яд", "як"],
    "ломбард": ["ад", "ар", "бал", "бар", "бард", "боа", "бола", "бора", "бра", "брод", "бром", "дар", "до", "дол", "дом", "домбра", "домра", "дора", "лад", "ладо", "лар", "лоб", "лом", "лор", "лорд", "мода", "мол", "мор", "морда", "ода", "одр", "ом", "омар", "ор", "орда", "раб", "роба", "род", "рол", "ром", "ромб", "бор"],
    "милость": ["ил", "илот", "ильм", "лист", "лом", "лис", "лось", "лот", "ми", "мол", "моль", "мост", "мот", "ом", "ост", "ость", "ось", "си", "силь", "сито", "слом", "слот", "смоль", "соли", "соль", "сом", "стиль", "стол", "тимол", "тис", "тол", "толь", "том"],
    "продукт": ["до", "док", "дот", "дрок", "код", "копт", "корд", "корт", "кот", "крот", "круп", "курд", "одр", "опт", "ор", "орк", "орт", "откуп", "подкур", "порт", "пот", "прок", "пруд", "прут", "пуд", "пук", "род", "рок", "рот", "ток", "топ", "торк", "трок", "троп", "труд", "труп", "тур", "турок", "укор", "укроп", "упор", "урод", "урок", "уток", "утор", "утро"],
    "повесть": ["вепс", "вес", "вест", "весть", "весь", "вето", "опт", "ост", "ость", "ось", "отвес", "отсев", "песо", "пест", "повет", "поветь", "посев", "пост", "пот", "потесь", "свет", "сев", "сет", "сеть", "совет", "степ", "степь", "топ", "топь"],
    "пипетка": ["акт", "ик", "кат", "кепи", "кета", "кипа", "кит", "па", "пак", "пакет", "пакт", "пат", "пек", "пик", "пика", "пикап", "пике", "пикет", "пипка", "тик", "тип"],
    "трактат": ["акр", "акт", "ар", "арак", "арат", "арк", "арка", "кар", "кара", "карат", "карт", "карта", "кат", "крат", "рак", "рака", "такт", "тат", "тата", "татка", "трак", "тракт", "трата", "тратта", "тара"],
    "формула": ["амур", "ар", "аул", "лар", "лом", "лор", "мол", "мор", "морф", "муар", "мул", "мура", "ом", "омар", "ор", "рол", "ром", "улар", "ум", "умора", "фа", "фал", "флора", "фол", "фора", "форма", "форум", "фрау", "фура", "фурма"],
    "анатомия": ["анатом", "ант", "атом", "атония", "иман", "имя", "ион", "мана", "мания", "мант", "мантия", "манто", "мат", "ми", "мина", "мот", "мята", "нома", "нота", "ом", "тина", "тмин", "том", "томан", "тон", "тоня", "яма"],
    "арматура": ["амур", "ар", "арарат", "арат", "аура", "аут", "мара", "март", "мат", "муар", "мура", "рама", "раут", "рута", "тарарам", "траур", "тур", "тура", "ум", "тара"],
    "баталист": ["аил", "аист", "ас", "астат", "атлас", "бал", "бас", "батат", "батист", "бит", "бита", "блат", "ил", "ласа", "ласт", "лата", "лиса", "лист", "саба", "саиб", "салат", "си", "сила", "тал", "талиб", "тат", "тата", "тис"],
    "дизайнер": ["ад", "анри", "ар", "дан", "дар", "диез", "дизайн", "дина", "динар", "дрезина", "дрена", "еда", "езда", "зад", "здание", "иена", "иней", "надир", "надрез", "наезд", "нард", "недра", "низ", "радий", "раз", "рай", "ре", "редан", "резина", "рей", "рейд", "рений", "риза"],
    "единорог": ["ген", "героин", "гид", "го", "год", "гон", "гонор", "гордон", "горе", "горин", "горн", "город", "динго", "дно", "до", "дог", "донг", "донор", "дорн", "иго", "иод", "ион", "негр", "негроид", "норд", "одр", "ор", "орден", "ре", "регион", "ринг", "рог", "род", "родео", "рондо"],
    "животное": ["вено", "вето", "вино", "винт", "воин", "енот", "жетон", "живот", "ион", "нож", "овен", "овин", "твин", "теин", "тени", "тон"],
    "жестокость": ["жест", "жесть", "косость", "кость", "кот", "око", "окот", "октет", "осек", "осос", "осот", "ост", "ость", "ось", "откос", "отсек", "отсос", "отток", "сет", "сеть", "скот", "сок", "сосок", "стежок", "стек", "сток", "текст", "тест", "тесто", "тесть", "ток", "тост"],
    "косточка": ["акт", "ас", "кат", "каток", "кок", "кока", "кокос", "кокс", "коса", "косач", "косок", "кот", "кочка", "око", "окот", "оса", "осока", "осот", "осочка", "ост", "откос", "очко", "сачок", "скак", "скат", "скачок", "скок", "скот", "скотч", "сок", "сотка", "сток", "сточка", "тако", "ткач", "ток", "тоска", "точка", "час", "часок"],
    "мартышка": ["акр", "акт", "ар", "арак", "арат", "арк", "арка", "арык", "ашрам", "камыш", "кар", "кара", "карат", "карма", "карт", "карта", "карты", "кат", "каша", "крат", "крыша", "мак", "мара", "марка", "март", "марш", "мат", "матка", "маштак", "мрак", "мышка", "рак", "рака", "ракша", "рама", "рамка", "рык", "рым", "такыр", "трак", "шар", "шарм", "шрам", "штык", "штыка", "тара"],
    "писатель": ["аил", "аист", "альт", "апис", "ас", "ель", "ил", "лапти", "ласт", "лепта", "лес", "леса", "лесть", "липа", "лиса", "лист", "па", "пас", "пастель", "пасть", "пат", "пест", "пила", "плат", "платье", "плеть", "плис", "плита", "пьеса", "сель", "сет", "сеть", "си", "сиаль", "сила", "силь", "сип", "слип", "спель", "спил", "сталь", "стапель", "стела", "степ", "степь", "стиль", "тал", "талес", "тип", "тис"],
    "сожитель": ["ель", "жест", "жесть", "жилет", "житель", "ил", "илот", "лес", "лесть", "лето", "лист", "ложе", "ложь", "лось", "лот", "ост", "ость", "ось", "отель", "село", "сель", "сет", "сеть", "си", "силь", "сито", "слот", "соли", "соль", "стиль", "стол", "тело", "тесло", "тис", "тол", "толь"],
    "экономия": ["ик", "имя", "инок", "ион", "кимоно", "кино", "ком", "коми", "кон", "ми", "нок", "окно", "око", "ом", "эконом", "эмо", "як", "янки"],
    "эвкалипт": ["аил", "акт", "актив", "вал", "валик", "вилка", "ива", "ик", "ил", "кал", "кат", "кил", "кила", "кипа", "кит", "клип", "лак", "лаки", "лапти", "лик", "липа", "липка", "литвак", "литка", "па", "пак", "пакт", "пат", "пик", "пика", "пила", "пилав", "пилка", "плав", "плавки", "плат", "плита", "плитка", "тал", "талик", "тик", "тип", "тэк", "элита", "эпика", "этап", "этика", "этил"],
    "шарлотка": ["акр", "акт", "аорта", "ар", "арак", "арат", "арк", "арка", "кал", "калоша", "кар", "кара", "карат", "карт", "карта", "кат", "каша", "кашалот", "клот", "коала", "кол", "кора", "корт", "кот", "кошара", "крат", "кроат", "крот", "лак", "лар", "лата", "лор", "лот", "лошак", "ор", "орк", "орт", "отара", "рак", "рака", "ракша", "рок", "рол", "рот", "рота", "тако", "тал", "ток", "тол", "толк", "тора", "торк", "трак", "трал", "трок", "шакал", "шала", "шар", "шарлот", "шкала", "шкало", "школа", "шкот", "шлак", "шок", "шрот", "штакор", "штора", "шторка", "тара"],
    "барашек": ["абрек", "акр", "ар", "араб", "арак", "арба", "арека", "арк", "арка", "бак", "бар", "барак", "барк", "барка", "башка", "бек", "бекар", "бра", "брак", "кабаре", "кар", "кара", "каре", "каша", "кеб", "кеш", "краб", "раб", "раба", "рак", "рака", "ракша", "ре", "река", "решка", "шар"],
    "агрономия": ["агония", "агроном", "анри", "ар", "арго", "аргон", "ария", "армия", "гармония", "гимн", "гиря", "гном", "гнома", "го", "гомон", "гон", "гонор", "гора", "горин", "гормон", "горн", "гран", "грим", "гром", "иго", "игра", "иман", "имя", "ион", "ирга", "ирма", "маг", "магия", "манго", "мания", "марго", "мари", "ми", "миг", "мина", "минога", "минор", "мир", "миро", "мирон", "могар", "мор", "морг", "моряна", "нога", "нома", "нора", "нория", "норма", "ом", "омар", "онагр", "ор", "орган", "оргия", "ранг", "ринг", "рог", "ром", "роман", "рона", "яма", "яр"],
    "буржуазия": ["ажур", "азия", "азу", "азур", "ар", "арбуз", "ария", "бар", "биржа", "бра", "бриз", "буж", "буза", "бур", "бура", "буржуа", "буря", "жар", "жир", "заря", "зуб", "зубр", "изба", "раб", "раз", "риза", "ряж", "уж", "яр", "яуза"],
    "боярышник": ["бок", "бон", "боны", "боярин", "брик", "броня", "бык", "ик", "икры", "инок", "ион", "кино", "кон", "корн", "нок", "нория", "нырок", "ор", "орк", "ринк", "рок", "рыбник", "рык", "рынок", "ши", "шик", "шок", "шорник", "як", "янки", "яр", "ярок", "бор"],
    "вермишель": ["веер", "евреи", "ель", "ерь", "ил", "ильм", "лев", "леер", "ливер", "ливр", "мел", "мель", "ми", "мир", "ре", "шерл", "ши", "ширь", "шлем", "шлир", "шмель"],
    "двигатель": ["авгит", "ад", "аил", "альт", "вал", "валет", "вега", "веда", "ветла", "виг", "вид", "гад", "галиев", "гать", "гвалт", "гель", "гид", "гиль", "гит", "гладь", "даль", "дева", "дельта", "деталь", "детва", "дети", "диета", "еда", "ель", "ива", "игла", "идеал", "ил", "лаг", "лад", "лев", "левит", "легат", "леди", "лига", "тал", "тальвег", "твид", "тильда"],
    "диаграмма": ["агама", "агар", "ад", "ар", "армада", "гад", "гамма", "гарда", "гид", "гидра", "град", "грамм", "грим", "дама", "дар", "драга", "драма", "игра", "имам", "ирга", "ирма", "маг", "магма", "мадам", "мама", "мара", "мари", "ми", "миг", "мим", "мир", "рада", "рама"],
    "жаворонок": ["акр", "ар", "арк", "важ", "вар", "вожак", "вона", "вор", "ворон", "ворона", "воронка", "воронко", "жанр", "жар", "жарок", "жор", "кан", "кар", "ков", "кожа", "кон", "кора", "коран", "корж", "корн", "корова", "корона", "кран", "кров", "крона", "нож", "ножка", "ножовка", "нок", "нора", "норка", "норов", "нрав", "окно", "око", "окова", "ор", "орк", "оркан", "орок", "рак", "ров", "рожа", "рожок", "рожон", "рок", "рона", "ронжа"],
    "инкубатор": ["аборт", "акр", "акт", "ар", "банкир", "банкрот", "бантик", "бар", "барит", "барк", "батон", "бита", "боа", "бона", "борт", "бортик", "бортник", "бра", "брак", "брик", "бука", "бурак", "бурат", "бут", "бутик", "ик", "ион", "каин", "кантор", "кантри", "кариб", "каротин", "кина", "киот", "кит", "кон", "контра", "конура", "коран", "котурн", "крат", "крит", "кроат", "кура", "куртина", "наиб", "нокаут", "нора", "нотка", "нутро", "обкат", "обтирка", "ор", "орк", "оркан", "работник", "рак", "ратник", "раут", "ринк", "рок", "рона", "рубин", "рубка", "рута", "табор", "табу", "тако", "танбур", "тик", "тиун", "ток", "тоник", "торк", "трибун", "трибуна", "трон", "труба", "трубка", "туна", "турбина", "турки", "убор", "укор", "урна", "урон", "утка", "утор", "утро", "утроба", "бор"],
    "отслоение": ["енот", "ил", "илот", "ион", "лес", "летие", "лето", "линт", "лист", "лоно", "лот", "лото", "лотос", "неолит", "нилот", "нос", "нотис", "олеин", "осетин", "осот", "ост", "остин", "относ", "селен", "селенит", "селин", "село", "сени", "сено", "сет", "си", "силен", "силон", "сито", "слоение", "слон", "слот", "соление", "соли", "соло", "сон", "сонет", "стен", "стол", "столон", "стон", "теин", "тело", "тени", "тесло", "тис", "тлен", "тление", "тол", "тон"],
    "русалочка": ["акр", "акула", "арак", "арк", "арча", "аул", "аура", "кал", "кар", "кара", "караул", "коала", "кол", "кора", "корча", "коса", "краса", "кура", "курс", "куча", "лак", "лар", "ласа", "ласка", "лачка", "лоск", "лука", "луч", "лучок", "окрас", "ор", "оракул", "орк", "орс", "оса", "осака", "оскал", "оскар", "рак", "рака", "раса", "раскол", "раус", "рок", "рол", "роса", "рука", "русак", "русалка", "русло", "ручка", "сакура", "сало", "сачок", "скала", "скало", "скол", "скула", "случка", "сок", "солка", "сор", "срок", "сук", "сура", "сурок", "сучок", "счал", "счалка", "укол", "укор", "укос", "улар", "улочка", "урка", "урок", "ус", "усач", "чакра", "чал", "чалка", "чара", "чарка", "час", "часок", "чаус", "чулок", "чурка"],
    "самородок": ["ад", "акр", "ар", "арк", "ас", "даос", "дар", "до", "док", "дока", "дом", "домра", "дора", "доска", "дрок", "кадр", "кар", "код", "кода", "ком", "кома", "комар", "комод", "кора", "корд", "корда", "корм", "корма", "коса", "мак", "марс", "мода", "мор", "морда", "морок", "морока", "морс", "мрак", "ода", "одр", "око", "окрас", "ом", "омар", "ор", "орда", "орк", "орок", "орс", "оса", "осадок", "оскар", "осока", "рак", "рамс", "род", "родос", "рок", "ром", "роса", "сад", "садок", "сард", "скорм", "смак", "смрад", "сода", "сок", "сом", "сома", "сор", "сорока", "срам", "срок"],
    "хромосома": ["ар", "ас", "марс", "мах", "мор", "морс", "мох", "ом", "омар", "ор", "орс", "оса", "охра", "рамс", "ром", "роса", "сом", "сома", "сор", "соха", "срам", "хам", "хаос", "хор", "храм", "хром"],
    "чернослив": ["вено", "вес", "весло", "вино", "вис", "воин", "вол", "вор", "ворс", "ил", "ион", "лев", "ленч", "лес", "ливер", "ливр", "лич", "лов", "лор", "лори", "нерв", "нос", "овен", "овин", "олеин", "ор", "орс", "ре", "рис", "ров", "рол", "сверло", "сев", "севр", "селин", "село", "сени", "сено", "серв", "си", "силен", "силон", "сирен", "слив", "слон", "соли", "сон", "сор", "сочлен", "чело", "чин", "число", "член", "чрево"],
    "штурмовик": ["виток", "вор", "вотум", "ик", "кворум", "киот", "кит", "ков", "ковш", "ком", "коми", "корм", "корт", "кот", "крит", "кров", "крот", "кум", "кумир", "куш", "ми", "мир", "миро", "мирок", "мирт", "мор", "мот", "мотив", "ом", "омут", "ор", "орк", "орт", "ритм", "ров", "ровик", "рок", "ром", "рот", "ротик", "тик", "тир", "ток", "том", "томик", "торк", "трико", "трио", "трок", "тур", "турки", "турок", "туш", "укор", "ум", "умишко", "урок", "уток", "утор", "утро", "ушко", "ши", "шик", "шкив", "шкот", "шмотки", "шов", "шок", "шоу", "шрот", "шторм", "штурм", "шум", "шумовик", "шумок", "шут"],
    "щитовидка": ["авто", "ад", "акт", "актив", "вид", "виток", "вода", "водка", "диво", "до", "док", "дока", "дот", "ива", "идиот", "идиотка", "ик", "икота", "иод", "кат", "катод", "квота", "киот", "кит", "ков", "код", "кода", "кот", "ода", "тако", "твид", "тик", "ток", "щи", "щит", "щитовка", "щиток"],
    "эвристика": ["аист", "акр", "акт", "актив", "ар", "арк", "ас", "вар", "вира", "вис", "виски", "враки", "ива", "иваси", "иврит", "ик", "икра", "икс", "ирис", "иск", "искра", "кар", "карст", "карт", "кат", "квас", "квирит", "киса", "киста", "кит", "крат", "крит", "раис", "рак", "рис", "риск", "риска", "сатир", "сатирик", "сват", "свита", "свитка", "си", "ситар", "сити", "скат", "скит", "старик", "стирка", "сэр", "тавр", "такси", "тик", "тир", "тирс", "тис", "тиски", "трак", "триас", "тэк", "экстра", "эра", "эрика", "эристика", "этика"],
    "язычество": ["вес", "вест", "вето", "воз", "вычет", "вяз", "зев", "зет", "зов", "ост", "отвес", "отзыв", "отсев", "свет", "светоч", "своз", "сев", "сет", "совет", "созыв", "соты", "соя", "стезя", "счеты", "сыч", "яс", "яство"],
    "авиамодель": ["ад", "аил", "альма", "вал", "веда", "ведьма", "вид", "видео", "виола", "вода", "водь", "вол", "давило", "даль", "дама", "дева", "дело", "диво", "до", "дол", "дом", "еда", "ель", "ива", "идеал", "идол", "ил", "ильм", "иод", "лава", "лад", "лада", "ладо", "лама", "лев", "левада", "леди", "лов", "лом", "мала", "малов", "мальва", "медаль", "медиа", "медь", "мел", "мель", "ми", "мода", "модель", "мол", "молва", "моль", "мольва", "овал", "ода", "оладьи", "олива", "оливье", "ом", "омела"],
    "ассиметрия": ["аист", "ар", "арест", "аритмия", "ария", "армия", "артем", "ас", "имя", "ирис", "ирма", "истерия", "маис", "мари", "марс", "март", "мастер", "мат", "материя", "мера", "меря", "месса", "мессия", "мета", "метр", "ми", "мир", "мирт", "мирта", "мисс", "миссия", "мистер", "мистерия", "митра", "мята", "раис", "рамс", "расист", "ре", "рема", "ремиссия", "рея", "рис", "ритм", "ряса", "сатир", "сема", "семит", "семя", "сера", "серия", "сестра", "сет", "си", "сиеста", "система", "систр", "ситар", "сити", "смета", "смятие", "срам", "стая", "стер", "стремя", "тасс", "тема", "темя", "тир", "тире", "тирс", "тис", "трасс", "триас", "яма", "яр", "яс"],
    "боеголовка": ["бак", "бал", "балок", "бег", "бега", "бек", "бел", "белка", "белок", "благо", "блок", "боа", "бог", "бок", "бокал", "бола", "вал", "вега", "век", "веко", "вобла", "вокал", "вол", "волга", "волк", "волок", "главк", "го", "гол", "голова", "головка", "кал", "кеб", "ков", "кол", "колба", "колоб", "лаг", "лак", "лев", "левак", "лек", "лоб", "лобок", "лов", "лог", "логово", "обвал", "облако", "облов", "облог", "обол", "овал", "око", "окова", "олово"],
    "бездельник": ["бдение", "безе", "бек", "бел", "белки", "бель", "блик", "блин", "дебил", "дек", "день", "диез", "дизель", "ель", "ельник", "зек", "зелень", "зелье", "зенки", "ик", "ил", "кеб", "кельн", "кил", "киль", "лебедь", "леди", "ледник", "лек", "лень", "лик", "линь", "низ", "никель"],
    "богатство": ["авто", "ас", "бас", "батог", "боа", "бог", "бот", "ботва", "ватт", "гавот", "го", "гост", "оса", "особа", "осот", "ост", "остов", "сабо", "саго", "сват", "сова", "стог", "тавот", "тат", "тога", "тост"],
    "валерьянка": ["аврал", "акварель", "алан", "анвар", "анклав", "ар", "арак", "ареал", "арека", "арк", "арка", "аркан", "аянка", "вал", "валерьяна", "варан", "варка", "варнак", "веня", "вера", "верк", "верняк", "веялка", "враль", "ель", "ерь", "кавалер", "кавальер", "кал", "калан", "кальян", "кан", "канал", "кар", "кара", "келарня", "келарь", "кельн", "керн", "клан", "краля", "крен", "лава", "лавр", "лавра", "лак", "ланка", "лань", "лар", "ларь", "лев", "левак", "лек", "лекарь", "лень", "лерка", "лея", "ля", "лярва", "навал", "навар", "навель", "навь", "накал", "накра", "нарва", "нарвал", "нева", "нерв", "нерка", "неявка", "нрав", "рак", "рака", "рана", "ранка", "рань", "рвань", "ре", "реал", "река", "рея", "яванка", "явка", "явь", "як", "ял", "январь", "яр", "ярка"],
    "вафельница": ["аил", "алан", "альфа", "вал", "валец", "ваниль", "вина", "вица", "ель", "ива", "иена", "ил", "лава", "лавина", "лань", "лафа", "лев", "левиафан", "ленца", "лень", "лиана", "ливанец", "ливень", "линь", "лиф", "львица", "навал", "навель", "навь", "налив", "нева", "неф", "нива", "фа", "фавн", "фал", "фалинь", "фальц", "фиал", "фила", "филе", "фильц", "финал", "финаль", "финвал", "фланец", "цвель", "целина", "цель", "цена", "циан"],
    "вентилятор": ["вено", "веня", "вето", "вино", "винт", "воин", "вол", "воля", "вор", "енот", "ил", "илот", "ион", "лев", "левит", "лето", "лея", "ливер", "ливр", "ливрея", "линт", "литер", "литорея", "литр", "лов", "лор", "лори", "лорнет", "лот", "ля", "неволя", "неврит", "неолит", "нерв", "нилот", "нория", "овен", "овин", "олеин", "ор", "орт", "ответ", "отит", "отлив", "отнятие", "ре", "рея", "ров", "рол", "рот", "твин", "теин", "тело", "тени", "тенор", "тент", "теория", "тетрил", "тир", "тире", "титло", "титр", "тлен", "тля", "тол", "тон", "тоня", "торит", "торт", "трен", "трио", "триолет", "тритон", "трон", "трот", "тротил", "явор", "ял", "яр"],
    "двустволка": ["авто", "автол", "акт", "ас", "аут", "ввод", "вклад", "вкус", "влас", "водка", "вокал", "волк", "втулка", "даос", "док", "дол", "доска", "дот", "дувал", "дукат", "дуло", "дуст", "кат", "квас", "квота", "клот", "код", "кода", "кодла", "коса", "кот", "куст", "лад", "лак", "ласт", "латук", "лов", "лодка", "лоск", "лоскут", "лук", "лукавство", "овал", "одул", "оклад", "оскал", "откус", "сад", "сало", "сват", "свод", "сводка", "скало", "скат", "скаут", "склад", "скол", "скула", "словак", "сова", "совка", "сода", "сок", "солка", "сотка", "стадо", "ствол", "сток", "стол", "стук", "стул", "судак", "сук", "тако", "ток", "тол", "толк", "тусовка", "увал", "удав", "удол", "уклад", "укол", "укос", "уловка", "ус", "устав", "утка", "уток"],
    "газопровод": ["ад", "ар", "арго", "вар", "вздор", "взор", "вода", "воз", "вор", "враг", "гад", "газ", "го", "говор", "год", "гора", "город", "град", "гроза", "грозд", "дар", "двор", "до", "дог", "договор", "доза", "дозор", "дора", "дорога", "драп", "дрова", "дрога", "завод", "заговор", "зад", "задор", "запор", "зов", "оаз", "овод", "овраг", "оговор", "огород", "ода", "одр", "опор", "опора", "ор", "орда", "па", "паз", "пар", "паровоз", "повар", "повод", "погода", "подвоз", "подгар", "подговор", "подзор", "поза", "позор", "пора", "порог", "порода", "право", "провод", "провоз", "проза", "раз", "развод", "ров", "рог", "рогоз", "рогоза", "род", "роза", "розга"],
    "гидрология": ["гид", "гидролог", "гирло", "гиря", "глория", "го", "год", "гол", "голод", "горло", "город", "грог", "дилогия", "до", "дог", "дол", "долг", "доля", "дояр", "игил", "иго", "идол", "ил", "иод", "лог", "лор", "лорд", "лори", "ля", "лярд", "одр", "ор", "оргия", "рог", "род", "рол", "ряд", "яд", "ядро", "ял", "яр", "ярд"],
    "голограмма": ["агар", "аларм", "ар", "арго", "гага", "гагра", "гамма", "го", "гол", "гора", "горло", "грамм", "грог", "гром", "лаг", "лама", "лар", "лог", "лом", "лор", "маг", "магма", "мала", "мама", "мара", "марал", "марго", "мгла", "могар", "могол", "мол", "мор", "морг", "ом", "омар", "ор", "рама", "рог", "рол", "ром"],
    "гранатомёт": ["агар", "агнат", "ангар", "аорта", "ар", "арат", "арго", "аромат", "атом", "гарант", "гарт", "гном", "гнома", "го", "гон", "гонт", "гора", "горн", "гран", "гранат", "гром", "грот", "маг", "магнат", "мана", "манго", "мант", "манто", "мара", "маран", "марго", "март", "мат", "матрона", "могар", "монтёр", "мор", "морг", "мот", "нагар", "нагота", "наём", "намёт", "нарта", "натр", "нога", "ногата", "нома", "нора", "норма", "нота", "ом", "омар", "омёт", "онагр", "онёр", "ор", "орган", "орт", "отара", "рама", "рана", "ранг", "рант", "рог", "ром", "роман", "рона", "рот", "рота", "ротанг", "таган", "тамга", "танго", "таран", "тат", "тата", "тёрн", "тога", "том", "томан", "томат", "тон", "тора", "торг", "торт", "трата", "трог", "трон", "трот", "тара"],
    "громоотвод": ["вор", "ворот", "го", "говор", "год", "город", "гром", "грот", "двор", "до", "дог", "договор", "дом", "дот", "мор", "морг", "мот", "мотор", "овод", "оговор", "огород", "одр", "ом", "ор", "орт", "отвод", "отговор", "отрог", "ров", "рог", "род", "ром", "рот", "творог", "том", "торг", "трог"],
    "кооператив": ["авто", "арк", "ваер", "век", "вектор", "вето", "вира", "вор", "враки", "ива", "икра", "ипотека", "капер", "кар", "карт", "катер", "квота", "кета", "киот", "копа", "копт", "корт", "креп", "крипта", "кров", "окова", "окоп", "опак", "опоек", "опора", "опт", "оптовик", "орк", "орок", "отпор", "па", "пак", "пакт", "пар", "парик", "парок", "патерик", "петровка", "пиар", "пиво", "пик", "пике", "пират", "питер", "повар", "повет", "покер", "пора", "порка", "порок", "портик", "портовик", "потир", "поток", "право", "проект", "прокат", "рак", "ре", "река", "репа", "репка", "ров", "ровик", "рок", "ропак", "рота", "ротик", "тавр", "тако", "тиверка", "тик", "товар", "топик", "топика", "топор", "тора", "трак", "трап", "трек", "трепак", "трико", "трип", "троп", "тропка"],
    "забастовка": ["абаз", "абака", "авто", "автобаза", "азот", "акт", "аозт", "ас", "атака", "база", "бак", "бас", "баск", "баска", "басок", "боа", "бок", "бокс", "бот", "ботва", "ваза", "вакса", "вата", "ватка", "воз", "возка", "воск", "забава", "забота", "закат", "засов", "застава", "заставка", "заток", "зоб", "зов", "каста", "кат", "квас", "квота", "кобза", "ков", "коза", "коса", "кот", "оаз", "обкат", "октава", "оса", "осака", "ост", "отава", "отказ", "саба", "сабза", "сабо", "савка", "саз", "саква", "сват", "своз", "сказ", "скат", "скоба", "скот", "собака", "сова", "совка", "сок", "сотка", "ставка", "сток", "табак", "таз", "тако", "такса", "тасовка", "ток", "тоска"],
    "мармеладка": ["ад", "акр", "аларм", "ар", "арак", "ареал", "арека", "арк", "арка", "аркада", "армада", "дама", "дамка", "дар", "дек", "дека", "дерма", "драка", "драма", "дрек", "еда", "кадр", "кал", "камера", "кар", "кара", "карда", "каре", "карма", "кедр", "клад", "клемма", "крем", "лад", "лада", "лак", "лама", "лар", "лек", "лемма", "лерка", "мадам", "мадера", "мак", "маклер", "макраме", "мала", "мама", "мамка", "мара", "марал", "марка", "мармелад", "мел", "мем", "мера", "мерка", "мрак", "рада", "рак", "рака", "рама", "рамка", "ре", "реал", "река", "реклама", "рема"],
    "странствие": ["анис", "анри", "ант", "ар", "арест", "ас", "ваер", "васин", "верста", "вес", "весна", "вина", "вис", "ива", "инвар", "навис", "натр", "нева", "нерв", "нива", "нитрат", "нрав", "раис", "ранет", "расист", "рассвет", "ре", "рента", "рис", "сани", "сатир", "сван", "сват", "свес", "свет", "свист", "свита", "сеанс", "сев", "севр", "сенат", "сени", "сера", "серв", "сервант", "сервис", "серна", "сестра", "сет", "си", "сиена", "сиеста", "синева", "сирен", "систр", "ситар", "станс", "старт", "стеарин", "стен", "стер", "стерва", "стерин", "стрит", "тарист", "тасс", "тат", "твин", "твист", "театр", "теин", "теист", "тени", "тент", "тесина", "тета", "тетива", "тина", "тир", "тире", "тис", "титан", "титр", "травести", "трасс", "траст", "трен", "трест", "треста", "триест"],
    "свиристель": ["вес", "вест", "весть", "весь", "вис", "ель", "ерь", "иврит", "ил", "ирис", "лев", "левит", "лес", "лесть", "ливер", "ливр", "лист", "литер", "литр", "ре", "рельс", "рис", "свес", "свет", "свиль", "свирель", "свист", "свитер", "сев", "севр", "сель", "серв", "сервис", "сет", "сеть", "си", "силь", "систр", "сити", "слив", "слитие", "стер", "стиль", "тир", "тире", "тирс", "тис", "трель", "трисель"],
    "стоматолог": ["ас", "атом", "галс", "глас", "глот", "го", "гол", "голос", "гост", "лаг", "ласт", "лог", "лом", "ломота", "лот", "лото", "лотос", "маг", "масло", "мат", "мгла", "могол", "мол", "молот", "мосол", "мост", "мот", "ом", "оса", "осмол", "осот", "ост", "отлог", "саго", "сало", "слог", "слом", "слот", "смог", "смола", "соло", "солома", "сом", "сома", "стог", "стол", "тал", "тат", "тога", "тол", "том", "томат", "тост"],
    "сейсмограф": ["айсор", "ар", "арго", "ас", "гаер", "гарем", "гей", "гейм", "герма", "герой", "го", "гомера", "гора", "горе", "гофр", "гофре", "граф", "гром", "гросс", "йог", "йога", "маг", "май", "майор", "марго", "марс", "мера", "месса", "могар", "мор", "морг", "море", "морс", "морф", "морфей", "ом", "омар", "омег", "омега", "ор", "орс", "оса", "рай", "рамс", "ре", "рей", "рейс", "рема", "рог", "рой", "ром", "роса", "саго", "сейм", "сейф", "сема", "семафор", "сера", "смог", "сойма", "сом", "сома", "сор", "софа", "срам", "ссора", "сфера", "фа", "фарс", "ферма", "фес", "фойе", "фора", "форма", "форс"],
    "снегурочка": ["аксон", "анус", "ар", "ас", "гаер", "ген", "гон", "гончар", "гора", "горка", "горчак", "гран", "грач", "грена", "гренок", "гуран", "кагор", "кар", "конура", "конус", "корча", "кочерга", "крона", "круг", "куга", "кунг", "курс", "нега", "негус", "нога", "нора", "ночка", "нуга", "нукер", "океан", "окрас", "округ", "округа", "онагр", "ор", "орган", "орк", "оркан", "оса", "осек", "осечка", "рагу", "ранг", "раус", "ре", "река", "речка", "речонка", "рог", "рок", "рона", "руна", "русак", "ручка", "ручонка", "саенко", "саке", "сгонка", "сено", "сера", "серна", "сеунч", "сечка", "сканер", "скарн", "снег", "сок", "сон", "сук", "сукно", "сурна", "сурок", "угон", "укос", "уран", "урка", "урок", "ус", "учан", "чан", "часок", "чека", "чеснок", "чурка"],
    "устройство": ["вой", "войт", "вор", "ворот", "ворс", "йот", "ойрот", "ор", "орс", "орт", "осос", "осот", "ост", "остов", "отсос", "отстой", "ров", "рой", "рост", "рот", "руст", "сор", "сорос", "сорт", "сорус", "соус", "створ", "строй", "той", "торос", "торс", "торт", "тост", "трос", "трот", "трус", "тур", "тут", "тутор", "ус", "устой", "устрой", "утор", "утро"],
    "ускорение": ["ик", "икс", "инок", "ион", "иск", "керн", "керосин", "кино", "кон", "конус", "корн", "крен", "кроение", "кун", "курение", "курс", "нок", "нос", "носик", "нукер", "оникс", "ор", "орк", "орс", "осек", "ре", "ринк", "рис", "риск", "рисунок", "роение", "рок", "русин", "сени", "сено", "серко", "си", "сирен", "сок", "сон", "сор", "срок", "сук", "сукно", "сурик", "сурок", "укор", "укос", "урок", "урон", "ус", "усик"],
    "ультиматум": ["аил", "альт", "аул", "аут", "ил", "ильм", "имам", "ламут", "мат", "мать", "ми", "мим", "мул", "мулат", "муть", "тал", "тат", "тать", "титул", "туаль", "тут", "тута", "тьма", "улит", "ум", "утиль"],
    "программист": ["ар", "арго", "артос", "ас", "гарт", "гит", "грамм", "грим", "гром", "грот", "иго", "ирга", "ирма", "истома", "маг", "маис", "март", "матрос", "ми", "мир", "миро", "мирра", "митра", "мопс", "морг", "мортира", "ом", "омар", "оса", "ост", "па", "пари", "паром", "парс", "парторг", "пас", "пастор", "пиар", "пим", "пират", "пирог", "пора", "порт", "портсигар", "потир", "пригар", "прима", "примас", "примат", "приор", "прирост", "присмотр", "прогар", "псаммит", "рапс", "распор", "рог", "ростра", "рот", "саго", "сатир", "сигма", "сипота", "сироп", "сирота", "ситар", "ситро", "смог", "сом", "сопа", "сорт", "сортир", "спор", "спора", "спорт", "срам", "стопа", "строп", "стропа", "тапир", "тигр", "тирс", "том", "топ", "тора", "торс", "триас", "трип", "тромп", "троп"],
    "уничтожение": ["енот", "жетон", "житие", "ион", "нежин", "неон", "неуч", "нож", "нонет", "нут", "теин", "тени", "тиун", "тон", "тун", "уж", "ужение", "ужин", "унижение", "унион", "утончение", "уточнение", "учение", "учинение", "чиж", "чин", "чтение"],
    "целомудрие": ["делец", "делимое", "дело", "дилер", "до", "дол", "дом", "дуло", "думец", "идол", "ил", "иод", "леди", "леер", "лемур", "лидер", "лицемер", "лицо", "лом", "лор", "лорд", "лори", "луидор", "мел", "ми", "милорд", "мир", "миро", "мол", "мор", "море", "мудрец", "мул", "одр", "одул", "олеум", "ом", "ор", "орлец", "орудие", "ре", "род", "рол", "ром", "удел", "удило", "удол", "улем", "ум", "умелец", "урод", "уродец", "целое"],
    "художество": ["вдох", "вес", "вест", "вето", "вех", "восход", "всход", "вход", "джут", "до", "дож", "досев", "дот", "дуст", "дух", "жест", "овод", "осоед", "осот", "ост", "остов", "отвес", "отвод", "отдух", "отсев", "отход", "свет", "свод", "сев", "сет", "совет", "суд", "сход", "тодес", "туес", "увод", "уж", "ус", "ухо", "уход", "хвост", "ход", "хост", "худо"],
    "шизофрения": ["ерошин", "зерно", "зоря", "ион", "иония", "ирония", "неф", "низ", "нория", "ор", "офеня", "ре", "резня", "резон", "рея", "риф", "фея", "финиш", "фирн", "фиш", "фон", "фреон", "шен", "шериф", "шеф", "шея", "ши", "шифер", "шифон", "шифр", "яр"],
    "экскаватор": ["авар", "авто", "автокар", "автор", "аорта", "ар", "арат", "ас", "астра", "вакса", "варка", "ватка", "ворс", "воск", "втора", "какао", "кар", "кара", "каратэ", "карт", "каска", "каста", "касторка", "кат", "каток", "кварк", "квота", "кок", "кока", "кора", "корка", "корсак", "коса", "костра", "краков", "краса", "красота", "красотка", "крат", "кроат", "кроатка", "кров", "крот", "окраска", "октава", "ор", "орава", "орк", "орс", "орт", "оса", "осака", "оскар", "отава", "отрава", "рака", "раскат", "рвота", "рок", "рота", "савка", "саква", "сват", "скак", "скат", "сковка", "скот", "совка", "сор", "сорт", "сотка", "старка", "створ", "сток", "строка", "тавр", "тавро", "такса", "тасовка", "ток", "торк", "торс", "трава", "травка", "трок", "трос", "тэк", "экватор", "эрот", "эскорт", "тара"],
    "этимология": ["гит", "глот", "го", "гол", "игил", "иго", "ил", "илот", "имя", "итог", "лимит", "лития", "лог", "лом", "лот", "лото", "ля", "ми", "миг", "миля", "миолог", "миология", "могол", "мол", "молот", "мот", "мяло", "ом", "отлог", "тимол", "тля", "тол", "том", "тягло", "эго", "эмо", "этил", "этимолог", "этиология", "ял"],
    "юрисдикция": ["дикция", "диск", "ик", "икс", "ирис", "иск", "рис", "риск", "ряд", "си", "сидр", "скирд", "цирк", "юр", "юс", "яд", "як", "яр", "ярд", "яс"],
    "яйцеклетка": ["акт", "алтей", "ацтек", "елей", "кал", "кат", "каяк", "кета", "клей", "клетка", "лай", "лак", "лакей", "лей", "лейка", "лек", "лея", "ля", "таец", "тал", "телек", "телец", "тля", "яйла", "як", "ял"],
    "антоним": ["анион", "аноним", "ант", "атом", "иман", "ион", "мант", "манто", "мат", "ми", "мина", "мот", "наин", "намин", "нома", "нона", "нота", "ом", "танин", "тина", "тмин", "том", "томан", "тон", "тонина", "тонна"],
    "абордаж": ["ад", "ар", "араб", "арба", "бар", "бард", "баржа", "боа", "бора", "бра", "брод", "даба", "дар", "до", "дож", "дора", "жаба", "жабо", "жабра", "жад", "жар", "жара", "жор", "ода", "одр", "ор", "орда", "раб", "раба", "рада", "раджа", "роба", "род", "рожа", "бор"],
    "архаизм": ["ар", "замах", "ирма", "мазар", "мара", "мари", "мах", "махра", "ми", "мир", "мирза", "раз", "размах", "рама", "риза", "хазар", "хам", "харизма", "хиазма", "храм", "зима"],
    "бедняга": ["ад", "баден", "баня", "баян", "бег", "бега", "беда", "гад", "ген", "дан", "еда", "набег", "нега", "ябеда", "яд"],
    "блокнот": ["блок", "бок", "болт", "бон", "бот", "клон", "клот", "кол", "колоб", "кон", "кот", "лоб", "лобок", "локон", "лоно", "лот", "лото", "лоток", "нок", "обол", "окно", "око", "окот", "откол", "ток", "тол", "толк", "тон"],
    "буквоед": ["бек", "бок", "бук", "век", "веко", "дек", "до", "док", "дуб", "дубок", "едок", "кеб", "ков", "код", "куб", "обдув", "обед", "увод"],
    "телёнок": ["енот", "клён", "клон", "клот", "кол", "кон", "кот", "котёл", "лек", "лён", "лёт", "лето", "леток", "лот", "нок", "отёк", "отёл", "тело", "телок", "тенёк", "тлен", "ток", "тол", "толк", "тон"],
    "желтозём": ["ёж", "жезл", "жмот", "зет", "зло", "лёт", "лето", "ложе", "лом", "лот", "мел", "метол", "мол", "мот", "ом", "омёт", "омлет", "отёл", "тело", "тол", "том"],
    "заклёпка": ["ёлка", "зал", "зала", "залп", "запал", "злак", "казак", "кал", "клака", "клёпка", "лазка", "лак", "лапа", "лапка", "па", "паёк", "паз", "пак", "палка", "плаз"],
    "картёжник": ["акр", "акт", "актёр", "анри", "ант", "ар", "арк", "ёж", "ёжик", "жанр", "жар", "жёнка", "жинка", "жир", "ик", "икра", "каик", "каин", "кан", "кант", "кантри", "кар", "карт", "кат", "кика", "кина", "кирка", "кит", "книжка", "кран", "краник", "крат", "крик", "кринка", "крит", "натёк", "натр", "нитка", "раёк", "рак", "рант", "ратин", "ратник", "ринк", "таёжник", "танк", "тёрка", "тёрн", "тик", "тина", "тир", "тираж", "тиран", "трак"],
    "корчёвка": ["акр", "ар", "арк", "вар", "вор", "врач", "кар", "кварк", "ков", "ковёр", "ковка", "кок", "кока", "кора", "корка", "корча", "кочёвка", "кочка", "краков", "кров", "овчар", "ор", "орк", "раёк", "рак", "рёв", "ров", "рок", "чаво", "чаёк"],
    "надёжность": ["ад", "анод", "анонс", "ант", "ас", "дан", "данность", "дань", "даос", "дно", "до", "дож", "донна", "дот", "ёж", "жад", "жадность", "нанос", "наст", "натёс", "нож", "нона", "нос", "нота", "ода", "одёжа", "оса", "ост", "ость", "ось", "сад", "сан", "сода", "сон", "сонант", "стадо", "стаж", "стан", "стон", "тёс", "тон", "тонна", "тоннаж"],
    "напёрсток": ["акр", "аксон", "акт", "арк", "ас", "капот", "карст", "кон", "контра", "копна", "копт", "коса", "костра", "кот", "кран", "крап", "кроат", "крона", "напор", "натёк", "натр", "норка", "нос", "нотка", "онёр", "опт", "орк", "орт", "осётр", "оскар", "оспа", "ост", "отёк", "отёска", "пак", "пакт", "панёр", "парк", "парок", "паск", "пастор", "пат", "патрон", "пёс", "понтёр", "порка", "порт", "пост", "потёк", "прок", "прокат", "простак", "псёнок", "рак", "рант", "рона", "роса", "рота", "сапёр", "скарн", "скопа", "скот", "скрап", "сок", "сопка", "сор", "сорт", "спор", "спорт", "срок", "станок", "стопка", "строка", "стропа", "танк", "тёрн", "тёс", "тёска", "ток", "тон", "топ", "топка", "тора", "тоска", "трак", "транс", "трап", "трон", "тропа", "тропка"],
    "нахлёстка": ["акант", "акт", "алан", "ант", "ас", "атлас", "ёлка", "кал", "калан", "кан", "канал", "канат", "кант", "каста", "кат", "клан", "клён", "клёст", "лак", "ланка", "ласа", "ласка", "ласт", "лата", "лахтак", "лён", "лёт", "накал", "накат", "налёт", "наст", "натёк", "натёс", "натёска", "нахал", "саёк", "салат", "сан", "скала", "скат", "слёт", "стакан", "стан", "такса", "тал", "танк", "тёлка", "тёс", "тёска", "хакас", "хала", "халат", "хан", "хасан", "хата", "хна"],
    "аэросъёмка": ["акр", "ар", "арак", "арк", "арка", "ас", "камса", "кар", "кара", "карма", "ком", "кома", "комар", "комара", "кора", "корм", "корма", "коса", "краса", "мак", "мара", "марка", "марс", "маска", "мор", "морс", "мрак", "мэр", "окрас", "ом", "омар", "ор", "орк", "орс", "оса", "осака", "оскар", "раёк", "рак", "рака", "рама", "рамка", "рамс", "раса", "рок", "ром", "роса", "саам", "саёк", "самар", "самка", "саркома", "скорм", "смак", "сок", "сом", "сома", "сор", "срам", "срок", "съём", "съёмка", "сэр", "эмо", "эра"],
    "авиасалон": ["аванс", "аил", "алан", "анис", "ас", "вал", "васин", "вина", "вино", "виола", "вис", "влас", "воин", "вол", "волан", "волна", "вона", "ива", "ил", "ион", "лава", "лавина", "лавсан", "ласа", "лиана", "лиса", "лов", "лосина", "навал", "навис", "налив", "нива", "нос", "овал", "овин", "олива", "оса", "осина", "саван", "сало", "салон", "сан", "сани", "сван", "си", "сила", "силон", "слава", "слив", "слива", "слон", "сова", "соли", "сон"],
    "автомеханик": ["акание", "актив", "анкета", "антиква", "атомник", "ванта", "вата", "ватин", "ватник", "век", "веник", "венок", "ветка", "веткин", "вех", "вино", "воин", "вона", "енот", "иена", "икота", "ион", "канат", "кант", "катион", "квота", "кина", "кино", "кнехт", "кома", "комната", "мак", "мана", "манатки", "маниок", "манка", "мант", "мат", "мах", "махан", "махаон", "маховик", "мена", "мета", "мех", "меха", "механика", "ми", "мина", "монетка", "мотив", "мохнатка", "навиток", "нева", "немка", "немота", "нехватка", "нивх", "новик", "нота", "овен", "окание", "октава", "отмах", "отмена", "охание", "тако", "танк", "твин", "тема", "тени", "техника", "тик", "тмин", "ток", "томик", "тон", "тоник", "хаки", "хамит", "хамка", "хан", "хата", "хват", "хватка", "хвоинка", "хина", "хит", "хон"],
    "адсорбент": ["абсент", "ант", "арест", "баден", "бар", "барон", "бас", "батон", "беда", "беднота", "бедра", "бердан", "бетон", "боа", "бон", "бора", "бот", "брас", "бред", "дан", "даос", "десант", "десна", "днестр", "дора", "еда", "набор", "нард", "народ", "нарост", "натр", "недра", "нора", "норд", "нос", "обед", "обрат", "ода", "одр", "ор", "орда", "орден", "орс", "орт", "оса", "ост", "раб", "ранет", "рант", "ре", "редан", "рента", "род", "роса", "рот", "сабо", "сад", "сан", "сард", "сбора", "сброд", "сдоба", "сена", "сенат", "сено", "серб", "серна", "сет", "собрат", "сода", "сонет", "сорт", "сотерн", "среда", "стадо", "стан", "стен", "стенд", "стер", "стон", "тенор", "тон", "тора", "торба", "торбан", "торс", "транс", "треба", "трен", "трос", "бор"],
    "аквариум": ["авар", "акр", "амур", "ар", "арак", "арк", "арка", "аура", "вар", "варка", "вира", "враки", "ива", "ик", "икра", "ирма", "кар", "кара", "караим", "карма", "кум", "кума", "кумир", "кура", "курва", "мавр", "мак", "маки", "мара", "мари", "марка", "ми", "мир", "мрак", "муар", "мука", "мура", "рак", "рака", "рама", "рамка", "рука", "рукав", "увар", "уварка", "ум", "урка"],
    "амортизатор": ["азарт", "азиат", "азот", "аозт", "аорта", "ар", "арат", "ариозо", "аромат", "артрит", "артроз", "атом", "замор", "затор", "ирма", "мазар", "мара", "мари", "март", "мат", "ми", "мир", "мирза", "миро", "мирр", "мирра", "мирт", "мирта", "митоз", "митра", "мор", "мороз", "мортира", "мот", "мотор", "оаз", "ом", "омар", "ор", "оратор", "орт", "отара", "отит", "раз", "рама", "риза", "ритм", "ритор", "роза", "ром", "рот", "рота", "ротатор", "ротор", "таз", "тат", "тата", "тиара", "тир", "титр", "том", "томат", "тора", "торизм", "торит", "тормоз", "торт", "трата", "трио", "трот", "зима", "тара"],
    "арматурщица": ["амур", "ар", "арарат", "арат", "арматура", "аура", "аут", "ирма", "мара", "мари", "март", "мат", "матица", "матрац", "матрица", "маца", "ми", "мир", "мирр", "мирра", "мирт", "мирта", "митра", "муар", "мура", "рама", "раут", "ритм", "рута", "тарарам", "тиара", "тир", "траур", "тур", "тура", "турица", "ум", "цитра", "щи", "щит", "щур", "тара"],
    "архаист": ["аист", "ар", "арат", "арахис", "ас", "астра", "раис", "раса", "рахит", "рис", "сатир", "сатира", "сахар", "си", "ситар", "стих", "страх", "тиара", "тир", "тирс", "тис", "триас", "хата", "хит", "тара"],
    "батиплан": ["аил", "алан", "ант", "бал", "бант", "бинт", "биплан", "бит", "бита", "блат", "блин", "блинт", "ил", "ланита", "лапа", "лапина", "лапта", "лапти", "лата", "лиана", "линт", "липа", "набат", "наиб", "па", "паб", "палатин", "пан", "пани", "пат", "патан", "пиала", "пила", "пина", "пинта", "план", "плат", "плата", "платан", "платина", "плита", "тал", "талиб", "тина", "тип"],
    "безматок": ["азот", "акт", "аозт", "атом", "бак", "бек", "бета", "боа", "бок", "бот", "замок", "заток", "зек", "зет", "зоб", "кат", "кеб", "кета", "кобза", "коза", "ком", "кома", "комбат", "комета", "кот", "мазок", "мак", "макет", "мат", "мета", "мот", "мотка", "оаз", "обет", "обкат", "ом", "отказ", "таз", "тако", "тема", "ток", "том"],
    "бесшумность": ["бентос", "бес", "бетон", "бон", "босс", "бот", "бум", "бунт", "бут", "бутон", "бушмен", "енот", "мент", "место", "месть", "мост", "мосье", "мот", "мсье", "мусс", "муссон", "муст", "мутон", "муть", "нос", "нут", "обет", "обмен", "ом", "омут", "осень", "ост", "ость", "ось", "семь", "сено", "сень", "сет", "сеть", "смесь", "сноб", "снос", "собес", "сом", "сон", "сонет", "сонм", "соус", "стен", "стон", "суть", "сушь", "темь", "тень", "том", "тон", "тонус", "туес", "тун", "туш", "тушь", "ум", "ус", "устье", "шен", "шест", "шмон", "шоссе", "шоу", "шоумен", "штос", "штосс", "шум", "шуст", "шут"],
    "блиндаж": ["ад", "аил", "бадин", "бал", "блин", "дан", "джин", "дина", "длина", "жад", "жбан", "жила", "ил", "лад", "лаж", "наиб"],
    "боксит": ["бикс", "бит", "биток", "бок", "бокс", "бот", "ботик", "ик", "икс", "иск", "исток", "киот", "кит", "кости", "кот", "ост", "си", "сито", "скит", "скот", "сок", "сток", "тик", "тис", "ток"],
    "боровик": ["бок", "боров", "брик", "вор", "ик", "ков", "короб", "кров", "обои", "оброк", "око", "ор", "орк", "орок", "ров", "ровик", "рок", "бор"],
    "брусок": ["бок", "бокс", "брус", "бук", "букс", "бур", "куб", "курс", "ор", "орк", "орс", "рок", "сбор", "сок", "сор", "срок", "сруб", "сук", "сурок", "убор", "укор", "укос", "урок", "ус", "бор"],
    "вакуумметр": ["акр", "акт", "амур", "ар", "арк", "артем", "аут", "ваер", "вакуум", "вар", "век", "вера", "верк", "вермут", "ветка", "кар", "каре", "карт", "кат", "катер", "кета", "крат", "крем", "кум", "кума", "кура", "курва", "курта", "кутум", "мавр", "мак", "макет", "март", "мат", "мем", "мемуар", "мера", "мерка", "мета", "метр", "мрак", "муар", "мука", "мура", "рак", "раут", "ре", "река", "рема", "рука", "рукав", "рута", "тавр", "тема", "трак", "трек", "туер", "тумак", "тур", "тура", "турка", "увар", "ум", "урка", "утка"],
    "валькирия": ["аил", "акр", "акрил", "ар", "ария", "арк", "вал", "валик", "вар", "вилка", "вира", "враки", "враль", "ива", "ик", "икра", "ил", "илька", "кал", "кар", "кил", "кила", "киль", "клавир", "клир", "краля", "криль", "лавр", "лак", "лаки", "лар", "ларь", "ливр", "лик", "лира", "лирик", "лирика", "ля", "лярва", "рак", "ракия", "риал", "явка", "явь", "як", "ял", "ялик", "яр", "ярка"],
    "вафельщица": ["аил", "альфа", "вал", "валец", "вещица", "вещь", "вица", "ель", "ива", "ил", "лава", "лафа", "лев", "лещ", "лиф", "львица", "фа", "фал", "фальц", "фиал", "фила", "филе", "фильц", "цвель", "цель", "щавель", "щель", "щи"],
    "воеводство": ["ввод", "вдовство", "вес", "вест", "вето", "до", "досев", "дот", "овод", "осоед", "осот", "ост", "остов", "отвес", "отвод", "отсев", "свет", "свод", "сев", "сет", "совет", "тодес"],
    "ворсильщик": ["вилок", "вис", "виски", "висок", "вол", "волк", "вор", "ворс", "воск", "ик", "икс", "ил", "ирис", "иск", "кил", "кило", "киль", "клир", "клирос", "ков", "кол", "корь", "криль", "кров", "кровь", "кроль", "ливр", "лик", "лирик", "лов", "лор", "лори", "лоск", "лось", "окись", "ор", "орк", "орс", "ослик", "ось", "рис", "риск", "ров", "ровик", "рок", "рол", "ролик", "роль", "рольщик", "свиль", "свищ", "си", "сикл", "силок", "силь", "скол", "слив", "сливки", "сливщик", "совик", "сок", "соли", "соль", "сор", "срок", "щи", "щорс"],
    "всемирность": ["верность", "вес", "вест", "весть", "вино", "винт", "вис", "воин", "вонь", "вор", "ворс", "енот", "инвестор", "ион", "мент", "меринос", "месиво", "месть", "метро", "ми", "минор", "мирность", "мирон", "мирт", "мисс", "мистер", "монист", "монстр", "море", "морс", "мосье", "мсье", "неврит", "нить", "номер", "овин", "ор", "осень", "осетин", "остин", "ость", "отсев", "ревность", "ремонт", "рис", "ритм", "ром", "рот", "свес", "свист", "сев", "севр", "сено", "сень", "сеньор", "серв", "серость", "сеть", "синь", "синьор", "сирость", "систр", "сито", "смерть", "смесь", "смотр", "снос", "сом", "сонет", "сонм", "сор", "сорт", "стен", "стерин", "теин", "темь", "тени", "тенор", "тень", "термос", "тир", "тирс", "тис", "том", "тон", "трен", "трином", "трон", "трос"],
    "выкаливание": ["аил", "акание", "акын", "алан", "анклав", "вал", "валенки", "валик", "век", "великан", "веник", "вилка", "вилы", "вина", "вливание", "вывал", "выливание", "ива", "иена", "ик", "икание", "ил", "инки", "каин", "кал", "калан", "калин", "калина", "кан", "канал", "канва", "кивание", "кил", "кила", "кина", "клан", "лава", "лавина", "лавка", "лак", "лаки", "ланка", "лев", "левак", "лек", "лиана", "ливанка", "ливы", "лик", "навал", "навивка", "навык", "накал", "налив", "наливка", "нева", "нива"],
    "выразитель": ["аил", "альт", "ар", "артель", "ваер", "вал", "валет", "вар", "вера", "верзила", "ветла", "виза", "вилы", "вира", "враль", "врез", "вылет", "вырез", "выть", "ель", "ерь", "завет", "зал", "залив", "зверь", "зев", "зева", "зет", "зритель", "ива", "ил", "лавр", "лазер", "лар", "ларь", "латы", "лев", "левират", "левит", "ливер", "ливр", "ливы", "лира", "литавры", "литер", "литера", "литр", "раз", "разлив", "рать", "ре", "реал", "резь", "релиз", "риал", "риза", "тавр", "таз", "тал", "талер", "тварь", "тир", "тире", "трал", "трель", "тыл"],
    "глухонемота": ["алеут", "ант", "аул", "аут", "ген", "глум", "го", "гомон", "гонт", "гул", "гумно", "гута", "енот", "лагун", "легат", "летун", "лом", "лоно", "лох", "луна", "мант", "манту", "мат", "мгла", "мена", "ментол", "мета", "метла", "метол", "меха", "могол", "мол", "молот", "монах", "монгол", "монета", "мот", "мох", "мул", "мулат", "мутаген", "муха", "мхат", "нагул", "намол", "нега", "немота", "нога", "нома", "нуга", "нут", "оленуха", "олеум", "олух", "омег", "омега", "омела", "омут", "отгон", "отлог", "отмах", "отмена", "охота", "тал", "талон", "танго", "тело", "теолог", "технолог", "тога", "тол", "том", "томан", "тон", "туман", "туна", "тунг", "угон", "улан", "улем", "умолот", "уха", "ухо", "хам", "хан", "хна", "хомут", "хон", "хота", "хунта"],
    "горбуша": ["ар", "арго", "ашуг", "багор", "бар", "боа", "бог", "бора", "бра", "бугор", "бур", "бура", "бург", "го", "гора", "горб", "граб", "гроб", "грош", "груша", "губа", "ор", "раб", "рагу", "роба", "рог", "убор", "угар", "шаг", "шар", "шоу", "шуба", "шуга", "бор"],
    "гортензия": ["ген", "героин", "героиня", "гинея", "гиря", "гит", "го", "гон", "гонт", "горе", "горин", "горн", "грот", "енот", "зенит", "зерно", "зет", "зонт", "зоря", "иго", "ион", "итог", "негр", "низ", "нория", "ор", "оргия", "орт", "отрез", "ре", "регион", "резня", "резон", "рея", "ринг", "рог", "рот", "теин", "тени", "тенор", "теория", "тигр", "тир", "тире", "тон", "тоня", "торг", "торги", "трен", "трио", "трог", "трон", "яр"],
    "декстрин": ["деист", "дек", "дети", "диск", "днестр", "дрек", "ик", "икс", "индекс", "иск", "кедр", "керн", "кисет", "кит", "кредит", "крен", "крест", "кретин", "крит", "рдест", "ре", "редис", "ринк", "рис", "риск", "сеид", "сени", "сет", "си", "сидр", "сирен", "скирд", "скит", "стек", "стен", "стенд", "стер", "стерин", "теин", "тени", "тик", "тир", "тире", "тирс", "тис", "трек", "трен", "треск"],
    "деноминация": ["ад", "анемия", "анемон", "анион", "анод", "аноним", "дан", "демон", "дина", "динамо", "дно", "до", "дом", "домен", "домна", "донна", "еда", "единица", "идея", "идиома", "иена", "иман", "имя", "индиец", "иод", "ион", "иония", "мания", "медиа", "медиация", "медицина", "мена", "ми", "мидия", "мина", "мини", "миоцен", "мода", "модница", "наин", "намин", "нация", "неон", "нома", "номад", "номинация", "нона", "ода", "ом", "цена", "циан", "цинния", "яд", "яма"],
    "джокер": ["дек", "декор", "джок", "до", "дож", "док", "докер", "дрек", "дрок", "едок", "жор", "кедр", "код", "корд", "корж", "кредо", "одр", "ор", "орк", "ре", "род", "рок"],
    "забавник": ["абаз", "абазин", "азан", "база", "бак", "банк", "банка", "бивак", "вабик", "ваза", "виза", "вина", "забивка", "заика", "знак", "ива", "изба", "ик", "кабан", "кабина", "казна", "каин", "кан", "канва", "кина", "кинза", "набивка", "наиб", "наказ", "нива", "низ", "низка"],
    "задевание": ["ад", "азан", "ваза", "веда", "вид", "виза", "вина", "дан", "дева", "девиз", "девиза", "деев", "диана", "диван", "диез", "дина", "еда", "езда", "зад", "задание", "заедание", "звание", "здание", "зев", "зева", "зевание", "ива", "иена", "наезд", "нева", "нива", "низ"],
    "инобытие": ["бетон", "бинт", "бит", "бон", "боны", "бот", "быт", "бытие", "енот", "ион", "обет", "теин", "тени", "тон", "тын"],
    "ископаемое": ["апис", "ас", "ик", "икс", "иск", "искомое", "кепи", "кипа", "киса", "ком", "кома", "коми", "компас", "копа", "коса", "маис", "мак", "маки", "ми", "миска", "мопс", "око", "окоп", "ом", "опак", "опека", "описка", "опоек", "оса", "осек", "осока", "оспа", "па", "пак", "пас", "паск", "пасмо", "пек", "пески", "песо", "песок", "пик", "пика", "пике", "пим", "писк", "поем", "поимка", "поиск", "покос", "помои", "саке", "сема", "си", "сип", "скип", "скоп", "скопа", "смак", "сок", "сом", "сома", "сопа", "сопка"],
    "кассатор": ["акр", "акт", "аорта", "ар", "арак", "арат", "арк", "арка", "артос", "ас", "астра", "кар", "кара", "карат", "карст", "карт", "карта", "касса", "каста", "кастор", "кат", "кора", "корт", "коса", "костра", "кот", "краса", "красота", "крат", "кроат", "кросс", "крот", "окрас", "ор", "орк", "орс", "орт", "оса", "осака", "оскар", "ост", "отара", "рак", "рака", "раса", "раскат", "раскос", "рок", "роса", "рост", "рот", "рота", "сакс", "скат", "скот", "сок", "сор", "сорт", "соска", "сотка", "срок", "ссора", "старка", "сток", "строка", "тако", "такса", "тасс", "ток", "тора", "торк", "торс", "тоска", "трак", "трасс", "трасса", "трок", "трос", "тара"],
    "квашнин": ["вина", "ива", "ик", "ишак", "каин", "кан", "кина", "наин", "нива", "ниша", "шванк", "ши", "шик", "шина", "шкив"],
    "коллапс": ["ас", "кал", "клоп", "кол", "копа", "копал", "коса", "лак", "лоск", "опак", "опал", "оса", "оскал", "оспа", "па", "пак", "пас", "паск", "пол", "пола", "полк", "полка", "сало", "салоп", "скало", "скол", "скоп", "скопа", "сок", "солка", "сопа", "сопка"],
    "концессия": ["ик", "икс", "инок", "ион", "иск", "кессон", "кино", "кисея", "кон", "конец", "косец", "нок", "нос", "носик", "оникс", "осек", "оссеин", "секция", "сени", "сено", "си", "синец", "синяк", "снос", "сок", "сон", "соня", "сосец", "сосняк", "соя", "цинк", "як", "янки", "яс"],
    "корифей": ["ик", "кефир", "кий", "кофе", "кофей", "кофр", "крой", "ор", "орк", "ре", "рей", "риф", "рой", "рок", "фойе"],
    "крематорий": ["акр", "ар", "арк", "атом", "ик", "икра", "йота", "каре", "карт", "кат", "катер", "кета", "киот", "кит", "ком", "кома", "комар", "комета", "коми", "кора", "корм", "корт", "кот", "край", "кратер", "крем", "кроат", "крот", "май", "майор", "мак", "макет", "маки", "март", "мат", "материк", "мера", "мерка", "метр", "метрика", "ми", "мир", "мирок", "мирр", "мирт", "митра", "мор", "море", "мортира", "мотка", "ом", "омар", "ор", "орт", "рай", "райком", "рак", "реактор", "рей", "рейтар", "река", "рема", "ритм", "рой", "рок", "ром", "рот", "рота", "ротик", "тайм", "таймер", "тако", "тема", "тик", "тир", "тире", "той", "ток", "токай", "томик", "тора", "торий", "торк", "трак", "трек", "тремор", "триера", "трио", "тройка", "трок"],
    "кукарекание": ["акание", "акр", "анкер", "анри", "ар", "арак", "арека", "арена", "арк", "арка", "аркан", "арника", "аура", "иена", "ик", "икра", "иранка", "каик", "каин", "кан", "кар", "кара", "каре", "каркание", "кенарка", "керн", "кика", "кина", "кирка", "кран", "краник", "крен", "крик", "крикун", "кринка", "кукан", "кун", "куна", "кунак", "кура", "курение", "накра", "наука", "нерка", "нукер", "раина", "рак", "рака", "рана", "ранка", "ре", "река", "ринк", "руина", "рука", "руна", "укание", "украинка", "уран", "урина", "урка", "урна"],
    "кульман": ["аул", "кал", "кан", "клан", "кулан", "куль", "кум", "кума", "кун", "куна", "лак", "лань", "лук", "лука", "луна", "лунка", "лунь", "мак", "манул", "мука", "мул", "нуль", "улан", "ум"],
    "купюра": ["акр", "ар", "арк", "кар", "карп", "каюр", "крап", "круп", "крупа", "купа", "кура", "па", "пак", "пар", "парк", "паук", "пук", "пурка", "рак", "рука", "урка", "урюк", "юр", "юра"],
    "лексика": ["аил", "ас", "ик", "икс", "ил", "иск", "каик", "кал", "кекс", "кика", "кикс", "кил", "кила", "киса", "киска", "клик", "клика", "лак", "лаки", "лек", "лес", "леса", "леска", "лик", "лиса", "лиска", "саке", "салки", "си", "сикл", "сила", "скак"],
    "мединститут": ["деист", "дети", "дунит", "дунст", "дуст", "индуист", "индус", "институт", "иудеи", "мент", "ми", "мини", "минус", "муст", "нудист", "нут", "сеид", "семит", "сени", "сет", "си", "сиенит", "сити", "стен", "стенд", "студент", "суд", "теин", "теист", "тени", "тент", "тест", "тис", "тиун", "тмин", "туес", "тун", "тут", "ум", "ус"],
    "минутка": ["акт", "ант", "аут", "ик", "иман", "каин", "камин", "кан", "кант", "кат", "кина", "кит", "кнут", "кум", "кума", "кун", "куна", "мак", "маки", "мант", "манту", "мат", "ми", "мина", "минута", "мука", "нитка", "нут", "танк", "тик", "тина", "тиун", "тмин", "тукан", "тумак", "туман", "тун", "туна", "туника", "ум", "умник", "униат", "утка"],
    "монетарист": ["анис", "арест", "аристон", "артем", "артос", "атеист", "атом", "атомист", "иман", "маис", "манси", "мант", "марс", "масон", "мастер", "мастит", "мат", "мена", "мета", "метр", "метро", "ми", "мир", "мирон", "мистер", "монист", "монтре", "мор", "морс", "мост", "наст", "натр", "нитрат", "нора", "нос", "омар", "орт", "осман", "ост", "отит", "рамс", "рант", "рента", "рис", "ром", "рост", "рота", "сан", "сантиметр", "сатинет", "семит", "сена", "сенат", "сет", "си", "сирота", "ситар", "смирна", "сон", "сонет", "сонм", "сортимент", "срам", "старт", "стеарин", "стена", "стер", "театр", "теист", "тенор", "термист", "термит", "термос", "тест", "тета", "тир", "тирс", "тис", "титан", "титр", "том", "томат", "тора", "торс", "тотем", "траст", "треста", "трио", "тритон", "трот"],
    "надсечка": ["ад", "ас", "дан", "дача", "дачка", "дек", "дека", "декан", "десна", "еда", "каданс", "кан", "кача", "насад", "наседка", "насечка", "сад", "саке", "сан", "сдача", "секач", "сена", "сечка", "скена", "чакан", "чан", "час", "чек", "чека"],
    "наложение": ["аил", "анион", "жало", "желание", "желе", "желна", "жена", "жила", "иена", "ил", "ион", "лаж", "лежание", "ложа", "ложе", "лонжа", "нажин", "наин", "нежин", "неон", "нож", "нона", "олеин", "оленина"],
    "написание": ["анис", "апис", "ас", "иена", "наин", "па", "пан", "пани", "панна", "пас", "пена", "пенис", "пенни", "пенс", "пина", "пинна", "писание", "писанина", "псина", "сан", "сани", "сапа", "сена", "сени", "си", "сиена", "синап", "сип", "спина"],
    "обращение": ["анри", "ар", "бар", "барин", "барон", "боа", "бон", "бона", "бора", "борение", "борщ", "бра", "ибер", "иена", "ион", "набор", "наиб", "нора", "обещание", "общение", "община", "ор", "раб", "ращение", "ре", "роба", "роение", "рона", "роща", "щербина", "щи", "бор"],
    "осознание": ["анион", "анис", "анонс", "ас", "занос", "знание", "зона", "иена", "износ", "ион", "наин", "нанос", "неон", "низ", "нона", "нос", "оаз", "оазис", "озон", "оса", "осина", "саз", "сан", "сани", "сезон", "сена", "сени", "сено", "си", "сиена", "сознание", "сон"],
    "отблеск": ["бек", "бел", "белок", "бес", "блеск", "блок", "бок", "бокс", "болт", "боскет", "бот", "кеб", "клот", "кол", "кот", "лек", "лес", "лесок", "лето", "леток", "лоб", "лоск", "лот", "обет", "осек", "ост", "отсек", "село", "сет", "скол", "скот", "слот", "сок", "стек", "стекло", "сток", "стол", "столб", "тело", "телок", "тесло", "ток", "тол", "толк"],
    "отстранение": ["анион", "анис", "анортит", "ант", "аорист", "арест", "артист", "атеист", "иена", "интерес", "интернат", "интернет", "наин", "наст", "настроение", "натрон", "нитрат", "нона", "нос", "ор", "орт", "осетрина", "осина", "остеит", "остин", "острение", "ратин", "ре", "рента", "реостат", "рис", "роение", "росинант", "рост", "сани", "сатинет", "сенат", "сера", "серна", "сет", "си", "сиена", "сирен", "сирена", "сирота", "сито", "сон", "сонант", "сонет", "сорит", "сорт", "сотерн", "стан", "старт", "статор", "стен", "стена", "стер", "стерин", "стрит", "танин", "тарист", "тат", "театр", "теин", "тени", "тент", "тесание", "теснота", "тест", "тесто", "тета", "тина", "тиран", "тирс", "титан", "тон", "тонна", "торит", "торс", "торт", "тостер", "транс", "трение", "трест", "триас", "трио", "троение", "трос", "трот"],
    "паутинка": ["акант", "акт", "актау", "ант", "аут", "ик", "каин", "кан", "канат", "кант", "капитан", "каптан", "капут", "кат", "кина", "кипа", "кипу", "кит", "кнут", "кун", "куна", "купа", "накат", "наука", "нитка", "нут", "па", "пак", "пакт", "пан", "пани", "паника", "панк", "пат", "патан", "паук", "паутина", "пик", "пика", "пикан", "пина", "пинта", "пуант", "пук", "пункт", "путина", "путник", "танк", "тапка", "тик", "тина", "тип", "типун", "тиун", "тукан", "тун", "туна", "туника", "тупик", "униат", "униатка", "утка"],
    "поднебесная": ["ад", "анод", "анонс", "ас", "баден", "баня", "бас", "басня", "басон", "баян", "беда", "бес", "беседа", "боа", "бон", "бона", "бонна", "дан", "даос", "депо", "десна", "дно", "до", "донна", "еда", "нанос", "неон", "непоседа", "нона", "нос", "обед", "обедня", "ода", "оса", "оспа", "па", "паб", "пан", "панно", "пас", "пена", "пенс", "пенсне", "пеня", "песня", "песо", "победа", "посад", "пояс", "сабо", "сад", "сан", "сдоба", "сена", "сено", "сеноед", "сноб", "сноп", "сода", "сон", "соня", "сопа", "соя", "спад", "ябеда", "яд", "яс"],
    "прелесть": ["ель", "ересь", "ерь", "леер", "лепет", "лес", "лесть", "перл", "перль", "перс", "перст", "пест", "плеер", "плеть", "прель", "ре", "рельс", "репс", "сель", "серп", "сет", "сеть", "спель", "степ", "степь", "стер", "трель", "треп", "трепел"],
    "прибалтика": ["аил", "акрил", "алиби", "апилак", "араб", "арак", "арба", "арбат", "арк", "арка", "бак", "балка", "балтика", "бар", "барит", "барк", "барка", "бирка", "бита", "битки", "блик", "бра", "брат", "братик", "икра", "ил", "иприт", "кал", "калибр", "капрал", "карат", "карп", "карта", "кил", "кила", "кипа", "клир", "крипта", "лаки", "лапка", "лапта", "лар", "лата", "липа", "липка", "лира", "лирик", "лирика", "литр", "пак", "пакт", "палитра", "пар", "параклит", "пари", "парик", "парк", "пат", "пиала", "пиар", "пик", "пика", "пила", "пилка", "пират", "пирит", "плакат", "плат", "плата", "плита", "плитка", "прибалт", "раб", "раба", "рака", "ракита", "рапа", "риал", "тал", "талиб", "талик", "тапир", "тапка", "тиара", "тип", "тир", "трал", "трап", "триба", "тара"],
    "призвание": ["анри", "ар", "ваер", "вар", "вера", "виза", "вина", "вира", "врез", "запев", "звание", "зев", "зева", "ива", "иена", "инвар", "напев", "нева", "нерв", "нерпа", "нива", "низ", "нрав", "па", "паз", "пан", "пани", "пар", "парез", "пари", "пена", "перина", "пиар", "пина", "пир", "приз", "раз", "ре", "резина", "репа", "репина", "риза"],
    "проволока": ["акр", "ар", "арк", "вал", "вар", "вокал", "вол", "волк", "волок", "вор", "кал", "капор", "кар", "карп", "клоп", "ков", "кол", "копа", "копал", "кора", "корова", "крап", "кров", "лавр", "лак", "лар", "лов", "лор", "овал", "око", "окова", "окоп", "окрол", "олово", "опак", "опал", "опор", "опора", "опорок", "ор", "орк", "орок", "па", "пак", "паоло", "пар", "парк", "парок", "плав", "плов", "повал", "повар", "поволока", "пол", "пола", "полк", "полка", "поло", "полок", "пора", "порка", "порок", "право", "провал", "прок", "прокол", "рак", "раколов", "ров", "рок", "рол", "ропак"],
    "прорезка": ["акр", "ар", "арк", "запор", "зарок", "зек", "капер", "капор", "кар", "каре", "карп", "коза", "копа", "кора", "крап", "крез", "креп", "оаз", "опак", "опека", "опера", "ор", "орк", "па", "паз", "пак", "пар", "парез", "парк", "парок", "пек", "перо", "поза", "показ", "покер", "пора", "порез", "порезка", "порка", "проза", "прок", "прорез", "раз", "разок", "рак", "ре", "резак", "резка", "река", "репа", "репка", "роза", "рок", "рокер", "ропак"],
    "прямота": ["ар", "атом", "март", "мат", "мор", "мот", "мята", "ом", "омар", "опт", "ор", "орт", "па", "пар", "паром", "паря", "пат", "пора", "порт", "пот", "пята", "ром", "рот", "рота", "том", "топ", "тора", "трап", "тромп", "троп", "тропа", "яма", "яр"],
    "пугало": ["агул", "аул", "галоп", "го", "гол", "гул", "лаг", "лог", "луг", "лупа", "огпу", "опал", "па", "плуг", "пол", "пола", "пул", "пула", "пуло", "угол"],
    "развозчица": ["авар", "ар", "арча", "ваза", "вар", "взор", "виза", "вира", "вица", "воз", "вор", "врач", "зазор", "зов", "зраза", "ива", "извоз", "оаз", "овца", "овчар", "ор", "орава", "раз", "развоз", "риза", "ров", "роза", "чаво", "чара"],
    "раздор": ["ад", "ар", "дар", "до", "доза", "дора", "зад", "задор", "оаз", "ода", "одр", "ор", "орда", "раз", "род", "роза"],
    "разработка": ["абаз", "абака", "азарт", "азот", "акароз", "акр", "акробат", "акт", "аозт", "аорта", "араб", "арабка", "арак", "арарат", "арат", "арбат", "арка", "артроз", "атака", "база", "базар", "бак", "бар", "барак", "барк", "барка", "батрак", "боа", "бора", "борт", "бот", "бра", "брат", "брокат", "забота", "закат", "заток", "затор", "зоб", "кар", "кара", "карат", "карра", "карт", "карта", "кат", "кобза", "кобра", "коза", "кора", "корт", "кот", "краб", "крат", "кроат", "крот", "оаз", "обкат", "образ", "обрат", "ор", "орк", "орт", "отара", "отказ", "раб", "раба", "работа", "работка", "раз", "разбор", "разборка", "разок", "рак", "рака", "роба", "роза", "рок", "рот", "рота", "табак", "табор", "таз", "тако", "ток", "тора", "торба", "торк", "трак", "трок", "тара", "бор"],
    "распилка": ["акр", "акрил", "апилак", "апис", "ар", "арап", "арк", "арка", "ас", "ик", "икра", "икс", "ил", "иск", "искра", "кал", "каприс", "кар", "карп", "кил", "кипа", "кираса", "киса", "клипс", "клир", "крап", "краса", "лак", "лаки", "лапа", "лапка", "лар", "ласа", "ласка", "лик", "липа", "липка", "лира", "лиса", "лиска", "па", "пак", "палас", "палка", "пар", "пара", "пари", "парик", "парилка", "парк", "парс", "пас", "паск", "пиала", "пиар", "пик", "пика", "пила", "пилка", "пир", "пирс", "писака", "писк", "плис", "плиска", "раис", "рак", "рака", "рапа", "рапс", "раса", "распил", "риал", "рис", "риск", "риска", "салки", "сапа", "сапка", "си", "сикл", "сила", "сип", "скала", "скип", "скрап", "скрип", "слип", "спил", "спилка"],
    "растирание": ["аист", "анис", "анри", "ант", "ар", "арат", "арена", "арест", "ас", "астра", "иена", "иранист", "ирис", "истина", "наитие", "нарта", "наст", "натр", "раина", "раис", "рана", "ранет", "рант", "раса", "растр", "ратин", "ре", "рената", "рента", "ретина", "ринит", "рис", "сан", "сани", "санитар", "сатин", "сатир", "сатира", "сена", "сенат", "сени", "сера", "серна", "сет", "си", "сиена", "сиенит", "сиерра", "сирен", "сирена", "ситар", "сити", "стан", "старание", "старина", "стеарин", "стен", "стена", "стер", "стерин", "страна", "таран", "теин", "тени", "терраса", "тесина", "тиара", "тина", "тир", "тиран", "тире", "тирс", "тис", "транс", "трен", "триас", "триер", "триера", "тара"],
    "самоанализ": ["азан", "аил", "алан", "алмаз", "анализ", "анис", "ас", "зал", "зала", "занос", "заслон", "засол", "зло", "зола", "зона", "излом", "измол", "износ", "ил", "иман", "ион", "ислам", "лама", "ласа", "лиана", "лиман", "лимон", "линза", "лиса", "лоза", "лозина", "лом", "лосина", "маис", "мала", "малина", "мана", "манси", "маслина", "масло", "масон", "ми", "милан", "мина", "мол", "налим", "намаз", "намол", "низ", "нома", "нос", "оаз", "оазис", "ом", "оса", "осина", "осман", "саам", "саами", "саз", "сазан", "сало", "салон", "саман", "сан", "сани", "си", "сила", "силон", "слом", "слон", "смола", "соли", "сом", "сома", "сон", "сонм", "зима"],
    "самозащита": ["азиат", "азот", "аист", "аозт", "ас", "астма", "атом", "защита", "истома", "маис", "маоист", "мат", "ми", "митоз", "мозаист", "мост", "мот", "моща", "оаз", "оазис", "ом", "оса", "ост", "саам", "саами", "саз", "си", "сито", "сом", "сома", "таз", "тис", "том", "щи", "щит", "зима"],
    "синева": ["анис", "ас", "васин", "вес", "весна", "вина", "вис", "ива", "иена", "навес", "навис", "нева", "нива", "сан", "сани", "сван", "сев", "сена", "сени", "си", "сиена"],
    "синтепон": ["енот", "ион", "неон", "нонет", "нос", "нотис", "опт", "осетин", "ост", "остин", "пенис", "пенни", "пенс", "песо", "пест", "петин", "пион", "пистон", "питон", "пони", "понт", "пост", "пот", "сени", "сено", "сет", "си", "сип", "сито", "сноп", "сон", "сонет", "спинет", "стен", "степ", "стон", "теин", "тени", "теннис", "тип", "тис", "тон", "топ"],
    "сифонофора": ["анис", "анри", "ар", "ас", "ион", "нора", "нос", "ор", "орс", "оса", "осина", "офис", "раис", "рис", "риф", "рона", "роса", "сан", "сани", "си", "сифон", "сон", "сор", "софа", "софора", "фа", "фарс", "фасон", "фирн", "фифа", "фон", "фора", "форс", "фосфор"],
    "склёпщица": ["аил", "апис", "ас", "ёлка", "ик", "икс", "ил", "иск", "кал", "кил", "кила", "кипа", "киса", "клип", "клипс", "клипса", "лак", "лаки", "лик", "липа", "липка", "лиса", "лиска", "па", "паёк", "пак", "пас", "паск", "пёс", "пёсик", "пик", "пика", "пила", "пилка", "писк", "пища", "плац", "плащ", "плащик", "плёс", "плис", "плиска", "плица", "саёк", "салки", "си", "сикл", "сила", "сип", "скип", "слип", "спил", "спилка", "спица", "цикл", "цска", "щи"],
    "смелость": ["ель", "лес", "лесть", "лето", "лом", "лось", "лот", "мел", "мелос", "мель", "место", "месть", "метол", "мол", "моль", "мост", "мосье", "мот", "мотель", "мсье", "ом", "омлет", "ост", "ость", "ось", "отель", "отмель", "село", "сель", "семь", "сет", "сеть", "слом", "слот", "смесь", "смоль", "соль", "сом", "стол", "тело", "темь", "тесло", "тол", "толь", "том"],
    "сроднение": ["дно", "до", "доение", "дорн", "иод", "ион", "неон", "норд", "нос", "одр", "ор", "орден", "орс", "рдение", "ре", "редис", "ренонс", "рис", "род", "роение", "сеид", "сени", "сено", "сеноед", "си", "сидр", "синод", "сирен", "сон", "сор"],
    "стенопись": ["енот", "ион", "иссоп", "нить", "нос", "нотис", "опись", "опт", "осень", "осетин", "оссеин", "ост", "остин", "ость", "ось", "пенис", "пенс", "пень", "песнь", "песо", "пест", "петин", "пион", "пистон", "питон", "пони", "понт", "пост", "пот", "потесь", "сени", "сено", "сень", "сет", "сеть", "си", "синь", "сип", "сито", "сноп", "снос", "сон", "сонет", "спесь", "спинет", "стен", "степ", "степс", "степь", "стон", "теин", "тени", "тень", "тип", "тис", "тон", "топ", "топь"],
    "стрела": ["ар", "арест", "ас", "лар", "ласт", "лес", "леса", "ре", "реал", "сера", "сет", "стела", "стер", "тал", "талер", "талес", "трал"],
    "сценичность": ["енот", "ион", "истец", "неон", "нечисть", "нить", "нонет", "нос", "нотис", "ночь", "осень", "осетин", "оссеин", "ост", "остин", "ость", "ось", "отец", "сени", "сено", "сень", "сет", "сеть", "си", "синец", "синь", "ситец", "сито", "снос", "сон", "сонет", "сосец", "сочень", "стен", "стон", "теин", "тени", "теннис", "тень", "течь", "тис", "тон", "ценность", "цент", "честь", "чин", "чинность", "чистец", "чтец"],
    "телебашня": ["ант", "бал", "балет", "бант", "баня", "батя", "башня", "баян", "бел", "белена", "беляна", "беляш", "бета", "блат", "лента", "лея", "ля", "тал", "тлен", "тля", "шатен", "шен", "шея", "шлея", "штаб", "ял"],
    "термометр": ["мем", "метеор", "метр", "метро", "мор", "море", "мот", "мотет", "ом", "омметр", "ор", "орт", "ре", "реометр", "ром", "рот", "терем", "том", "торт", "тотем", "тремор", "трот"],
    "требование": ["авто", "автор", "ант", "бант", "бар", "барин", "барит", "баронет", "батон", "берет", "бета", "бетон", "бит", "бита", "битва", "бон", "бона", "бора", "борение", "борт", "бот", "ботва", "брат", "бревно", "ваер", "варение", "ватин", "веер", "венера", "вера", "верба", "вербена", "ветер", "ветеран", "вина", "вино", "вира", "вона", "вор", "евреи", "енот", "ибер", "ива", "иена", "инвар", "ион", "набор", "навет", "натр", "нева", "неврит", "нерв", "нива", "нора", "нота", "нрав", "обрат", "овен", "овин", "ор", "орбита", "отбив", "отвар", "ранет", "ратин", "рвение", "ре", "ренет", "рента", "роба", "ров", "рона", "рот", "табор", "таврение", "тавро", "творение", "тени", "тенор", "тина", "тиран", "тире", "товар", "тон", "торба", "торбан", "трен", "трение", "триба", "троение", "бор"],
    "трешкоут": ["кеш", "кореш", "корт", "кот", "крот", "куш", "октет", "ор", "орк", "орт", "ре", "рок", "рот", "ток", "торк", "торт", "трек", "трешкот", "трок", "трот", "туер", "тур", "турок", "тут", "тутор", "туш", "укор", "урок", "уток", "утор", "утро", "ушко", "шкерт", "шкот", "шок", "шоу", "шрот", "штрек", "шут"],
    "удабривание": ["абвер", "абердин", "авар", "ад", "анвар", "ар", "арба", "арена", "аренда", "аура", "баден", "бадин", "банда", "бар", "баран", "бард", "барин", "беда", "бедуин", "бенуар", "бердан", "бивни", "бред", "бредни", "бренди", "будни", "буер", "бур", "бура", "буран", "бурда", "вар", "варан", "вбирание", "ведун", "веранда", "вид", "вира", "вруб", "врубание", "врун", "даба", "дар", "даур", "дебри", "диана", "диван", "дина", "дрена", "дубина", "дубрава", "дуриан", "ерунда", "ива", "иена", "инвар", "иуда", "иудеи", "надир", "надруб", "надув", "наиб", "нарва", "нард", "нева", "недра", "нерв", "нива", "нрав", "раб", "раба", "рада", "радиан", "раина", "рана", "раунд", "ре", "редан", "рубин", "руда", "руина", "руна", "увар", "удав", "удар", "уран", "урина", "урна"],
    "фальшивка": ["аил", "альфа", "афиша", "вал", "валик", "вилка", "ива", "ик", "ил", "илька", "ишак", "кал", "калиф", "каша", "кил", "кила", "киль", "клавиш", "клавиша", "лава", "лаваш", "лавка", "лак", "лаки", "лафа", "лик", "лиф", "фа", "фал", "фиал", "фиалка", "фила", "фиш", "фишка", "флик", "шавка", "шакал", "шала", "шаль", "шваль", "ши", "шик", "шкала", "шкаф", "шквал", "шкив", "шлак", "шлиф"],
    "федералист": ["ад", "аил", "аист", "ар", "арфист", "аферист", "дар", "десерт", "дефис", "диета", "еда", "идеал", "ил", "лад", "лар", "ласт", "лафет", "леди", "леер", "лес", "леса", "летие", "лидер", "лиса", "литер", "литера", "лиф", "лифт", "радист", "раис", "рдест", "ре", "реал", "реалист", "редис", "риал", "рис", "риф", "сад", "сард", "сатир", "сеид", "селитра", "селфи", "сера", "середа", "сериал", "сет", "си", "сидерат", "сидр", "сила", "ситар", "след", "среда", "стела", "стер", "стрела", "сфалерит", "сфера", "тал", "талер", "талес", "тариф", "тир", "тире", "тирс", "тис", "тиф", "трал", "триас", "фа", "фал", "фалерист", "фарс", "фарт", "фасет", "фат", "федерал", "федерат", "фес", "фетр", "фиал", "фиат", "фиеста", "фила", "филе", "фита", "флат", "флирт"],
    "хлорка": ["акр", "ар", "арк", "кал", "кар", "кол", "кора", "крах", "кроха", "лак", "лар", "лор", "лох", "ор", "орк", "охра", "рак", "рок", "рол", "хлор", "холка", "хор", "хорал"],
    "хохотание": ["ант", "енот", "иена", "ион", "неохота", "нота", "охание", "охота", "теин", "тени", "тина", "тон", "хан", "хина", "хит", "хитон", "хна", "хон", "хота", "хохот"],
    "щеглёнок": ["ген", "го", "гол", "гон", "клён", "клещ", "клон", "кол", "кон", "лек", "лён", "лещ", "лог", "нок", "щегол", "щелк", "щёлок", "щенок"],
    "эмират": ["ар", "ирма", "мари", "март", "мат", "ми", "мир", "мирт", "мирта", "митра", "мэр", "мэри", "мэтр", "ритм", "тир", "эмир", "эра"],
    "подбородок": ["бок", "брод", "до", "добор", "добро", "док", "дрок", "код", "корд", "короб", "обод", "ободок", "оброк", "одр", "око", "окоп", "опор", "опорок", "ор", "орк", "орок", "побор", "подбор", "порок", "прок", "род", "рок", "бор"],
    "подросток": ["до", "док", "доктор", "допрос", "дот", "дрок", "код", "копт", "корд", "корт", "кот", "крот", "одр", "око", "окоп", "окот", "опор", "опорок", "опорос", "опрос", "опт", "ор", "орк", "орок", "орс", "орт", "ортодокс", "осот", "ост", "откос", "отоскоп", "отпор", "отрок", "подток", "покос", "порок", "порт", "пост", "пот", "поток", "прок", "прокос", "просо", "проток", "род", "родос", "рок", "рокот", "ропот", "рост", "росток", "рот", "скоп", "скот", "сок", "сор", "сорт", "спор", "спорок", "спорт", "срок", "сток", "стопор", "строп", "ток", "топ", "топор", "торк", "торос", "торс", "трок", "троп", "трос"],
    "прообраз": ["ар", "бар", "боа", "бора", "бра", "забор", "запор", "зоб", "оаз", "обзор", "обоз", "образ", "опор", "опора", "ор", "па", "паб", "паз", "пар", "побор", "поза", "позор", "пора", "проба", "пробор", "проза", "прораб", "раб", "раз", "разбор", "роба", "роза", "бор"],
    "пульсация": ["аил", "апис", "ас", "аул", "ил", "липа", "лиса", "лупа", "ля", "ляп", "ляпис", "па", "палия", "пас", "паяц", "пила", "плац", "плис", "плица", "пляс", "пул", "пула", "пульс", "пуля", "пяла", "си", "сиаль", "сила", "силь", "сип", "слип", "спил", "спица", "сулица", "суп", "улица", "ус", "цапля", "ял", "яс", "ясли"],
    "родник": ["дно", "до", "док", "дорн", "дрок", "ик", "инок", "иод", "ион", "кино", "код", "кон", "корд", "корн", "нок", "норд", "одр", "ор", "орк", "ринк", "род", "рок"],
    "студень": ["день", "дунст", "дуст", "нут", "сень", "сет", "сеть", "снедь", "стен", "стенд", "суд", "суть", "тень", "туес", "тун", "ус", "устье"],
    "томагавк": ["авто", "агат", "акт", "атом", "вага", "вата", "ватка", "гавот", "гамак", "го", "кагат", "кат", "квота", "ков", "ком", "кома", "кот", "маг", "мак", "мат", "матка", "мот", "мотка", "октава", "ом", "отава", "отвага", "тако", "тамга", "тога", "ток", "том"],
    "флорист": ["ил", "илот", "лист", "литр", "лиф", "лифт", "лор", "лори", "лот", "ор", "орс", "орт", "орфист", "ост", "офис", "офит", "рис", "риф", "рол", "рост", "рот", "си", "сито", "ситро", "слот", "соли", "сор", "сорит", "сорт", "софит", "стирол", "стол", "тир", "тирс", "тис", "тиф", "тол", "торс", "торф", "трио", "трос", "флирт", "флот", "фол", "форс", "форт", "фот", "фтор"],
    "абажур": ["ажур", "ар", "араб", "арба", "аура", "бар", "баржа", "бра", "буж", "бур", "бура", "жаба", "жабра", "жар", "жара", "раб", "раба", "уж"],
    "адмирал": ["ад", "аил", "аларм", "ар", "дама", "дар", "драма", "ил", "ирма", "лад", "лада", "лама", "лар", "лира", "мала", "мара", "марал", "мари", "ми", "мир", "рада", "рама", "риал"],
    "интрига": ["анри", "ант", "ар", "гарт", "гит", "гитан", "гран", "гранит", "грант", "игра", "ирга", "натр", "ранг", "рант", "ратин", "ринг", "ринит", "тигр", "тина", "тир", "тиран"],
    "коленка": ["кал", "кан", "клан", "клок", "клон", "кок", "кока", "кол", "колена", "кон", "конка", "лак", "лек", "нок", "океан"],
    "костёр": ["корт", "кот", "крот", "ор", "орк", "орс", "орт", "осётр", "ост", "отёк", "рок", "рост", "рот", "скот", "сок", "сор", "сорт", "срок", "сток", "тёс", "ток", "торк", "торс", "трок", "трос"],
    "критика": ["акр", "акт", "ар", "арк", "ик", "икра", "каик", "кар", "карт", "кат", "кика", "кирка", "кит", "крат", "крик", "крит", "критик", "рак", "тик", "тир", "трак"],
    "малахит": ["аил", "ил", "лама", "ламаит", "лата", "мала", "мат", "мах", "ми", "мхат", "тал", "хала", "халат", "хам", "хамит", "хата", "хит", "хлам"],
    "паровоз": ["ар", "вар", "взор", "воз", "вор", "запор", "зов", "оаз", "опор", "опора", "ор", "па", "паз", "пар", "повар", "поза", "позор", "пора", "право", "провоз", "проза", "раз", "ров", "роза"],
    "поломка": ["кал", "клоп", "кол", "ком", "кома", "копа", "копал", "лак", "лом", "ломка", "мак", "мол", "молока", "око", "окоп", "ом", "опак", "опал", "па", "пак", "паоло", "пол", "пола", "полк", "полка", "поло", "полок", "помол"],
    "потолок": ["клоп", "клот", "кол", "копт", "кот", "лот", "лото", "лоток", "око", "окоп", "окот", "оплот", "опт", "откол", "плот", "пол", "полк", "поло", "полок", "пот", "поток", "ток", "тол", "толк", "топ"],
    "суходол": ["до", "дол", "досол", "дуло", "дух", "лох", "одул", "олух", "слух", "соло", "солод", "суд", "сход", "удол", "ус", "ухо", "уход", "ход", "холод", "худо"],
    "туземка": ["азу", "акт", "аут", "закут", "зек", "зет", "кат", "кета", "кум", "кума", "мазут", "мак", "макет", "мат", "мета", "муза", "мука", "таз", "тема", "туз", "тумак", "указ", "ум", "утка"],
    "фиаско": ["ас", "ик", "икс", "иск", "киса", "коса", "оса", "офис", "си", "скиф", "сок", "софа", "фа", "факс", "фикс"],
    "цесарка": ["акр", "ар", "арак", "арека", "арк", "арка", "ас", "аскер", "кар", "кара", "каре", "краса", "рак", "рака", "раса", "ре", "река", "саке", "сера", "цска"],
    "молодчина": ["ад", "аил", "анод", "дан", "дина", "динамо", "длина", "дно", "до", "дол", "долина", "доломан", "дом", "домино", "домна", "идол", "ил", "иман", "иод", "ион", "лад", "ладо", "лиман", "лимон", "лимонад", "лич", "лом", "лоно", "ми", "милан", "мина", "мода", "мол", "моча", "мочало", "мочило", "надлом", "налим", "намол", "нома", "номад", "ода", "ом", "чадо", "чал", "чан", "чин", "чина"],
    "антисептик":["каинит","пакт","сити","тест","тесина","пан","спина","аист","тикание","петин","сет","теин","сени","панк","аскет","ас","титан","тени","кит","кина","пак","тик","тесак","истина","спинка","пекан","псина","сиенит","пианист","сенат","секта","септик","ик","тина","икс","аттик","пакет","стен","тент","атеист","пина","пенис","пена","скип","сиена","си","петит","пик","пенка","саке","каин","текст","акт","пантеист","искание","катет","нитка","сан","ант","наст","синтетика","киса","кан","пикет","пас","кант","такт","танкист","скитание","пек","скит","скат","спинет","наитие","кат","сани","стена","питта","стан","китаист","кета","кастет","кипа","стек","пикан","сатин","иена","синап","пестик","кисет","скена","такси","сектант","санки","тат","степ","аспект","пике","киста","пески","писание","скепт","стенка","пистик","пат","писк","кепи","сетка","пика","пики","пинетки","танк","стека","паск","тета","титаник","сена","пани","тис","тип","пинта","натиск","синтетик","астеник","сатинет","па","сип","патент","пест","теист","питание","икание","тиски","пенс","пинетка","иск","анис","тапки","апис","инки","аистник"],"металлург":["мура","гарт","муар","гул","улем","туарег","тур","рема","гетра","март","амур","галл","ум","амулет","мул","гута","тема","гаер","тал","ламут","артем","мулат","мат","легат","туер","улар","агул","глум","мгла","лар","талер","аул","мера","угар","аут","лаг","урал","грум","рагу","металл","раут","герма","мел","алеут","рулет","маг","тура","рута","луг","ар","метр","мулла","теллур","гурт","гарем","мета","ре","лемур","метла","гамлет","теург","реал","трал"],"микрофауна":["мура","фирма","уран","норка","иранка","кар","кора","инок","рана","маниок","камин","муар","фараон","кома","нома","окарина","миро","кума","анри","маринка","ор","кура","окраина","нимфа","ми","кина","амур","омар","кофр","фирн","кум","рок","ум","корма","ик","урок","икра","арника","кармин","мор","фонарик","фоника","минорка","урка","раина","каин","куна","урон","ринк","манка","конура","марафон","иман","карма","камфора","кино","крона","фауна","нора","риф","нарком","кан","амфора","умора","минор","коран","орк","фа","ирма","мана","икона","кифара","ром","рама","мирок","мина","норма","рафик","маки","мир","фрак","умник","маниока","арк","рука","фура","франк","урна","руина","укор","аарон","кун","мак","марка","аура","фора","арфа","наука","мука","мрак","финка","ком","манок","морфин","арак","марина","роман","рамка","накра","ар","нок","акр","мирон","факир","кара","корн","карман","мари","кон","фара","форум","оркан","рак","руна","фрау","униформа","рака","арка","африка","морф","фон","рифма","корм","миф","комар","ион","комара","кран","фурма","караим","фанк","иномарка","ом","аркан","коми","микрон","мара","урина","ранка","рона","форма","маран","кумир"],"декламация":["камелия","камея","цикля","идеал","аил","ад","малик","ми","ля","леди","медяк","лаки","лад","ик","кила","дамка","цикада","яма","лекция","яд","кал","лик","лак","кил","ял","мала","имя","еда","маки","медиа","маца","малица","мак","дека","ил","дек","акция","акация","мел","лада","лямка","лек","малец","ямка","як","лама","идея","клад","ялик","академия","медик","малаец","маяк","дама","цадик","миля","цикл","мялка","лея"],"окуривание":["уран","норка","кар","кора","инок","вика","вареник","анри","вира","ор","кура","океан","вино","кина","вареники","век","крен","вор","нрав","рок","нерв","ик","верк","урок","икра","увар","иноверка","урка","каин","куна","урон","ринк","конура","курва","овин","военрук","кино","крона","нора","кан","враки","анкер","новик","коран","орк","ров","икона","врун","внук","вера","ков","веко","арк","рука","урна","руина","укор","кун","вона","ива","иена","каре","ар","нок","курево","акр","овен","ровик","ваер","корн","нукер","кон","оркан","внуки","рак","руна","веник","нева","воин","река","вероника","окание","вено","ион","кран","кивер","керн","ре","икание","вина","нива","кивание","укание","нерка","вар","венок","урина","кирова","винокур","рона","инвар","кров","инки","рукав"],"сберкасса":["кар","бра","сакс","брасс","бес","ас","скарб","сербка","бар","раса","касса","арба","саке","баска","бекар","арабеск","барк","барс","абрек","кеб","бас","брак","саба","арк","барекс","аскер","барка","каре","краса","араб","арак","сера","ар","баск","баркас","акр","брас","кара","секс","кабаре","барак","краб","арека","рак","рака","раба","река","раб","серб","арка","бек","ре","бак","бекас"],"назревание":["риза","рана","анри","авар","азан","вира","равнина","низ","резина","раз","ранение","нрав","нерв","нирвана","зев","варение","раина","врез","знание","нарва","венера","вера","зева","нарезание","евреи","навар","врезание","резание","ива","ваза","анвар","иена","арена","веер","название","ар","разевание","звание","ваер","нева","нарзан","зрение","варан","ванна","равнение","зевание","рвение","наин","ре","виза","вина","нива","вар","инвар"],"скапывание":["весна","канва","вика","пан","спина","навык","васин","вес","сени","панк","касание","ас","пасека","пава","всыпание","сын","кина","пак","век","сваны","спинка","пекан","псина","сев","ик","икс","насыпка","вакса","павиан","пина","пенис","вепс","пена","напев","скип","насып","сиена","си","пик","писака","пенка","саке","каин","сапа","сван","сан","спевка","свинка","аванс","сванка","киса","кан","пас","выписка","навес","пек","канапе","сани","саван","саква","савка","кипа","пикан","ива","иена","синап","вис","скена","санки","паника","пике","выпас","пески","писк","кепи","пика","синева","паск","навис","капание","сапка","сена","веник","нева","пани","па","сип","акын","акание","вина","нива","пенс","иск","анис","квас","апис"],"скирдовоз":["орс","иод","сидр","око","дворик","ор","совик","извод","сор","род","вор","рис","рок","ик","висок","икс","совок","диво","ворс","овод","си","скирд","орок","орк","ров","дозор","криз","двор","воск","взор","ков","до","воз","родос","вид","риск","рисовод","диск","возок","одр","вис","корд","срок","дрок","зов","оксид","код","ровик","сок","ирод","дикорос","док","вздор","свод","иск","своз","кров"],"актинограф":["арат","нагар","гранит","тифон","норка","иранка","кар","гарт","кора","инок","рана","карта","кагат","рогатка","фараон","таган","нога","окарина","икота","карат","гран","гриф","гофр","киот","ток","форинт","анри","агат","ор","ранг","фарт","окраина","гора","горка","кит","фата","тон","кина","тик","рог","крит","гитан","торг","крат","фартинг","кофр","граф","книга","тора","фирн","тоник","трио","фита","рок","ик","тина","гит","икра","гонт","арника","крага","картинг","нотка","фонарик","фоника","тако","фагот","рота","тигр","тариф","раина","каин","картина","акт","фанта","каторга","фактор","ринк","нитка","ганка","ирга","гонка","ант","торф","ротанг","кино","крона","нора","фогт","риф","кан","карт","аорта","торги","кроат","трог","тиф","кант","коран","картон","орк","фа","гифа","тога","фантик","икона","каган","гон","трок","кифара","офит","тоника","фиг","отара","кат","форт","рафик","графит","орт","кот","фрак","инфаркт","фант","натирка","горн","игра","ракита","ангар","арк","карга","таран","франк","иго","аарон","фанат","рант","канат","рогатина","агар","фора","график","фот","арфа","графин","нота","накат","фанг","агнат","онагр","финка","гитара","итог","фига","франт","ногата","натр","таганок","арак","ратин","фанатик","рот","кагор","кафтан","факт","накра","ар","кантор","катион","орган","фронт","нок","готика","акр","танк","ротик","факир","кара","корн","торк","грот","кон","фара","тир","аргон","трагик","акант","оркан","финт","крот","рак","тиара","горин","арго","рака","нагота","фигаро","грант","арка","африка","фон","трак","гитана","грифон","тиран","ринг","нарта","графа","каротин","ион","кран","аконит","трон","гарант","танго","контра","гранат","трико","корт","фанк","ратник","фанариот","аркан","графика","го","кантри","огранка","игрок","фтор","ранка","фат","рона","фиат","кофта"],"югославка":["лавка","вал","лава","люк","влас","огласка","ас","слог","кагал","коса","влага","вакса","лов","оскал","юг","солка","кал","главк","сага","волга","овал","вокал","лак","кол","воск","саква","юла","ков","савка","ласка","лаг","люкс","галка","глава","славка","гол","волк","глас","скала","сало","клюв","оса","вага","коала","свалка","гваюла","словак","вол","скол","саго","лаоска","югослав","сок","овсюг","скало","юс","юкола","лог","слава","осака","ласа","лоск","сова","го","юлка","квас","галс","совка"],"пересушка":["парус","сура","шурпа","кар","парсек","пуск","перш","кеш","шар","акушер","кура","ас","пак","парк","капер","крап","шерпка","пурка","прусак","креп","урка","скуп","саке","сурепа","репа","сушка","серп","рапс","шкура","купа","скрепа","перекус","спешка","пас","пешка","саше","пек","суп","русак","шерп","решка","пук","курс","арк","рука","ус","аскер","куш","круп","репс","карп","крупа","каре","пушка","перс","раус","сера","прус","скрап","ар","пар","акр","шпур","паск","сука","рак","паук","сурепка","река","купе","каперс","па","ре","каупер","суша","репка","сук","парс"],"обтирка":["кар","кора","бра","боа","кобра","икота","киот","обкат","ток","бок","ор","бортик","кит","тик","крит","крат","тора","обрат","трио","бит","рок","бар","ик","икра","тако","рота","акт","борт","биток","барк","карт","кроат","орк","бот","брик","трок","кат","брак","орт","кот","бита","арк","ботик","триба","браток","аборт","брокат","барит","орбита","табор","рот","ар","кариб","акр","ротик","торк","тир","краб","крот","брат","рак","братик","раб","трак","бирка","трико","корт","бора","торба","бак","роба"],"паголенок":["паоло","окоп","полк","нога","пан","око","панк","океан","пак","полено","пекан","погон","окно","понг","опоек","локон","ангел","план","пена","налог","пенка","колено","клон","опак","кал","гонка","поклон","ген","кан","клоп","клан","плена","гон","лоно","пек","копа","лак","кол","лаг","полок","гопак","конго","копал","гол","налеп","плен","поле","паклен","лек","нега","пенал","галоп","нок","кон","опал","полка","колена","поло","пекло","пола","полог","па","лог","полон","пол","го","лепка","копна","опека","аполог"],"холстина":["хаос","хитон","илот","аист","линт","лох","аил","ас","салон","тон","лист","сито","ласт","тина","нос","хост","тал","си","хан","сан","ант","наст","соли","хит","нилот","сани","ост","слониха","стан","талон","сила","сатин","ил","нотис","соха","нота","сало","лихо","оса","стон","хина","лосина","стих","осина","силон","холст","хота","тол","настил","сон","лот","лосиха","тис","хон","ион","остин","хна","стол","слон","слот","анис","лиса","сноха"],"гарпунщик":["уран","кар","пан","гран","кипу","анри","гарпун","парник","панк","пурга","ранг","пуща","кура","кина","пак","парк","книга","нуга","крап","гуща","ик","пурка","икра","пина","щур","пари","урка","пик","каин","пиар","куна","ринк","щурка","гуран","купа","ирга","круг","кан","щи","пища","парик","угар","пук","игра","арк","щука","рука","кипа","урна","руина","круп","кун","рагу","пикан","карп","крупа","пращ","щуп","пращник","пурин","ар","пар","пика","кунг","акр","пир","рак","паук","руна","пани","куга","па","ринг","кран","куща","урина"],"ковроделка":["докер","кар","кора","вал","веда","родео","око","ладо","ор","вред","колодка","ад","королева","клевок","век","ледок","дрова","род","вор","вделка","дрек","кедровка","лорд","кока","рок","ода","лад","верк","корова","едок","декор","дело","кок","вклад","околка","овод","лов","древо","ковка","окорка","ореол","креол","кал","дверка","орок","лавр","лев","лор","орк","ров","древко","раколов","овал","лар","кварк","оковка","вокал","короед","двор","девка","лак","вера","кол","еда","лерка","ков","веко","водка","до","арк","ковродел","дар","дека","кедр","одр","дек","волк","кредо","кода","каре","корд","краков","лек","колода","дрок","окрол","кодла","дока","окова","код","корка","дева","ар","рол","вол","акр","клад","кадр","ваер","клок","вода","дол","рак","редова","клерк","корда","колер","река","квакер","аккорд","колок","коровка","док","оклад","волок","орда","дора","лодка","ре","левак","креолка","реал","вар","кров","кокор"],"тундрянка":["уран","кар","тур","кура","ад","канун","тундра","крат","курд","дан","туна","ряд","дутар","труд","тун","урка","акт","куна","яд","ант","тукан","туя","кан","нард","карт","кант","ярд","турка","рудяк","кат","наряд","аут","арк","рука","якут","урна","кун","куда","дар","рант","яр","руда","кнут","удар","раут","раунд","натр","дурак","тура","рута","як","ар","курант","акр","кадр","танк","даур","ярутка","дура","рак","руна","утка","нут","трак","курта","ярка","кран","дукат"],"дворянство":["дот","орс","отвод","ор","соня","тон","сор","род","вор","дно","ряд","рост","нос","дояр","ворс","овод","донор","сотня","яд","ядро","остов","ярд","соя","ров","тоня","двор","яс","рондо","норд","ост","орт","торс","до","родос","торос","рядно","створ","яр","одр","ввод","стон","родство","рот","явор","ворот","отряд","дворня","дорн","сон","осот","норов","яство","ворон","относ","трос","трон","свод","донос","родня","сорт"],"выработка":["октава","арат","кар","кора","карта","бра","травка","боа","кобра","рывок","карат","втора","отрава","обкат","ток","авар","бок","товар","ор","тыква","крат","тора","обрат","товарка","вор","карты","акробат","трава","рок","бар","врата","варка","батыр","тако","ботва","рота","арба","акт","квота","орава","братва","борт","барк","ковы","карт","аорта","кроат","орк","ров","рыбак","бот","трок","вата","арбат","обтравка","отара","кат","брак","орт","кот","ков","арк","тавр","арык","барка","арабы","работка","браток","аборт","брокат","отвар","автокар","араб","рык","арак","табор","бык","рот","табак","рыба","ар","такыр","ватка","работа","акр","выборка","рвота","кара","торк","рыбка","выбор","отрыв","барак","краб","быт","крот","брат","рак","бровка","рака","раба","раб","батрак","тавро","арка","трак","обрыв","автор","авто","корт","бора","торба","вар","бак","отава","роба","кров"],"рутинность":["трость","стрит","орс","нить","утор","тост","тур","торит","ор","тут","тон","русин","сор","торт","сито","рис","трио","рост","нос","утро","трус","си","тун","ось","урон","трот","турин","суть","нутро","тирс","тиун","тритон","синьор","отит","ост","орт","торс","турист","ус","остит","нотис","стон","титр","рот","ртуть","суннит","нониус","руст","сон","ситро","тир","тутор","трос","тис","нут","ость","тонус","унион","ион","остин","русь","трон","сорит","синь","сорт"],"камерунка":["мура","уран","кар","камера","рана","муар","кума","рема","кура","марена","мурена","амур","крен","кум","ум","манера","немка","урка","куна","манка","карма","кан","анкер","мана","рама","мера","мена","арк","рука","урна","кун","мак","марка","аура","наука","мука","мрак","крем","каре","арена","креманка","арак","кунак","рамка","накра","ар","акр","манер","кара","карман","нукер","арека","рак","руна","рака","река","кенарка","арка","кукан","мекка","камка","кран","мерка","керн","ре","аркан","нерка","мара","ранка","маран"],"легковушка":["вал","гул","вогулка","увал","кеш","луковка","вогул","шов","шлаг","шок","клевок","шоу","век","угол","кукла","кулеш","укол","кока","шуга","ловушка","кок","шаг","лов","кулак","клуша","ковка","вешало","кал","главк","агул","лев","волга","левша","овал","ошва","вокал","ковш","лак","аул","кол","лука","ашуг","вега","ков","веко","лаг","улов","куш","гол","волк","кошка","шелковка","лек","кукша","уловка","луг","вешка","школа","шкало","вол","клок","лошак","куга","лог","кушак","ушко","левак","шлак","го","лук","шквал"],"пластеин":["тесина","стела","пан","спина","аист","линт","петин","сет","теин","липа","сени","аил","ас","тени","селин","лист","ласт","псина","лес","сенат","тина","стен","пина","тал","пенис","план","пена","сиена","си","слип","леса","сан","ант","наст","пас","плена","спинет","пила","сани","спил","стена","плита","стан","сила","сатин","ил","налеп","плен","иена","синап","степ","пенал","сплетни","тлен","пат","лента","настил","сена","пани","тис","тип","плат","талес","пинта","па","сип","лесина","пест","плис","лапти","пенс","анис","силен","сплин","лиса","апис","лепта"],"совнарком":["романс","норка","кар","роса","кора","орс","аксон","кома","нома","око","сновка","ор","ас","коса","омар","сор","вор","осман","оскар","морока","нрав","масон","окно","рок","корма","смоква","корова","нос","корона","совок","сома","мор","ворс","сом","сорока","сван","сан","орок","крона","нора","нарком","кан","сноровка","коран","орк","ров","смак","ром","свора","рамс","норма","скарн","воск","носок","ков","арк","соковар","мак","вона","мрак","скорм","ком","мавр","основа","срам","срок","манок","оса","окрас","марс","ворона","роман","окова","ар","нок","сонм","акр","корн","сон","морс","кон","сок","осока","оркан","норов","рак","амвон","ворон","корм","морок","комар","кран","ом","сова","вар","квас","рона","воронка","насморк","кров","совка"],"поддувание":["певун","иод","пан","веда","надув","упад","ад","вино","увод","дуда","дина","невод","наддув","аденоид","дан","дно","ода","диво","диод","пина","пена","напев","подвид","овин","анод","анид","удод","дед","еда","видео","пион","ведун","до","вид","пиво","пуд","вона","ива","ендова","иена","депо","подина","дева","овен","упование","девон","вода","иуда","удав","нева","пани","воин","па","пони","вено","ион","дедина","панов","вина","нива","диван"],"пустырник":["спутник","притык","пуск","кипу","тур","сын","кит","русин","тик","прутик","крит","спурт","пунктир","рис","сурик","ик","икс","сырт","скрип","скип","трус","си","тун","пик","скуп","струп","ринк","сутки","тын","прусик","трусик","турин","куст","икры","трип","стук","суп","скит","тирс","прут","сырник","спринт","тиун","турки","тупик","пук","курс","ус","риск","спрут","путник","круп","кун","кнут","пирс","сыр","рык","унты","пурин","писк","прус","путы","усик","пурист","пискун","стык","турник","труп","руст","тир","пир","тис","тип","нут","пункт","сип","типун","прикус","трусы","рипус","пырник","спирт","супник","супин","сук","иск","куприт"],"гидростат":["гарт","роса","стрит","дот","орс","иод","гидра","истод","аист","сидр","гид","тост","траст","сатир","торит","ор","ас","ад","сирота","гора","рог","сор","торт","торг","сито","тора","род","рис","радист","трио","ода","рост","гит","рота","артист","тигр","си","тарист","трот","статор","дрога","ирга","триод","гидрат","сад","торги","трог","тога","тирс","гоист","старт","отит","ост","артос","орт","торс","аорист","до","игра","дог","ситар","остит","гост","иго","дар","одр","даос","тат","итог","оса","стог","титр","рот","ар","град","гастрит","саго","грот","стадо","ситро","тир","ирод","гад","арго","трос","тис","триас","сард","радио","орда","дора","сиг","год","го","сорит","раис","сода","сорт"],"минотавр":["мирта","нома","миро","втора","митра","анри","вира","товар","ор","вино","манто","ми","март","тон","омар","тора","вор","трио","нрав","мот","тина","мор","рота","тмин","мат","иман","овин","ант","нора","том","минор","ирма","ров","норматив","ром","мина","томан","норма","орт","мир","тавр","рант","вона","ива","нота","отвар","ватин","мавр","мотив","трином","натр","ратин","рот","роман","ар","винт","рвота","атом","мирон","мирт","мари","тир","твин","амвон","воин","тавро","ритм","тиран","мант","ион","автор","трон","авто","вина","нива","ом","вар","рона","инвар"],"флибустьер":["бьеф","брест","сет","сильф","туес","тур","бес","утиль","бисер","блеф","лист","рис","буфет","лес","бит","суфле","сель","ибер","фес","футер","трус","си","ребус","стер","бур","туер","буер","риф","бел","турель","сеть","тиф","суть","луб","билет","бустер","лесть","фильер","тирс","тире","силь","стиль","рутил","рельс","флирт","ус","ил","ерь","улит","бель","литр","трисель","тулес","рулет","рубль","блистер","ель","сруб","селфи","туф","устье","руст","тир","брус","буерист","тис","серб","лифт","трель","бурт","фут","туфли","стильб","стул","русь","филе","ре","флебит","буфер","лиф","силур","фильтр","руль","бурсит","литер","бут","фетр"],"тюрчанка":["арат","юнак","кар","рана","карта","карат","чакан","крат","каюр","анчар","чан","каюта","акт","чара","ант","арча","кан","карт","кант","кат","тюк","арк","таран","тачка","рант","канат","ткач","накат","натр","арак","тюрк","накра","ар","юра","кача","акр","танк","кара","юр","чарка","акант","трюкач","рак","рака","арка","трюк","трак","ют","нарта","ню","кран","чакра","аркан","ранка","юрта"],"лоббистка":["саиб","скоба","колит","илот","баски","боа","икота","аист","киот","толк","блат","обкат","ток","бал","тоска","аил","бок","ас","било","боксит","кит","сток","коса","лист","тик","кислота","сито","лоббист","ласт","облик","лаки","бит","исток","ик","икс","кила","бокс","оскал","тал","тако","си","акт","боб","солка","сикл","блок","кал","биток","бабки","толки","бикс","киса","бола","колба","лик","соли","бот","стилка","лобби","листок","скит","столб","скат","лак","кил","сабо","бас","кол","бокал","кат","ост","кот","бита","сила","скот","ботик","блик","талиб","болт","ил","сало","такси","кабил","оса","лиска","киста","лоб","клот","столик","баск","ослик","бобик","столбик","балок","скол","сотка","тол","сок","кило","лот","талик","скало","басок","тис","слиток","табло","кости","литка","силок","лоск","лобик","салки","стол","слот","скатол","ластик","бак","иск","лиса"],"морзянка":["закром","норка","кар","кора","кома","армяк","нома","мазок","ор","наркоз","омар","раз","закон","рок","корма","моряк","оаз","мор","знак","зарок","коза","яма","знамя","моряна","зоря","крона","нора","нарком","кан","коран","орк","ром","норма","арк","мак","яр","мрак","разок","ком","манок","зона","роман","ямка","як","ар","нок","замор","акр","корн","роза","кон","замок","оркан","рак","ярок","корм","маяк","комар","ярка","кран","ом","анзор","рона","заря"],"экспедитор":["докер","скипетр","проект","песо","эсер","экер","дот","орс","иод","истод","пот","киот","сидр","сет","эрстед","ток","треск","перо","периост","ор","строп","предок","порт","диктор","дети","кит","осек","сток","питер","тик","сектор","крит","оптик","сор","поэт","сито","род","рис","дрек","трио","рок","септик","исток","ик","рост","сэр","едок","декор","икс","тодес","потир","креп","экспорт","присед","скрип","спикер","прок","спектр","деспот","скип","си","подсек","пик","стер","скирд","серп","спорт","триод","предки","покер","пикет","диоптр","орк","трип","редис","пек","дротик","трок","скит","тирс","тире","портик","просек","поиск","ост","протеид","приток","орт","кот","торс","тэк","перст","сеид","до","риск","скот","стек","копир","песок","диск","корсет","кредит","эрот","кедр","одр","репс","дек","кредо","пестик","перс","кисет","прекос","тропик","опт","корд","седок","депо","пирс","срок","деист","дрок","степ","пэр","портки","эдикт","троп","скоп","пике","рот","рдест","пески","скепт","персик","отсек","оксид","писк","код","кепи","спор","рэкет","рэп","ротик","пост","депорт","торк","спид","ситро","тир","сок","ирод","пир","серко","крот","топ","эпос","трос","тис","тип","сироп","крест","эксперт","док","треп","сип","кости","пест","ре","копт","топик","трико","корт","спирт","период","сорит","иск","стокер","трек","эскорт","сорт"],"автогигант":["гигант","вагина","таган","нога","гитов","вагант","агат","титан","вино","вагин","тон","гитан","гавот","тина","гит","гонт","гонг","ватт","овин","ант","тога","гон","вата","отит","иго","тата","виг","вона","ива","нота","агнат","ватин","тат","ванта","итог","ногата","вага","отвага","тавот","авгит","винт","твин","вагон","воин","нагота","гага","гитана","гагат","ион","авто","танго","вина","нива","го","отава"],"полярник":["полк","инок","кляп","клир","линкор","ор","ляп","ля","пинок","рок","ик","прикол","прок","лори","пик","янки","ринк","клон","пряник","кино","клоп","лор","лик","орк","пикон","копия","кил","ял","кол","пион","липняк","копир","яр","ил","пилон","нолик","клип","як","нок","рол","корн","ялик","кон","кило","пир","ярок","поля","нория","пони","ион","пол","поляк","ролик"],"константа":["аксон","тост","ток","тонна","тоска","станок","ас","сток","коса","тон","анонс","нанка","нос","канон","нотка","тако","акт","такса","кантон","сан","ант","татка","осанна","наст","кан","кант","такт","соната","скат","откат","сонант","кат","ост","стакан","кот","стан","скот","тата","канат","нота","накат","тат","оса","стон","нанос","нона","нок","танк","сотка","сон","кон","сок","акант","астат","каста","осака","осанка","канна"],"боливийка":["вал","вой","бай","вика","боа","вилок","бал","калий","аил","бок","било","облик","лаки","ик","кила","бивак","кайло","лов","вобла","блок","кал","бола","колба","лик","овал","вокал","лак","кил","кол","бокал","ков","обливка","алиби","блик","лай","ил","ива","олива","волк","валик","бой","кабил","оливка","кий","виола","лоб","вол","балок","обвал","вабик","кило","обивка","лобик","вилка","бак"],"сортимент":["мент","стрит","тест","орс","миро","сет","теин","тост","место","торит","мост","сени","сено","ор","тени","ми","тон","ремонт","метро","сор","торт","сито","рис","трио","мот","рост","нос","стен","тент","мор","трест","сом","тмин","си","стер","метрит","трот","трен","меринос","сонет","сирен","термит","том","минор","монстр","тирс","тире","ром","осетин","термист","тритон","отит","ост","орт","номер","торс","мир","остит","семит","тенор","енот","нотис","смотр","трином","монист","стон","титр","монтре","рот","триест","ирмос","сонм","метр","мирон","мирт","тостер","сон","ситро","морс","тир","тесто","трос","тис","термин","термос","ритм","стерин","море","остеит","ион","остин","мерин","трон","теист","ре","ом","мотет","сорит","сотерн","тотем","мистер","сорт"],"повстание":["весна","песо","свита","тесина","пан","оспа","спина","пот","аист","петин","сет","теин","сапонит","васин","вес","сени","сено","ас","вино","тени","тон","постав","сито","псина","сенат","сев","тина","нос","стен","пина","пенис","посев","вепс","пена","напев","сиена","си","сват","сван","овин","сан","ант","наст","сонет","сноп","сопа","пас","питон","навес","осетин","спинет","вест","сани","сипота","стена","ост","пион","стопа","стан","топание","енот","пиво","вона","сатин","ива","нотис","нота","иена","навет","синап","свет","вис","ватин","опт","оса","степ","стон","повет","пат","осина","синева","винт","оспина","отвес","вето","овен","пост","навис","сон","сена","твин","топ","нева","пани","воин","тис","тип","пинта","повеса","па","сип","пони","совет","вено","ион","остин","пистон","понт","пест","авто","панов","вина","нива","отсев","сова","пенс","анис","апис"],"провокатор":["ворота","повтор","пророк","окоп","пакт","кар","отрок","кора","поток","пот","втора","око","ток","товар","ор","порт","пак","парк","крат","тора","вор","тропа","крап","рок","корова","пора","повар","трап","ропот","топка","прок","тако","отпор","рота","опора","акт","квота","опак","ротор","орок","капор","право","карт","кроат","окот","орк","ров","вороток","топор","трок","копа","прокат","кат","опор","порка","орт","кот","ков","арк","тавр","рапорт","тропка","оратор","карп","отвар","опт","проток","троп","рот","парок","рокот","окова","пат","ар","пар","акр","рвота","ворот","торк","крот","рак","прорва","порок","топ","опорок","тавро","провар","трак","па","капот","автор","ропак","авто","копт","корт","поворот","вар","кров","протока"],"велогонщик":["инок","говно","лещ","око","вилок","логик","вино","щегол","век","окно","ик","локон","лов","кегли","головщик","клещи","кинолог","колено","клон","овин","кино","голик","ген","лев","щи","новик","лик","гон","овощи","лоно","огнище","кил","кол","ков","веко","огниво","конго","иго","виг","гол","ил","нолик","волк","геликон","клещ","овощ","лек","огневик","гонщик","нок","гнев","вол","овен","кон","кило","веник","воин","легион","олеин","логовище","волок","лог","вено","ион","щелк","го","щенок","венок"],"астероид":["роса","дот","орс","иод","истод","аист","сидр","сет","сатир","ор","ас","ад","сирота","дети","сор","сито","тора","род","рис","радист","трио","ода","рост","тодес","арест","рота","си","стер","триод","сад","среда","редис","тирс","тире","еда","ост","артос","орт","торс","сеид","аорист","до","ситар","дар","одр","даос","деист","оса","сера","рот","рдест","ар","диета","стадо","ситро","тир","ирод","сидерат","трос","тис","триас","сард","радио","орда","адрес","дора","ре","сорит","раис","сода","сорт"],"проминка":["прима","норка","кар","кора","инок","маниок","камин","кома","нома","миро","пан","капрон","анри","парник","памир","панк","ор","ми","кина","пак","парк","омар","пинок","примак","ампир","крап","рок","корма","ик","пора","икра","кармин","мор","паром","пина","прок","минорка","пари","пик","каин","пиар","пим","ринк","опак","иман","капор","кино","крона","нора","нарком","кан","минор","коран","орк","ирма","икона","пикон","копа","ром","мирок","мина","парик","норма","порка","пион","маки","мир","арк","кипа","копир","мак","промин","пикан","мрак","карп","опарник","ком","манок","парок","роман","ар","пар","капонир","нок","пика","напор","акр","мирон","корн","мари","кон","оркан","пир","рак","пани","поимка","корм","па","пони","комар","ион","кран","ропак","ом","коми","помин","копна","микрон","рона"],"каллиграф":["кар","клир","гриф","фиалка","аил","фал","кагал","граф","галл","лаки","ик","фалл","риал","кила","икра","крага","флик","кал","ирга","флаг","риф","лик","фа","гифа","лар","фила","кифара","лак","кил","калиф","фиал","фиг","рафик","фрак","игра","арк","лаг","карга","акрил","галка","агар","график","арфа","ил","лига","фига","калла","арак","игла","ар","акр","ралли","факир","кара","фара","рак","рака","лафа","арка","африка","лира","графа","лиф","графика"],"отгнивание":["витание","нога","теин","гиви","гитов","тонна","вино","тени","вагин","тон","гитан","гавот","тонина","тина","гит","гонт","овин","ант","нагон","ген","танин","тога","гон","наитие","вега","автоген","нонет","иго","енот","антиген","виг","вона","ива","нота","иена","навет","ватин","гиена","итог","нега","авгит","нона","гнев","винт","вето","овен","твин","нева","вагон","воин","анион","вено","ион","наин","авто","танго","вина","нива","го","неон","гонтина","агент","негатив"],"марказит":["тазик","арат","мирта","риза","кар","карта","мазик","мазар","карат","заика","митра","маркиз","ми","кит","март","тик","раз","крит","крат","ик","икра","акт","таз","мат","заимка","карма","закат","карт","ирма","камаз","криз","рама","кат","маки","мир","азиат","ракита","арк","маркиза","мак","марка","мрак","арак","рамка","ар","акр","кара","мирт","мари","тир","рак","тиара","рака","мирза","арка","матка","ритм","трак","караим","мара","азарт"],"подсечка":["песо","доска","оспа","посад","сачок","сечка","ас","ад","осек","коса","пак","секач","ода","едок","сопка","дочка","чек","подсек","подсека","саке","садок","опак","сад","сопа","подсак","пас","час","чадо","пек","копа","скопа","еда","осечка","до","почка","часок","песок","дека","дек","печка","кода","даос","спад","седок","депо","оса","дока","скоп","код","паск","сок","чека","косач","док","па","опека","сода"],"каретник":["кар","теин","кератин","анри","тени","кит","кина","тик","крит","крик","рента","крат","крен","ик","тина","икра","текинка","ретина","каин","акт","ринк","нитка","трен","ант","кан","карт","анкер","кант","танкер","тире","кат","кета","арк","рант","крикет","иена","каре","натр","ратин","кирка","кика","ар","акр","танк","катер","катрен","тир","рак","река","трак","кринка","тиран","кран","керн","нектар","ре","ратник","каик","кантри","нерка","кретин","краник","трек","ранет"],"проскачка":["кокс","кар","роса","кора","орс","рапа","скачка","оспа","опаска","корча","скачок","ор","сачок","ас","коса","пак","парк","сор","оскар","крап","порча","кока","рок","раса","скок","сопка","пора","кок","качка","прок","какао","сапа","чара","прачка","рапс","опак","арча","капор","сопа","парча","пас","капок","орк","час","краска","прокачка","пара","спора","опара","копа","раскопка","скопа","порка","арк","почка","часок","арап","покраска","карп","краса","каркас","срок","оса","окрас","скоп","каска","арак","крачка","парок","корка","скрап","ар","парочка","скак","пар","спор","кача","акр","кара","паск","сок","чарка","окраска","сапка","рак","корсак","пачка","рака","арка","косач","па","ропак","осака","кочка","чакра","парс"],"шпротина":["притон","шина","пан","пот","анри","шар","ор","порт","шпон","тон","ши","тора","тропа","ришта","трио","шпрот","тина","пора","трап","потир","пина","широта","рота","пари","пиар","атропин","ниша","ант","нора","питон","трип","тапир","шпинат","шип","пион","орт","нарпит","патрон","пират","рант","шпион","нота","шпора","опт","ноша","аршин","троп","натр","ратин","рот","пат","ар","пар","напор","поташ","шпор","тир","шпрота","пир","штора","топ","пани","тип","пинта","шпат","тиран","па","пони","ион","понт","трон","пшат","апрош","транш","рона","шрот"],"авиадесант":["весна","свита","тесина","веда","аист","сет","теин","васин","вес","сени","ас","ад","тени","дети","дина","насад","адат","дан","сенат","сев","тина","стен","детина","сиена","стенд","си","сват","сван","сан","анид","ант","аванс","сад","наст","дата","навес","вата","вест","детва","еда","сани","стена","саван","стан","твид","сеид","вид","седина","сатин","ива","иена","навет","свет","сатана","вис","ватин","ванта","деист","дева","синева","винт","диета","навис","сена","твин","нева","сдавание","тис","сватание","вина","диана","нива","десант","диван","десна","анис"],"полиритмия":["илот","миро","пот","миопия","мяло","ор","ляп","порт","ми","ля","трио","мот","мол","лом","потир","мор","пилот","моляр","лори","пим","лор","том","пирит","трип","тромп","ром","ял","прямило","имя","орт","мир","тля","яр","ил","тимол","лимит","литр","олимп","опт","иприт","троп","рот","рол","тол","мирт","тир","пир","лот","топ","поля","тип","ритм","миля","пол","импорт","ом","лития","плот"],"библиотека":["колит","илот","боа","икота","киот","толк","блат","обкат","ток","биолит","бал","аил","бок","било","кит","тик","облик","лаки","бит","ик","кила","тал","тако","обилие","акт","боб","блок","отбелка","кал","биток","бабки","толки","бел","бола","битки","колба","лик","билет","бот","лобби","лак","кил","кеб","кол","бокал","кат","кот","колет","лето","бита","кета","ботик","алиби","блик","леток","телок","тело","талиб","болт","ил","кабил","билетик","лек","белок","лоб","клот","обет","бета","бобик","белка","белки","балок","тол","балет","кило","лот","талик","табло","литка","бек","лобик","бак"],"платинка":["пакт","клапан","пан","линт","липа","капитал","панк","аил","плитка","плакат","калин","кит","кина","пак","тик","пиала","лаки","ик","тина","кила","накал","пина","тал","план","пик","каин","акт","калина","лапа","нитка","кал","ант","кан","платан","кант","лик","клан","алан","лапник","канал","планка","лак","кил","пила","ланка","кат","липка","плита","платина","кипа","канат","пикан","ил","клип","плата","накат","пилка","лиана","латник","паника","палка","палатин","калан","пат","пика","танк","апилак","акант","талик","ланита","пани","лата","тип","лапка","плат","патан","пинта","па","литка","латинка","лапина","лапти","лапта","капитан","тапка","тапки","каптан"],"русистика":["икарус","сура","сити","кар","сатирик","аист","сусак","ирис","сакс","тасс","сатир","тур","кура","ас","кит","тик","крит","крат","искра","рис","сурик","ик","икс","рустика","икра","трус","си","урка","акт","сутки","трусик","куст","стирка","киса","карт","карст","стук","скит","тирс","турка","скат","кат","аут","старик","турки","русак","курс","арк","рука","ус","риск","ситар","трасс","кассир","расист","раут","такси","раус","русист","киста","тура","рута","ар","усик","акр","руст","тир","сука","рак","сириус","утка","тис","триас","кутас","искус","трак","курта","уста","риска","скаут","систр","тиски","раис","сук","иск","страус"],"чалмоносец":["смалец","намол","нома","соло","сено","цена","ас","осмол","салон","мелос","осман","лес","масон","мосол","солома","мол","лом","нос","село","чан","сома","смола","сом","леса","моча","слом","сан","чело","час","сема","лоно","мена","самец","солнце","ленч","чал","лоцман","меч","мочало","сало","лаосец","мел","малец","оса","сочлен","солонец","сонм","сон","сена","сланец","омела","сцена","ленца","член","счал","ом","слон","масло","смена"],"буртование":["табу","вертун","турбина","бритва","уран","буран","бра","верба","отрубание","боа","бура","утор","втора","теин","буратино","анри","тур","бурова","вира","товар","ор","вино","тени","униат","тон","треба","бинт","рента","тора","табун","обрат","вор","трио","нрав","туна","бит","барин","бар","битва","нерв","тина","ибер","увар","труба","утро","бревно","ботва","ретина","рота","тун","урон","утроба","унтер","трибун","турне","бур","овин","борт","трен","ант","туер","турин","буер","нора","неврит","ров","бурат","бот","бунт","врун","нутро","трибуна","тире","тиун","вера","убор","танбур","аут","орт","вруб","бита","тавр","тенор","триба","урна","руина","енот","барон","бурав","рант","вона","аборт","ива","отбив","нота","иена","навет","отвар","барит","раут","ватин","батон","орбита","натр","табор","ратин","тура","рот","набор","бутон","рута","обет","бета","ар","винт","абвер","отруби","вето","рвота","торбан","овен","ваер","баронет","бетон","тир","твин","брат","руна","нева","рубин","воин","баритон","раб","тавро","бона","нут","тиран","бурт","бант","вено","ион","автор","рутина","трон","авто","ре","вина","бора","нива","торба","бон","бенуар","вар","врубание","бут","урина","рона","инвар","туба","обувание","роба","наиб","ранет"],"крановщик":["норка","кар","кора","инок","вика","окрик","анри","вира","ор","вино","кина","кровища","крик","вор","нрав","кока","рок","ик","кок","икра","ковка","каин","коврик","ринк","овин","роща","кино","крона","нора","кан","враки","щи","новик","коран","орк","кивок","ров","икона","кварк","варщик","иконка","вощина","ков","арк","вона","ива","краков","кокаин","кирка","корка","кика","ар","кровинка","нок","акр","коринка","ровик","корн","кон","оркан","рак","воин","кринка","конка","ион","кран","вина","нива","каик","вар","кирова","краник","рона","инвар","кров"],"парусность":["парус","сура","струна","уран","роса","орс","пан","оспа","пот","утор","нарост","сатурн","тасс","тур","топь","супонь","ор","строп","ас","порт","пастор","тон","сор","спурт","тора","рать","тропа","сорус","анус","туна","соус","рост","рань","ступор","пора","трап","нос","пасть","снасть","утро","рота","трус","тун","ось","урон","струп","рапс","сан","спорт","ант","наст","нора","сноп","сопа","пас","суть","нутро","спора","суп","ступа","прут","парность","аут","ост","спас","снос","артос","орт","торс","стопа","стан","псарь","ус","станс","спрут","урна","патрон","трасс","рант","путь","насос","нота","раут","опт","раус","оса","стон","троп","натр","тура","рот","рута","пат","прус","ар","пар","спор","напор","пост","труп","руст","сон","носарь","руна","ссора","опус","топ","трос","нут","ость","тонус","па","уста","русь","понт","упор","трон","пасс","спрос","сурна","турпан","сосна","рона","стропа","страус","парс","транс","сорт","прусс","пуант"],"оргкомитет":["отрок","омег","миро","киот","око","отток","ток","торит","ор","ми","кит","тик","рог","крит","метро","торт","торг","морг","трио","мот","рок","горе","ик","гит","мор","тигр","грек","моток","метрит","трот","орок","термит","грим","торги","гром","том","трог","окот","орк","трок","тире","ром","откорм","мирок","отит","орт","кот","мир","греки","гетто","иго","крем","ком","итог","титр","томик","рот","горком","рокот","отрог","миг","метр","киото","ротик","мирт","торк","грот","комитет","игрек","тир","гомик","крот","корм","ритм","море","мотор","морок","ре","отроек","трико","корт","ом","мотет","го","октет","коми","игрок","тотем","ктитор","трек"],"платочек":["пакт","полк","тепло","пот","толк","ток","пак","пакет","топка","чек","тал","тако","почта","акт","опак","кал","чело","клоп","толпа","толкач","пек","платок","копа","лак","отпал","кол","кат","кетч","кот","колет","лето","кета","почка","леток","телок","точка","тело","чал","копал","ткач","поле","печка","опт","лек","плечо","клот","пат","течка","плач","пчела","тол","опал","лот","плато","полка","топ","чека","плат","пекло","пола","па","капот","чета","копт","пол","лепка","опека","плот","лепта"],"обтирание":["бра","боа","теин","отбирание","анри","ор","тени","тон","треба","бинт","рента","тора","обрат","трио","бит","барин","бар","тина","ибер","ретина","рота","борт","трен","ант","нора","бот","тире","наитие","орт","бита","тенор","триба","енот","барон","рант","аборт","нота","иена","барит","батон","орбита","натр","табор","ратин","рот","набор","обет","бета","ар","торбан","баронет","бетон","тир","брат","ринит","баритон","раб","бона","тиран","бант","ион","трон","ре","бора","торба","бон","отирание","рона","роба","наиб","обитание","ранет"],"надхвостье":["весна","хаос","дот","ставень","день","веда","сет","вес","сено","ас","ад","весь","тень","тон","вех","невод","дан","дно","осень","сенат","ода","сев","снедь","дань","нос","стен","тодес","хост","стенд","сват","ось","хан","сван","анод","хвост","сан","ант","сад","досев","ханство","наст","сонет","вонь","досье","сеть","сень","навес","становье","давность","вест","детва","еда","стена","ост","стан","до","вход","сход","енот","вона","водь","ендова","соха","нота","навет","свет","даос","оса","стон","навь","дева","отвес","хота","вето","овен","сон","стадо","девон","веха","вода","ход","сена","нева","техас","охват","весть","хон","ость","новь","совет","вено","вдох","всход","авто","хват","хна","десант","свод","отсев","сова","десна","сода","сноха"],"секундант":["сет","туес","аскет","нансук","ас","ад","канун","тесак","анус","дан","туна","сенат","кадет","секта","стен","стенд","тун","судак","саке","акт","куна","сан","ант","тукан","куст","сад","наст","кан","кант","стук","скат","дунст","кат","еда","аут","стена","стан","ненка","кета","детка","ус","стек","кун","куда","надкус","дека","декан","кнут","дек","скена","стенка","сетка","танк","стека","сука","сена","дуст","утка","кутас","нут","секунда","уста","суд","скаут","суета","десант","дукат","десна","сук"],"бульдозер":["удел","обдел","резь","ор","одул","обрез","род","лорд","дело","урод","бедро","ледоруб","узор","бур","зуд","блуд","буер","боль","бел","лор","луб","обед","зоб","дробь","друз","убор","бред","до","узел","дубль","дуб","удол","ерь","одр","дурь","роль","бель","брод","уезд","одурь","боулдер","рубль","лоб","ледобур","рол","ель","зуб","зло","дол","зубр","урез","дрель","ре","бордель","золь","руль","дуло"],"нитрование":["витрина","витание","втора","теин","анри","тонна","вира","товар","неврон","ор","вино","тени","тон","рента","тора","вор","тонина","трио","нрав","нерв","тина","ретина","рота","овин","трен","ант","нора","натрон","неврит","танин","ров","тире","наитие","вера","орт","нонет","тавр","тенор","енот","рант","вона","ива","нота","иена","навет","отвар","ватин","интерн","натр","ратин","рот","ар","нона","винт","вето","рвота","овен","ваер","тир","твин","ринит","нева","воин","втирание","тавро","иврит","тиран","анион","вено","ион","автор","наин","трон","авто","ре","вина","нива","неон","вар","отирание","рона","инвар","ранет"],"самокатка":["кокс","кома","ток","мост","тоска","ас","смотка","сток","коса","мот","кока","скок","кок","сома","сом","тако","какао","акт","такса","атака","мат","мотка","макака","том","самка","скат","смак","кат","ост","кот","скот","скатка","мак","касатка","ком","камса","оса","каска","самокат","скак","саамка","каток","атом","сотка","сок","саам","маска","мастак","матка","астма","камка","каста","осака","ом"],"сопельщик":["песо","полк","колье","лещ","щель","осек","соль","лес","лесок","ик","сель","икс","село","спель","клещи","скип","си","щипок","слип","ось","пик","сикл","склеп","лось","клоп","щи","опись","лик","плеск","соли","сопель","пек","кил","силь","кол","спил","поиск","сельпо","спилок","лепщик","полис","песок","ил","клип","клипс","поле","слепок","клещ","кисель","лек","скоп","пике","пески","писк","кепи","ослик","ель","скопище","скол","сок","кило","окись","пекло","сопли","сип","киль","силок","лоск","пол","щелк","плис","иск","окисел","копь"],"отрадность":["трость","роса","дот","орс","ротонда","нарост","тост","траст","ор","ас","ад","тон","народ","сор","торт","тора","род","рать","дан","дно","ода","рост","рань","острота","дань","нос","донор","рота","ось","трот","статор","анод","сан","ант","сад","наст","нора","нард","стать","рондо","старт","норд","ост","артос","орт","торс","стан","до","родос","торос","радон","сторона","дар","радость","рант","одр","нота","даос","тат","оса","стон","натр","рот","ар","дорн","сон","стадо","осот","носарь","относ","трос","сард","ость","орда","дора","тать","трон","рона","сода","донос","транс","сорт"],"экономист":["микст","оникс","инок","эконом","монисто","киот","мосток","око","ток","мост","мостик","ми","кит","сток","тон","сотник","эмо","тик","сито","тоник","окно","мот","исток","ик","икс","носик","нос","сом","тмин","си","моток","кино","том","окот","этимон","скит","ост","кот","тэк","носок","снимок","скот","эскимо","кимоно","нотис","москит","ком","монист","откос","стон","томик","онэксим","нок","сонм","киото","сон","кон","сок","осот","относ","тис","кости","ион","остин","ом","коми","иск","токсин","этнос"],"тамплиер":["прима","мирта","темп","липа","митра","памир","рема","аил","перл","ми","март","питер","ампир","риал","трап","прелат","ампер","тема","тал","пари","пиар","пим","репа","артем","мат","метил","ирма","трип","лар","талреп","тапир","талер","тире","пила","мера","примета","плита","мир","лепра","перила","пират","ил","литр","мел","пат","ар","пар","метр","мирт","мари","тир","пир","тип","плат","лира","ритм","треп","па","мета","литера","ре","метла","лапти","патер","реал","трал","литер","примат","лепта"],"прогалина":["нагар","рана","рапа","нога","пан","гран","липа","анри","аил","ор","ранг","пирог","гора","пирога","рог","гирло","пиала","опала","понг","риал","пора","орлан","пина","план","лори","пари","раина","налог","пиар","лапа","лопари","ирга","нора","лор","алан","пара","лар","гон","нигрол","опара","пила","пианола","пион","горн","игра","ангар","лаг","иго","аарон","арап","гол","агар","ил","пригон","пилон","лига","онагр","лиана","пароли","игла","галоп","ар","пар","орган","рол","горлан","напор","опал","аргон","пир","горин","пани","арго","лира","пола","па","лог","ринг","пони","ион","глина","пол","аналог","лапина","го","рона"],"раздутость":["сура","трость","роса","страз","дот","орс","утор","саз","азот","тост","траст","тур","сударь","ор","ас","ад","тут","раз","сор","торт","тора","род","рать","ода","рост","дутар","оаз","урод","труд","утро","рота","трус","ось","узор","трот","статор","таз","зуд","сад","узость","суть","дурость","стать","друз","аут","старт","азу","ост","артос","орт","торс","доза","до","ус","дар","радость","руда","одр","удар","друза","дурь","даос","раут","раус","тат","одурь","оса","тута","тура","рот","ртуть","узда","зад","рута","азур","ар","аозт","зуда","даур","дура","руст","роза","стадо","дуст","туз","тутор","трос","сард","ость","уста","орда","дора","тать","русь","суд","дзот","задор","затор","сода","сорт"],"франциско":["норка","кар","роса","оникс","кора","инок","офис","орс","аксон","цска","анри","ор","ас","коса","кина","сор","кофр","софа","фирн","искра","рис","оскар","фарс","рок","ик","икс","носик","нос","икра","косица","фонарик","цифра","фоника","си","каин","осинка","соринка","ринк","фиаско","сан","кино","фикс","крона","киса","нора","риф","кан","коран","орк","фа","икона","крица","цинк","сани","рафик","скарн","фрак","форс","кница","арк","риск","франк","фора","рацион","финка","корица","санки","срок","оса","окрас","росинка","ар","фасон","нок","осина","акр","факир","корн","сон","кон","сок","оркан","рак","скиф","фон","цирк","ион","сифон","кран","риска","циан","фанк","раис","иск","анис","циркон","рона","факс"],"африканер":["кефир","иранка","кар","рана","анри","фраер","кина","крен","фирн","ик","икра","арника","раина","каин","ринк","кенаф","кафе","риф","кан","анкер","фа","кифара","карра","рафик","фрак","афера","арк","франк","арфа","иена","каре","финка","арена","арак","накра","ар","акр","факир","кара","фара","арека","рак","рака","река","арка","африка","кран","акание","керн","ре","фанк","неф","фанерка","аркан","нерка","ранка","фанера"],"пародонтоз":["дот","пан","пот","ротонда","азот","ор","ад","порт","тон","народ","раз","тора","род","тропа","подзор","дан","дно","ода","пора","трап","ропот","оаз","донор","отпор","рота","зонд","опора","таз","анод","ант","надзор","нора","нард","паз","дозор","топор","зонт","рондо","опор","норд","орт","протон","доза","до","позор","радон","затон","патрон","дар","рант","одр","нота","проза","опт","троп","натр","зона","озонатор","рот","зад","пат","ар","пар","напор","аозт","дорн","драп","роза","топ","порода","озон","па","запор","орда","дора","понт","трон","пардон","поза","дозатор","дзот","задор","анзор","затор","рона","топаз","отпад"],"ликтрос":["орс","колит","илот","клир","киот","толк","ток","ор","кит","сток","лист","тик","крит","сор","сито","рис","трио","стирол","рок","исток","ик","рост","икс","лори","си","сикл","толки","лор","ликтор","лик","орк","соли","листок","трок","скит","тирс","кил","кол","ост","орт","кот","торс","риск","скот","ил","литр","срок","кролист","рот","клот","столик","ослик","рол","скол","ротик","тол","торк","ситро","тир","сок","кило","лот","крот","трос","тис","слиток","клирос","кости","силок","лоск","трико","корт","стол","сорит","слот","иск","ролик","сорт"],"мерлушка":["мура","кар","муар","маклер","кума","улем","кеш","шар","рема","марш","акушер","шлем","кура","шрам","амур","кулеш","кум","ум","мул","шерл","клуша","урка","шулер","кал","шкура","улар","лар","лак","аул","мера","шарм","лука","шлам","лерка","мушка","решка","арк","рука","урал","куш","мак","мука","мрак","крем","каре","мел","лек","ар","акр","рак","мураш","река","шум","мерка","ре","лемур","шлак","реал","лук"],"остекление":["клиент","оникс","инок","колит","илот","линт","киот","сет","толк","теин","ток","стекло","сени","сено","тление","тени","селин","кит","осек","сток","тон","сотник","селенит","лист","тик","селение","сито","тоник","лесник","лес","лесок","исток","ик","соление","икс","носик","нос","стен","село","си","сикл","клон","толки","тесление","кино","сонет","летие","лик","соли","листок","скит","снеток","слоник","осетин","кил","телекс","нилот","кол","ост","кот","колет","лето","скот","стек","леток","телок","енот","тело","ил","нолик","нотис","кисет","лек","оленек","стон","телек","тлен","клот","отсек","склон","слоение","столик","ослик","нок","стекление","силон","скол","тол","скелет","скелетон","сон","кон","сок","кило","лот","тис","неолит","линкос","слиток","клеение","олеин","кости","ион","остин","силок","лоск","стол","селен","слон","слот","иск","силен","токсин","тесло","окисел"],"картавость":["октава","арат","трость","авоська","кар","роса","кора","карта","орс","травка","токарь","автократ","карат","втора","тост","отрава","ток","траст","авар","тоска","товар","ор","ас","сток","коса","кастор","кастрат","сор","торт","крат","карась","тора","товарка","вор","рать","оскар","трава","рок","рост","раса","кровь","вакса","врата","ворс","варка","тако","створка","рота","сват","ось","акт","квота","трот","статор","ватт","такса","орава","трата","татка","кровать","строка","карт","аорта","кроат","орк","ров","карст","такт","стать","трок","скат","вата","откат","свора","отара","кат","воск","старт","саква","ост","артос","орт","кот","торс","астра","ков","савка","арк","тракт","отставка","тавр","скот","тата","кость","створ","тасовка","отвар","косарь","автокар","костра","краса","тат","срок","оса","окрас","красота","арак","раскат","рот","тавот","ар","ватка","корь","акр","рвота","свара","сотка","кара","торк","сок","астат","крот","рак","сварка","ставка","рака","трос","тавро","арка","ость","трак","автор","тать","тварь","авто","каста","осака","корт","сова","старка","вар","квас","отава","кров","сорт","совка"],"голкипер":["полк","клир","перо","логик","ор","пирог","перл","рог","гирло","рок","горе","ик","прикол","креп","прок","кегли","лори","грек","пик","креол","голик","покер","клоп","лор","лик","орк","пек","кил","кол","греки","иго","копир","гол","ил","клип","поле","лек","пике","кепи","рол","игрек","кило","пир","колер","пекло","лог","клипер","ре","пол","го","игрок","горлик","ролик","горелки"],"экстремизм":["эсер","микст","экер","мизер","сет","треск","зет","ми","кит","тик","крит","миксер","рис","мэр","ик","мим","сэр","икс","си","стер","криз","скит","тирс","тире","мем","эмир","мир","тэк","риск","семит","стек","крем","кисет","эскиз","ремиз","эретизм","мэтр","метр","рэкет","теизм","мирт","тир","тис","зек","крест","ритм","тезис","ре","крез","мистер","иск","трек","срез","мэри"],"акробат":["арат","кар","кора","карта","бра","боа","кобра","карат","обкат","ток","бок","ор","крат","тора","обрат","рок","бар","тако","рота","арба","акт","борт","барк","карт","аорта","кроат","орк","бот","трок","арбат","отара","кат","брак","орт","кот","арк","барка","работка","браток","аборт","брокат","араб","арак","табор","рот","табак","ар","работа","акр","кара","торк","барак","краб","крот","брат","рак","рака","раба","раб","батрак","арка","трак","корт","бора","торба","бак","роба"],"паремейник":["прима","кар","камин","пан","анри","рейка","парник","памир","рема","панк","ми","кина","пак","пай","парк","капер","крен","примак","перина","пекан","ампир","крап","ик","ампер","икра","кармин","креп","пина","немка","край","пена","пари","пик","пенка","каин","пиар","пим","ринк","репа","рейн","иман","май","кан","рей","анкер","еремкин","ирма","рай","иней","репейник","пек","мера","мена","мина","парик","маки","майник","рений","мир","йеменка","арк","репей","кипа","мак","пикан","мрак","минреп","карп","иена","крем","каре","кий","кипрей","пике","кепи","ар","пар","пика","акр","манер","пение","репина","мари","преемник","пир","рак","пани","река","нерпа","па","мерин","кран","мерка","керн","прение","ре","иерей","кремний","нерка","репка"],"светокопия":["окоп","песо","поток","пот","киот","сет","око","ток","вес","свиток","кит","осек","сток","совик","тик","век","оптик","сито","восток","сев","септик","исток","ик","опоек","висок","икс","совок","пяток","посев","вепс","скип","остяки","си","пик","пикет","поясок","окот","остов","соя","покос","копия","пек","скит","осетия","севок","яс","сепия","вест","вотяки","воск","поиск","ост","остяк","кот","ков","веко","скот","виток","стек","песок","пиво","святки","свет","вис","пестик","кисет","стояк","опт","степ","откос","оптовик","скоп","пике","повет","пояс","пески","скепт","отсек","як","писк","кепи","свояк","отвес","киото","вето","пост","сок","осот","яство","топ","тис","тип","сип","совет","кости","пест","копт","топик","пивко","кисея","отсев","иск"],"разоритель":["риза","артроз","илот","азот","аил","резь","ор","зет","триоль","раз","тора","рать","ритор","отрез","трио","риал","триер","оаз","тал","лори","рота","таз","артель","релиз","лор","зал","лар","талер","тире","орт","триера","лето","зола","тело","ил","ерь","зритель","роль","литр","орарь","рот","ар","рол","ель","лазер","аозт","тол","толь","зло","риелтор","роза","тир","лот","ларь","лира","трель","литера","лоза","ре","золь","отель","тралер","реал","трал","альт","литер","затор"],"содержание":["дарение","роса","драже","орс","иод","джерси","динар","сидр","надир","анри","рдение","сени","джин","оседание","сено","ор","ас","орден","ад","народ","середа","дина","сор","жена","род","рис","родина","дан","дно","ода","рожа","держание","джинса","нос","дож","жир","рождение","дрожание","сиена","си","средина","нож","сеноед","одрина","сражение","анод","сан","анид","дежа","сад","дрена","сирен","нора","нард","жеода","дрожина","редан","ржание","жиронда","среда","редис","еда","сани","середина","норд","сеид","до","радон","серна","седина","дар","сирена","жанр","дренаж","одр","иена","даос","оса","роение","сера","ар","анероид","осина","осаждение","жарение","дорн","сон","ирод","сена","недра","жад","сард","радио","орда","адрес","ронжа","жар","ион","дора","ре","доение","жор","нереида","жердина","раис","десна","анис","синод","рона","сода"],"автосалон":["лотос","вал","лава","отлов","влас","соло","ас","салон","тон","ласт","волна","нос","лов","тал","сват","сван","сан","ант","аванс","наст","остов","алан","лото","овал","соната","лоно","вата","саван","ост","волос","стан","лавсан","талон","вона","нота","сало","основа","ванта","оса","столон","стон","атлас","ствол","слово","вол","тол","сон","волан","осот","лот","лата","относ","навал","салат","авто","слава","ласа","отвал","стол","сова","слон","слот","отава","автол"],"конформист":["микст","тифон","отрок","оникс","инок","офис","орс","монисто","миро","киот","мосток","око","ток","форинт","мост","мостик","ор","ми","кит","сток","тон","сотник","тик","крит","сор","сито","кофр","фирн","рис","тоник","трио","окно","мот","рок","офорт","исток","ик","рост","икс","носик","нос","мор","сом","тмин","си","моток","ринк","орок","торф","кино","фикс","риф","том","тиф","минор","окот","орк","орфист","монстр","осмотр","трок","скит","офит","тирс","ром","откорм","мирок","комфорт","форт","фотон","ост","орт","кот","торс","мир","носок","форс","снимок","торос","риск","скот","микрофон","кимоно","фот","нотис","скорм","москит","смотр","ком","срок","трином","монист","откос","стон","морфин","томик","рот","рокот","мориск","ирмос","фронт","нок","сонм","росток","киото","мирон","ротик","мирт","корн","торк","сон","ситро","морс","кон","тир","сок","монитор","осот","финт","крот","относ","фото","трос","тис","скиф","морф","фон","корм","миф","ритм","мотор","кости","морок","ион","остин","сифон","трон","трико","корт","ом","коми","сорит","фтор","иск","микрон","токсин","софит","сорт"],"бардачок":["кар","кора","бра","боа","кобра","дачка","корча","драка","бок","ор","ад","род","бочар","рок","ода","бар","рада","дочка","рокада","арба","чара","барк","арча","бочка","орк","чадо","дача","брак","даба","до","арк","барка","дар","одр","бардак","кода","брод","корд","араб","дрок","дока","арак","код","ар","карда","кача","акр","кадр","кара","барак","чарка","краб","рак","корда","рака","раба","раб","арка","док","орда","дора","бард","чакра","бора","чадра","бак","роба","бачок"],"темперация":["прима","мирта","ариец","темп","цитра","темпера","митра","репица","памир","рема","таец","тряпица","терем","ми","март","питер","ампир","мята","трап","ампер","тема","терапия","пари","пиар","пим","яма","репа","артем","мат","материя","ирма","типец","трип","трапеция","тапир","тире","партия","паяц","мера","примета","имя","рация","армия","ария","мир","терц","премия","пират","рея","цеп","яр","пат","меря","рецепт","ар","пар","темя","метр","партиец","мирт","мариец","мари","тир","пир","тип","ритм","треп","па","мета","армеец","птица","пята","ре","перец","патер","паремия","паря","примат"],"альпинист":["сити","нить","пан","спина","аист","линт","липа","аил","ас","лист","истина","ласт","псина","пианист","тина","пасть","пина","тал","план","си","слип","стлань","сан","ант","наст","пас","лань","пила","силь","сани","стиль","спил","плита","стан","сила","птиалин","сатин","ил","линь","сталь","синап","пат","настил","пани","тис","тип","плат","силин","пинта","па","сип","плис","лапти","анис","альт","сиаль","сплин","лиса","синь","апис"],"кармелит":["мирта","кар","маклер","клир","митра","рема","аил","малик","ми","кит","март","тик","крит","крат","лаки","тарелки","ик","риал","кила","икра","тема","тал","акт","артем","мат","кал","карт","метил","лик","ирма","лар","талер","тире","лак","кил","мера","кат","метлика","лерка","маки","реликт","мир","кета","макет","арк","акрил","мак","ил","климат","мрак","крем","каре","литр","мел","лек","ар","метр","акр","метрика","катер","мирт","мари","тир","талик","рак","река","лира","ритм","трак","мета","литка","литера","мерка","кларет","ре","метла","терлик","реал","трал","литер","материк","трек"],"терновник":["инок","вектор","киот","теин","ток","неврон","ор","веткин","вино","тени","кит","тон","тик","век","крит","виконт","крен","вор","тоник","трио","рок","нерв","ик","верк","конверт","ринк","овин","трен","кино","новик","орк","неврит","ров","невротик","вторник","трок","тире","конвент","орт","кот","ков","веко","нонет","тенор","виток","енот","норник","корвет","интерн","рот","нок","винт","вето","ротик","овен","ровик","корн","торк","кон","тир","крот","твин","веник","воин","вено","ион","трон","кивер","керн","ре","трико","корт","корнет","неон","кретин","венок","кретон","трек","кров"],"синекдоха":["хаос","оникс","инок","доска","иод","аксон","хадис","хасид","хек","сени","сено","океан","ас","ад","осек","коса","кина","дина","дан","дно","саенко","ода","осадки","ик","едок","икс","носик","нос","сиена","си","саке","каин","осинка","садок","хан","охание","анод","сан","анид","сад","кино","киса","сходка","кан","хаки","икона","еда","сани","кодеин","сеид","до","сход","индекс","седина","диск","дека","декан","дек","соха","иена","кода","даос","скена","седок","санки","оса","исход","дока","хина","оксид","код","нок","ходик","осина","сон","кон","сок","ход","сена","сиданко","хон","док","окание","ион","хна","садик","десна","ехидна","иск","анис","синод","сода","сноха"],"треуголка":["латук","кар","гарт","кора","горелка","гул","уторка","утор","толк","глотка","туарег","ток","тур","глот","ор","кура","гетра","гора","горка","грелка","рог","угол","торг","крат","тора","округ","укол","рок","горе","урок","гута","гаер","тал","утро","тако","рота","грек","урка","акт","кутора","креол","кал","круг","легат","туер","улар","агул","лор","карт","кроат","трог","орк","тога","лар","отгул","трок","талер","турка","лак","аул","угар","кол","лука","кат","аут","лерка","орт","кот","колет","округа","лето","кета","арк","рука","лаг","урал","леток","телок","укор","тело","рагу","гол","турок","локаут","каре","раут","лек","алеут","рулет","тура","рот","кагор","рута","клот","луг","лектор","ар","рол","акр","гектар","тол","катер","торк","грот","оракул","лот","крот","рулетка","рак","арго","уток","утка","колер","река","гурт","трак","курта","куга","лог","кларет","ре","корт","го","теург","реал","лук","трал","трек"],"казачество":["октава","завет","светоч","саз","сет","азот","ток","вес","тоска","аскет","сачок","зет","сечка","отказ","ас","осек","сток","коса","век","тесак","секач","скетч","скотч","секта","сев","заток","заточка","оаз","зев","вакса","чек","зевота","тако","сват","саке","коза","акт","квота","таз","такса","веточка","сточка","зевок","стачка","засечка","засветка","закат","час","сааз","вазочка","скат","вата","севок","сеточка","вест","кат","кетч","воск","саква","ост","осечка","зева","кот","отсечка","ков","веко","кета","воз","савка","скот","стек","часок","чаво","свечка","точка","качество","тачка","завеса","ткач","тасовка","ваза","свет","овечка","оса","чесотка","весточка","зов","отсек","возка","течка","сетка","ватка","кача","отвес","аозт","вето","стека","сотка","засека","сок","засов","засев","ставка","чека","зек","зачаток","косач","совет","чета","свеча","ветка","авто","каста","осака","отсев","сова","квас","отава","сказ","зевака","своз","совка"],"подчеканка":["пан","чакан","дачка","панк","океан","ад","чакона","чеканка","пак","пекан","дан","дно","кока","ода","едок","неподача","кок","кадка","чан","дочка","качка","чек","пена","какао","пенка","опак","анод","подача","кепка","кан","капок","ночка","подкачка","чадо","кондак","пек","копа","дача","канапе","еда","кочан","до","подачка","почка","дека","декан","дек","очанка","печка","кода","депо","пеночка","дока","код","кнопка","нок","кача","кон","капкан","пачка","панда","чека","чепан","подначка","док","конка","па","кочка","копна","коечка","опека","епанча"],"метрдотель":["отдел","дерть","дот","морель","ор","модель","терем","метро","медь","торт","род","лорд","мот","дело","мол","лом","мор","мель","трот","дом","темь","лор","том","треть","омлет","метол","ром","орт","метеор","модельер","лето","до","моль","тело","ерь","одр","роль","мел","мотель","рот","метель","рол","метр","ель","дерьмо","тол","толь","дол","лот","море","трель","дрель","ре","леер","отель","отмель","метод","ом","мотет","тотем"],"самоохрана":["романс","хаос","роса","рана","орс","махаон","нома","мохна","ор","ас","хам","омар","сор","номарх","осман","масон","самар","раса","монах","нос","сома","мор","сом","охрана","хан","сан","нора","хамса","монарх","махра","мана","ром","рама","рамс","норма","хор","саман","аарон","соха","срам","оса","марс","мох","роман","ар","сонм","сон","морс","саам","сахар","хон","храм","росомаха","махан","хна","хром","ом","хасан","мах","мара","сарана","охра","рона","маран","сноха"],"бутылконос":["лотос","лоскут","толк","око","ток","откус","обыск","соло","бок","сын","сток","тон","соты","укол","окно","оболтус","лыко","нос","бокс","локон","тун","клон","блок","колун","тын","куст","бусы","колос","откол","сбыт","окот","луб","лото","бот","бунт","лоно","стук","столб","сынок","уклон","кол","ост","убыток","куб","кот","носок","сукно","ус","консул","скот","обол","блокнот","кун","обнос","болт","кнут","бук","откос","столон","стон","бык","лоб","бутон","клот","унты","конус","склон","боны","клуб","нок","колоб","скол","стык","утконос","тол","клоун","сон","кон","сок","обкос","быт","осот","лысун","лот","лобок","уток","относ","бостон","нут","лоток","кулон","букс","тонус","тыл","стул","болтун","укос","лоск","колтун","сноб","стол","бон","слон","слот","лук","сук","бут"],"пародист":["роса","дот","орс","иод","оспа","истод","пот","аист","сидр","посад","сатир","ор","строп","ас","ад","сирота","порт","пастор","сор","сито","тора","род","рис","тропа","радист","трио","ода","рост","пора","трап","потир","рота","си","пари","пиар","рапс","спорт","триод","сад","диоптр","сопа","пас","трип","спора","тапир","тирс","сипота","ост","артос","орт","торс","стопа","аорист","до","ситар","рапсод","пират","дар","одр","даос","спад","опт","пирс","оса","троп","рот","пат","ар","пар","спор","пост","спид","драп","стадо","ситро","тир","ирод","пир","топ","трос","тис","тип","сироп","триас","сард","па","радио","сип","орда","дора","спирт","сорит","раис","аспид","пиастр","сода","стропа","апис","парс","отпад","сорт"],"оставление":["весна","слива","свита","вал","тесина","стела","илот","аист","линт","сет","теин","невеста","власти","васин","влас","вес","сени","аил","сено","ас","вино","тление","тени","селин","салон","тон","селенит","лист","сито","ласт","лес","сенат","сев","соление","тина","волна","нос","стен","отлив","село","лов","тал","сиена","си","сват","леса","сеновал","сван","овин","сан","ант","наст","сонет","лев","летие","соли","овал","навес","сетование","левит","осетин","вест","нилот","сани","стена","ост","валет","лето","стан","талон","сила","енот","тело","вона","сатин","ил","ива","олива","нотис","нота","листва","иена","навет","свет","вис","сало","ватин","оса","слив","виола","стон","лосина","ствол","тлен","весло","слоение","осина","тесание","силон","синева","винт","лента","ленсовет","вол","светило","отвес","вето","овен","тол","настил","навис","сон","волан","лот","сена","твин","налив","ветла","нева","воин","тис","неолит","талес","летание","светание","олеин","совет","вено","лесина","ион","остин","авто","вина","нива","отвал","стол","селен","отсев","сова","слон","слот","анис","силен","тесло","лиса","автол"],"некробиоз":["озерко","инок","око","бекон","некроз","козни","бок","ор","обрез","низ","короб","крен","бизон","окно","рок","ик","берзин","озорник","ибер","низок","ринк","орок","кино","обозник","оброк","бриз","орк","зерно","криз","брик","зоб","обрезок","кеб","ирокез","обои","нок","резон","зенки","корн","кон","корзно","озеро","обзор","зек","озон","обоз","ион","бек","керн","ре","озноб","крез","бон"]
  };

  let PLAYESTATE = {
  };
  let doDeleteBlock;
    let allDoneWords = localStorage.getItem('allDoneWords');
  let tips = localStorage.getItem('tips');
  let sounds = localStorage.getItem('sounds');
  let loc = 0;
  let allStars = [];
  let isRules = false;
  let allLocations = Math.floor(allWords.length / 21);
  if(allDoneWords){
    allDoneWords = JSON.parse(allDoneWords);
    tips = Number(tips);
    sounds = sounds === 'true';
    setLoc();
  }else{
    allDoneWords = {};
    tips = 3;
    isRules = true;
    sounds = true;
    localStorage.setItem('sounds', true);
    localStorage.setItem('allDoneWords', JSON.stringify(allDoneWords));
    localStorage.setItem('tips', 3);

    allWords.forEach((key => {
      allDoneWords[key] = [];
    }));
    for(let i = 0; i < allWords.length; i++){
      allStars.push(0);
    }
  }
  function setLoc() {
    allWords.forEach((key => {
      if(allDoneWords[key]){
        allStars.push(testStar(allDoneWords[key].length, wordsFromWords[key].length))
      }else{
        allDoneWords[key] = [];
        allStars.push(0);
      }
    }));
    localStorage.setItem('allDoneWords', JSON.stringify(allDoneWords));
    PLAYESTATE.allDoneWords = allDoneWords;
    if(playerGame) playerGame.setData(PLAYESTATE).then((ignored) => {});
    let lastLevel = allStars.length-1;
    for(let i = 0; i < allStars.length; i++){
      if(allStars[i] === 0){
        lastLevel = i;
        break;
      }
    }
    loc = Math.floor((lastLevel / 21));
    if(allStars.reduce((acc, st)=>{
      return acc + st;
    }, 0) < loc*33){
      loc--;
    }
    if(loc >= allLocations || loc < 0) loc = 0;
  }
  if(window.YaGames){
    window.YaGames.init({
      adv: {
        onAdvClose: wasShown => {
          if(!wasShown) advTime = true;
        }
      }
    }).then(ysdk => {
      YSDK = ysdk;
      initPlayer(ysdk);
      showAdv = () => {
        ysdk.adv.showFullscreenAdv({
          callbacks: {
            onClose: function() {
              advTime = false;
              setTimeout(()=>{
                advTime = true;
              }, 220000);
            }
          }
        });
      };
    });
  }else{
    doDeleteBlock = true;
  }
  function update() {
    if (document.querySelector('.levels')) {
      document.querySelector('.levels').dispatchEvent(new CustomEvent("updateAll"));
    }

  }
  function initPlayer(ysdk) {
    ysdk.getPlayer().then(_player => {
      // Игрок авторизован.
      playerGame = _player;
      playerGame.getData(['allDoneWords', 'tips', 'sounds'], false).then((dataObject) => {
        console.log(dataObject);
        if (dataObject.allDoneWords) {
          allDoneWords = dataObject.allDoneWords;
          if (dataObject.tips) tips = dataObject.tips;
          if (dataObject.sounds) sounds = dataObject.sounds;
          PLAYESTATE = dataObject;
        }else{
          playerGame.setData({
            tips: 3,
            sounds: true,
            allDoneWords: {}
          }, false).then((ignored) => {});
        }

        update();
      }).catch((e) => {
        console.log(e);
        update();
      });
      ysdk.getPayments({ signed: false }).then(_payments => {
        // Покупки доступны.
        payments = _payments;
      }).catch(err => {
        console.log(err);
      });
    }).catch((e) => {
      console.log(e);
      update();
    });
  }
  let TIPS = 0;
  function buyTips(item) {
    console.log('buy');
    if(payments){
      let purchaseItem = 'cart_item' + item;
      payments.purchase(purchaseItem).then(purchase => {
        if(purchase.productID === purchaseItem){
          if(item === 1) TIPS = 5;
          if(item === 2) TIPS = 20;
          if(item === 3) TIPS = 50;
          if(item === 4) TIPS = 100;
          document.querySelector('.levels').dispatchEvent(new CustomEvent("buyTips"));
          payments.consumePurchase(purchase.purchaseToken);
        }
      }).catch((e)=>{
        console.log("PAYMENTS ERROR: " + e);
      });
    }else{
      console.log('open auth');
      YSDK.auth.openAuthDialog().then(() => {
        // Игрок успешно авторизован, теперь объект Player будет инициализирован.
        console.log('успешно авторизован');
        initPlayer(YSDK);
      }).catch((ignored) => {// Игрок не авторизован.
      });
    }
  }







  function testStar(doneWordsLength, allWordsLength) {
    if(doneWordsLength === allWordsLength) return 3;
    let percent = Math.floor(doneWordsLength / allWordsLength * 100);
    if(percent >= 66) return 2;
    if(percent >= 33) return 1;
    return 0;
  }
  const NewAudioContext = (function() {

    try {
      window.AudioContext = window.AudioContext || window.webkitAudioContext;
      window.audioContext = new window.AudioContext();
    } catch (e) {
      console.log("No Web Audio API support");
    }
    /*
     * WebAudioAPISoundManager Constructor
     */
    var WebAudioAPISoundManager = function (context) {
      this.context = context;
      this.bufferList = {};
      this.playingSounds = {};
    };

    /*
     * WebAudioAPISoundManager Prototype
     */
    WebAudioAPISoundManager.prototype = {
      addSound: function (url) {
        // Load buffer asynchronously
        var request = new XMLHttpRequest();
        request.open("GET", url, true);
        request.responseType = "arraybuffer";

        var self = this;

        request.onload = function () {
          // Asynchronously decode the audio file data in request.response
          self.context.decodeAudioData(
                  request.response,

                  function (buffer) {
                    if (!buffer) {
                      console.log('error decoding file data: ' + url);
                      return;
                    }
                    self.bufferList[url] = buffer;
                  });
        };

        request.onerror = function () {
          console.log('BufferLoader: XHR error');
        };

        request.send();
      },
      stopSoundWithUrl: function(url) {
        if(this.playingSounds.hasOwnProperty(url)){
          for(var i in this.playingSounds[url]){
            if(this.playingSounds[url].hasOwnProperty(i)) {
              this.playingSounds[url][i].stop(0);
            }
          }
        }
      }
    };

    /*
     * WebAudioAPISound Constructor
     */
    var WebAudioAPISound = function (url, options) {
      this.settings = {
        loop: false
      };

      for(var i in options){
        if(options.hasOwnProperty(i)) {
          this.settings[i] = options[i];
        }
      }

      this.url = url + '.mp3';
      this.volume = 1;
      window.webAudioAPISoundManager = window.webAudioAPISoundManager || new WebAudioAPISoundManager(window.audioContext);
      this.manager = window.webAudioAPISoundManager;
      this.manager.addSound(this.url);
      // this.buffer = this.manager.bufferList[this.url];
    };

    /*
     * WebAudioAPISound Prototype
     */
    WebAudioAPISound.prototype = {
      play: function () {
        var buffer = this.manager.bufferList[this.url];
        //Only play if it loaded yet
        if (typeof buffer !== "undefined") {
          var source = this.makeSource(buffer);
          source.loop = this.settings.loop;
          source.start(0);

          if(!this.manager.playingSounds.hasOwnProperty(this.url)) {
            this.manager.playingSounds[this.url] = [];
          }
          this.manager.playingSounds[this.url].push(source);
        }
      },
      stop: function () {
        this.manager.stopSoundWithUrl(this.url);
      },
      getVolume: function () {
        return this.translateVolume(this.volume, true);
      },
      //Expect to receive in range 0-100
      setVolume: function (volume) {
        this.volume = this.translateVolume(volume);
      },
      translateVolume: function(volume, inverse){
        return inverse ? volume * 100 : volume / 100;
      },
      makeSource: function (buffer) {
        var source = this.manager.context.createBufferSource();
        var gainNode = this.manager.context.createGain();
        source.connect(gainNode);
        gainNode.gain.value = this.volume;
        source.buffer = buffer;
        // source.connect(gainNode);
        gainNode.connect(this.manager.context.destination);
        return source;
      }
    };

    return WebAudioAPISound;
  })();

  let wrongWordSound = new NewAudioContext('wrong-word2');
  let doneWordSound = new NewAudioContext('done-word');
  let starVolume = new NewAudioContext('star');
  let newLevel = new NewAudioContext('new-level');
  let clickSound = new NewAudioContext('click');


  function params(data) {
    try{
      // eslint-disable-next-line no-undef
      ym(57682372, 'params', data);
      // eslint-disable-next-line no-empty
    }catch(ignored){}
  }
  let iOS = /iPad|iPhone|iPod/.test(navigator.userAgent) && !window.MSStream;
  if(iOS){
    document.documentElement.addEventListener('gesturestart', function (event) {
      event.preventDefault();
    }, false);
  }
  export default {
    name: 'App',
    data(){
      return {
        levels: true,
        content: false,
        lvl: 0,
        letters: [],
        selectedLetters: [],
        wordFromLetter: '',
        numOfLevels: allWords.length,
        location: loc,
        allLocations: allLocations,
        stars: allStars,
        nowWords: [],
        doneWords: [],
        tipCount: tips,
        isBadWord: false,
        rules: isRules,
        levelsAnim: false,
        shop: false,
        newWord: '',
        animWord: '',
        words: '',
        getStar: -1,
        animWordStart: '',
        isSounds: sounds,
        advShowNow: false
      }
    },
    computed:{
      allStars(){
        return this.stars.reduce((acc, el)=> acc+ el, 0);
      },
    },
    methods:{
      updateAll() {
        allStars = [];
        loc = 0;
        setLoc();
        this.stars = allStars;
        this.location = loc;
        this.tipCount = tips;
        this.isSounds = sounds;
        console.log('update');
        if (document.querySelector(".pre-download")) {
          document.querySelector(".pre-download").remove()
        }
      },
      getLevel(lvl){
        if(this.isCloseLevelShow(lvl+1))return;
        if(lvl === 200){
          params({'200': 1});
        } else if(lvl === 100){
          params({'100': 1});
        }
        this.advShowNow = false;
        this.levelsAnim = false;
        if(this.isSounds){
          newLevel.play();
        }

        this.getStar = -1;
        setTimeout(()=>{
          this.levels = false;
        }, 500);

        this.content = true;

        this.newWord ='';
        this.animWord ='';
        this.animWordStart = '';

        this.lvl = lvl;
        this.wordFromLetter = '';
        this.word = allWords[lvl];
        this.doneWords = allDoneWords[this.word];
        this.selectedLetters = [];

        this.letters = this.word.split('');
        this.nowWords = wordsFromWords[this.word].sort((a, b)=>{
          if(a.length > b.length) return 1;
          if(a.length < b.length) return -1;
          return 0;
        });
        setTimeout(()=>{
          document.querySelector('.words').scrollTo({
            left: 0,
            behavior: "smooth"
          });
        }, 200);
        if(showAdv && advTime){
          setTimeout(()=>{
            showAdv();
            this.advShowNow = true;
            setTimeout(()=>{
              this.advShowNow = false;
            }, 10000)
          }, 300)
        }
      },
      getLevelByLevelAndLocation(level){
        return (this.location*21) + level;
      },
      addBuyTips(){
        this.tipCount += TIPS;
        localStorage.setItem('tips', this.tipCount);
        PLAYESTATE.tips = this.tipCount;
        playerGame.setData(PLAYESTATE).then((ignored) => {});
      },
      buyTip(item){
        buyTips(item);
      },
      toggleRules(){
        this.rules = !this.rules;
      },
      toggleShop(){
        this.shop = !this.shop;
      },
      advTip(){
        if(this.tipCount > 0) return false;
        return !!(showAdv && advTime);

      },
      switchSounds(){
        this.isSounds = !this.isSounds;
        localStorage.setItem('sounds', this.isSounds);
        PLAYESTATE.sounds = this.isSounds;
        if (playerGame) playerGame.setData(PLAYESTATE).then((ignored) => {});
      },
      isCloseLevelShow(level){
        return level !== 1 && this.stars[level-2] === 0;
      },
      isLevelNumberShow(level){
        return level === 1 || this.stars[level-2] > 0
      },
      pressKey(e){
        if(!this.content) return;
        if(this.animWordStart !== '') return;
        let letter = e.key;
        if(letter === 'Backspace'){
          this.selectedLetters.pop();
          this.wordFromLetter = this.wordFromLetter.slice(0, -1);
        }else if(letter === 'Enter'){
          this.sendWord();
        } else{
          letter = letter.toLowerCase();
          for(let i = 0; i < this.letters.length; i++){
              if(letter === this.letters[i] && !this.selectedLetters.includes(i)){
                this.selectedLetters.push(i);
                this.wordFromLetter += letter;
                if(this.isSounds){
                  clickSound.play();
                }
                break;
              }
          }
        }
      },
      testShowNextLevel(){
        if(this.lvl === allWords.length-1)return false;
        let nowLoc = Math.floor((this.lvl)/21);
        let nextLoc = Math.floor((this.lvl+1)/21);
        if(nowLoc !== nextLoc){
          return this.allStars >= nextLoc * 32;
        }
        return this.stars[this.lvl] > 0;
      },
      nextLevel(){
        if(this.testShowNextLevel()){
          this.getLevel(this.lvl+1);
        }
      },
      prevLocation(){
        if(this.location > 0){
          this.location--;
          if(this.isSounds){
            clickSound.play();
          }
        }
      },
      nextLocation(){
        if(this.location < this.allLocations-1){
          this.location++;
          if(this.isSounds){
            clickSound.play();
          }
        }
      },
      selectLetter(index){
        if(this.animWordStart !== '') return;
        if(this.isSounds){
          clickSound.play();
        }
        let ind = this.selectedLetters.indexOf(index);

        if(ind >= 0){
          this.selectedLetters.splice(ind, 1);
          this.wordFromLetter = this.wordFromLetter.slice(0, ind) + this.wordFromLetter.slice(ind+1);
        }else if(ind === -1 ){
          this.selectedLetters.push(index);
          this.wordFromLetter += this.letters[index];
        }
      },
      backMenu(){
        if(this.isSounds){
          clickSound.play();
        }

        this.levels =  true;
        this.levelsAnim =  true;
        setTimeout(()=>{
          this.content = false;
        }, 500);

      },
      getTip(){
        if(this.animWordStart !== '') return;
        if(this.tipCount < 1){
          if(showAdv && advTime){
            showAdv();
            this.tipCount++;
          }
          return;
        }
        if(allDoneWords[this.word].length === wordsFromWords[this.word].length) return;
        this.tipCount--;
        localStorage.setItem('tips', this.tipCount);
        PLAYESTATE.tips = this.tipCount;
        if (playerGame) playerGame.setData(PLAYESTATE).then((ignored) => {});

        let arr = wordsFromWords[this.word].slice();
        for(let i = 0; i < this.doneWords.length; i++){
          arr.splice(arr.indexOf(this.doneWords[i]), 1);
        }
        let rand = Math.floor(Math.random()*arr.length);
        this.wordFromLetter = arr[rand];
        this.sendWord();
      },
      sendWord(){
        if(this.animWordStart !== '' || this.wordFromLetter.length === 0) return;
        if(this.nowWords.includes(this.wordFromLetter) && !this.doneWords.includes(this.wordFromLetter)){
          this.animWordStart = this.wordFromLetter;
          let wordFromLetter = this.wordFromLetter;
          this.wordFromLetter = '';
          this.selectedLetters = [];
          setTimeout(()=>{
            try{
              let words = document.querySelector('.words');
              let w = words.getBoundingClientRect().width;
              let wordsScroll = words.scrollLeft;
              let scrollEl = document.querySelector('.animWordStart').getBoundingClientRect();
              let scrollto = 0;
              if(scrollEl.left + scrollEl.width > w){
                  if(scrollEl.left < w + wordsScroll) {
                    scrollto = wordsScroll + scrollEl.left + scrollEl.width
                  }else{
                    scrollto = scrollEl.left - w + scrollEl.width + wordsScroll;
                  }
              }
              words.scrollTo({
                left: scrollto,
                behavior: "smooth"
              });
            }catch(e){
              console.log('Ошибка показа');
            }
              if(this.isSounds){
                doneWordSound.play();
              }
              this.addWord(wordFromLetter);
            this.animWord = wordFromLetter;
            this.newWord = wordFromLetter;
            localStorage.setItem('allDoneWords', JSON.stringify(allDoneWords));
            PLAYESTATE.allDoneWords = allDoneWords;
            if (playerGame) playerGame.setData(PLAYESTATE).then((ignored) => {});
            setTimeout(()=>{
              this.animWordStart = '';
              this.animWord = '';

              if(!this.testStars()){
                if(showAdv && advTime){
                  setTimeout(()=>{
                    showAdv();
                    this.advShowNow = true;
                    setTimeout(()=>{
                      this.advShowNow = false;
                    }, 10000)
                  }, 300)
                }
              }

            }, 1000)
          }, 100);

        }else{
          this.isBadWord = true;
          if(this.isSounds){
            wrongWordSound.play();
          }

          setTimeout(()=>{
            this.isBadWord = false;
            this.wordFromLetter = '';
            this.selectedLetters = [];
          }, 400)
        }
      },
      testStars(){
        let stars = testStar(allDoneWords[this.word].length, wordsFromWords[this.word].length);
        if(stars > this.stars[this.lvl]){
          this.getStar = stars;
          this.stars.splice(this.lvl, 1, stars);
          if(this.isSounds){
            starVolume.play();
          }
          setTimeout(()=>{
            this.getStar = -1;
            if(this.location > 7){
              this.tipCount += 3;
            }else if(this.location > 4){
              this.tipCount += 2;
            }else{
              this.tipCount++;
            }
            localStorage.setItem('tips', this.tipCount);
            PLAYESTATE.tips = this.tipCount;
            if (playerGame) playerGame.setData(PLAYESTATE).then((ignored) => {});

            if(showAdv && advTime){
              setTimeout(()=>{
                showAdv();
                this.showAdv++;
                this.advShowNow = true;
                setTimeout(()=>{
                  this.advShowNow = false;
                }, 10000)
              }, 300)
            }
          }, 1000);
          return true;
        }
        return false;

      },
      addWord(word){
        this.doneWords.push(word);
      }
    },
    mounted: function() {
      this.$nextTick(function() {
        if (doDeleteBlock) {
          if (document.querySelector(".pre-download")) {
            document.querySelector(".pre-download").remove()
          }
        }
        document.addEventListener('keydown', this.pressKey)
      })
    }
  }
</script>



<style>
  html,body
  {
    width:100%;
    height:100%;
    font: 10px/1.5 PTM, sans-serif;
    -webkit-tap-highlight-color: transparent;
    -ms-user-select: none;
    -moz-user-select: none;
    -webkit-user-select: none;
    touch-action: manipulation;
    user-select: none;
  }
  @font-face {
    font-family: 'PTM';
    src: url('assets/PTMono-Regular.otf');
    src: url('assets/PTMono-Regular.woff') format('woff');
    font-weight: normal;
    font-style: normal;
  }
  .leftTopMenu{
    position: absolute;
    top: 50%;
    transform: translateY(-50%);
    left: 30px;

    display: flex;
    justify-content: space-between;
    align-items: center;
  }
  .switchRules{
    font-size: 3.5rem;
    color: #faf5ac;
    cursor: pointer;
  }
  .switchShop{
    width: 30px;
    height: 30px;

    margin-left: 50px;

    background: url("assets/shop.png") center center no-repeat;
    background-size: 100%;

    cursor: pointer;
  }

  .rules-blackout{
    position: absolute;
    left: 0;
    top: 0;

    width: 100%;
    height: 100%;
    background: rgba(0, 0, 0, 0.5);

    cursor: pointer;
    z-index: 9;
  }
  .rules{
    position: absolute;
    left: 50%;
    top: 50%;
    transform: translate(-50%, -50%);
    min-width: 500px;
    max-width: 800px;

    padding: 10px;

    font-size: 1.4rem;
    color: white ;

    background-color: #2c1f2d;


    z-index: 10;
  }
  .rules__cross{
    position: absolute;
    top: 5px;
    right: 5px;

    width: 40px;
    height: 40px;

    background: url(assets/cross.png) center center no-repeat;
    background-size: 90%;
    cursor: pointer;
  }
  .rules__menu{
    font-size: 3rem;
    text-align: center;
  }

  .close-level-help{
    background: url(assets/close-level.png);
  }

  #app, .game, .blur, .property, .levels, .levels__property{
    position: relative;

    width: 100%;
    height: 100%;
      -webkit-tap-highlight-color: transparent;
      -ms-user-select: none;
      -moz-user-select: none;
      -webkit-user-select: none;
      touch-action: manipulation;
      user-select: none;
  }
  .game{
    position: absolute;
    top: 0;
    left: 0;
    z-index: 4;
    animation: getGameLevel 0.4s ease-in forwards;
  }
  .levelsAnim{
    z-index: 5;
    animation: getLevels 0.4s ease-in forwards;
  }
  @keyframes getLevels {
    0%{
      transform: translateX(-100%);
    }
    100%{
      transform: translateX(0);
    }
  }
  @keyframes getGameLevel {
    0%{
      transform: translateX(100%);
    }
    100%{
      transform: translateX(0);
    }
  }
  .property{
    display: flex;
    flex-flow: column nowrap;
    justify-content: space-between;
  }
  .blur{
    position: absolute;
    top: 0;
    left: 0;

    background: url('assets/game-background.png') center center no-repeat;
    background-size: cover;
    filter: blur(2px);

    z-index: 1;
  }
  .opacity{
    z-index: 2;
    position: absolute;
    top: 0;
    left: 0;

    width: 100%;
    height: 100%;

    background-color: rgba(0,0,0,0.1);
  }
  /*Уровни*/
  .levels__property{
    z-index: 2;
    display: flex;
    justify-content: center;
    flex-flow: column nowrap;
    align-items: center;
  }
  .levels{

  }
  .levels .blur{
    background: url(assets/levels-background.png) center center no-repeat;
    background-size: cover;
  }
  .levels .opacity{
    background-color: rgba(0,0,0,0.2);
  }
  .levelsTop{
    position: absolute;
    left: 0;
    top: 0;

    display: flex;
    justify-content: center;
    align-items: center;

    width: 100%;
    height: 60px;

    background-color: rgba(0, 0, 0, 0.4);

    z-index: 3;
  }
  .levelsTop__allStars{

    font-size: 2.5rem;
    line-height: 2.5rem;
    color: #faf5ac;

    letter-spacing: 2px;
  }
  .levels .menu-star{
    width: 20px;
    height: 20px;

    margin-left: 5px;

    background: url(assets/menu-star.png) center center no-repeat;
    background-size: 100%;
  }
  .sounds{
    right: 30px;
    top: 50%;
    transform: translateY(-50%);
    position: absolute;

    width: 30px;
    height: 30px;

    background: url(assets/sounds-off.png) center center no-repeat;
    background-size: 100%;

    cursor: pointer;
  }
  .sounds-on{
    background: url(assets/sounds-on.png) center center no-repeat;
    background-size: 100%;
  }
  .levels-wrapper{
    position: relative;

    display: flex;
    flex-flow: row wrap;
    justify-content: center;
    align-items: center;

    width: 100%;
    height: auto;

    margin-top: 60px;
    padding: 10px;
  }
  .level{
    position: relative;

    display: flex;
    justify-content: center;
    align-items: center;

    width: 60px;
    height: 60px;

    border: 1px solid #cbcbc9;
    border-radius: 50%;

    margin: 0 20px 30px 0;

    font-size: 2.9rem;
    color: #cbcbc9;

    cursor: pointer;
  }
  .levels-wrapper::before, .levels-wrapper::after {
    content: '';
    width: 100%;
    order: 1;
  }
  .level:nth-child(7n){
    margin-right: 0;
  }
  .level:nth-child(n + 8) {
    order: 1;
  }
  .level:nth-child(n + 15) {
    order: 2;
  }
  .level-done{
    color: #faf5ac;
    border-color: #faf5ac;
  }
  .close-level{
    position: absolute;
    top: 0;
    left: 0;

    width: 100%;
    height: 100%;

    border-radius: 50%;
    background: url(assets/close-level.png) center center no-repeat;
    background-size: 60%;

    cursor: auto;
  }
  .level .menu__level_stars{
    position: absolute;
    left: 0;
    bottom: -20px;

    width: 100%;

    cursor: auto;
  }
  .menu__level_stars .menu-star{
    width: 15px;
    height: 15px;

  }


  .close-location{
    position: absolute;
    top: 0;
    left: 0;

    display: flex;
    flex-flow: column;
    justify-content: center;
    align-items: center;


    width: 100%;
    height: 100%;

    background-color: rgba(0, 0, 0, 0.5);

  }
  .big-close{
    width: 140px;
    height: 200px;

    background: url(assets/close-level.png) center center no-repeat;
    background-size: 90%;

  }
  .close-stars{
    display: flex;
    justify-content: center;
    align-items: baseline;

    font-size: 3rem;
    line-height: 3rem;
    letter-spacing: 1px;
    color: #cbcbc9;
  }
  .close-stars .level_star{
    width: 25px;
    height: 25px;
    margin-left: 5px;
  }

  /*Игра*/
  .property{
    z-index: 2;
  }
  /*Меню*/
  .menu{
    position: absolute;
    left: 0;
    top: 0;

    width: 100%;
    padding: 5px 0;

    display: flex;
    justify-content: space-around;
    align-items: center;


    background-color: rgba(0,0,0,0.4);
    color: white;

    z-index: 3;
  }
  .menu__button-back, .menu__tip, .menu__button-next-level{
    width: 30px;
    height: 30px;

    background: url(assets/bars.svg) center center no-repeat;
    background-size: 100%;
    border: none;
    cursor: pointer;
  }
  .menu__tip{
    position: relative;

    width: 24px;
    height: 38px;

    background: url(assets/tip.png) center center no-repeat;
    background-size: 100%;
  }
  .menu__tip_count, .advert{
    position: absolute;
    bottom: 0;
    right: -3px;

    display: flex;
    justify-content: center;
    align-items: center;

    padding: 0 4px;

    font-size: 0.7rem;

    background-color: #ee4051;
    border-radius: 5px;
  }
  .advert{
    width: 15px;
    height: 15px;

    background: url("assets/advert.png") center center no-repeat white;
    background-size: 80%;
  }
  .menu__level, .menu__words-amount{
    font-size: 1.6rem;
    letter-spacing: 2px;
  }
  .menu__words-amount{
    min-width: 60px;
  }
  .menu__level_stars{
    display: flex;
    justify-content: center;
  }
  .menu__button-next-level{
    background: url(assets/angle-right_gray.svg) center center no-repeat;
    background-size: 70%;
  }
  .menu__button-next-level, .menu__button-next-level:active{
    outline: none;
  }
  .menu__button-next-level_active{
    background: url(assets/angle-right_white.svg) center center no-repeat;
    background-size: 70%;
  }
  .menu__button-next-level_active:active{
    transform: scale(0.98);
  }
  .level_star{
    width: 15px;
    height: 15px;

    margin-right: 2px;
    background: url(assets/empty-star.png) center center no-repeat;
    background-size: 100%;

  }
  .level_full-star.getStar{
    animation: showFullStar 1s forwards;
  }
  .level_full-star{
    background: url(assets/menu-star.png) center center no-repeat;
    background-size: 100%;
  }
  @keyframes showFullStar {
      0%{
        transform: scale(1);
      }
      50%{
        transform: scale(2);
      }
      100%{
        transform: scale(1);
        background: url(assets/menu-star.png) center center no-repeat;
        background-size: 100%;
      }

  }
  .next-location, .prev-location{
    position: absolute;
    top: 50%;
    transform: translateY(-50%);

    width: 30px;
    height: 30px;


    background: url(assets/angle-right_menu.svg) center center no-repeat;
    background-size: 100%;

    cursor: pointer;
    z-index: 2;
  }
  .next-location:active{
    transform: translateY(-50%) scale(0.98);
  }
  .next-location{
    right: 5px;
  }
  .prev-location{
    left: 5px;
    transform: translateY(-50%) rotate(180deg);
  }
  .prev-location:active{
    transform: translateY(-50%) rotate(180deg) scale(0.98);
  }
  /*Блок со всеми словами*/
  .words{
    display: flex;
    flex-flow: column wrap;

    width: 100%;
    max-height: 59%;

    margin-top: 50px;

    padding: 10px;

    overflow-x: auto;
  }
  .words__letters-block{
    display: flex;
    flex-flow: row nowrap;


    margin-bottom: 5px;
    padding-right: 30px;
  }
  .words__letters-block_done .words__letter, .action-block__letters .action-block__letter_selected{
    background-color: rgba(166,82,174,0.9);
    color: white;
  }
  .words__letter, .action-block__letter{
    display: flex;
    justify-content: center;
    align-items: center;

    width: 25px;
    height: 25px;

    margin: 1px;

    border-radius: 3px;

    font-size: 1.8rem;
    text-transform: uppercase;

    background-color: rgba(255, 255, 255, 0.9);

  }
  .animWord .words__letter{
    animation: 1s showNewWord forwards;
    /*animation-delay: 0.2s;*/
  }
  .newWord .words__letter{
    background-color: rgba(217, 109, 227, 0.9);
  }
  @keyframes  showNewWord{
    0%{
      background-color: rgba(255, 255, 255, 0.9);
    }
    100%{
      background-color: rgba(217, 109, 227, 0.9);
    }
  }
  /*Взаимодействие*/
  .action-block__done-word{
    min-height: 30px;

    font-size: 2.3rem;
    line-height: 2.3rem;
    text-align: center;
    color: white;
    text-transform: uppercase;
    letter-spacing: 1px;

  }
  .done-word{
    position: relative;
    display: inline-block;
  }
  .badWord{
    color: #ee4051;
    animation: tremor 0.05s ease-in-out infinite;
  }


  /*Магазин*/
  .shop{
    min-height: 280px;

    border-radius: 10px;
  }
  .shop .rules__menu{
    margin-bottom: 10px;
  }
  .shop__cart{
    display: flex;
    justify-content: space-between;
    align-items: center;
  }
  .shop__cart__item{
    height: 100%;

    background-color: #7c3494;
    padding: 5px;
    border-radius: 10px;

  }
  .shop__cart__name{
    margin-bottom: 10px;
    text-align: center;
    font-size: 1.3rem;
  }
  .shop__cart__item_1, .shop__cart__item_2, .shop__cart__item_3, .shop__cart__item_4{
    position: relative;
    width: 100%;
    height: 150px;
  }

  .cart__item_tip{
    position: absolute;
    top: 80%;
    right: 25%;
    bottom: auto;
    font-size: 1.2rem;
    padding: 0 6px;
  }


  .shop__cart__item_1{
    background: url("assets/cart__item-1.png") center 80% no-repeat;
    background-size: 50%;
  }
  .shop__cart__item_2 {
    background: url("assets/cart__item-2.png") center 80% no-repeat;
    background-size: 100%;
  }
  .shop__cart__item_2 .cart__item_tip{
    right: 28%;
  }
  .shop__cart__item_3 {
    background: url("assets/cart__item-3.png") center 70% no-repeat;
    background-size: 100%;
  }
  .shop__cart__item_3 .cart__item_tip{
    right: 29%;
  }
  .shop__cart__item_4 {
    background: url("assets/cart__item-4.png") center 55% no-repeat;
    background-size: 100%;
  }
  .shop__cart__item_4 .cart__item_tip{
      right: 31%;
  }

  .shop__cart__buy-button{
    display: flex;
    justify-content: center;
    align-items: center;

    background-color: rgb(166,82,174);
    border: 1px solid black;
    padding: 10px 5px;
    box-shadow: 1px 1px 1px black;
    border-radius: 5px;


    font-size: 1.5rem;

    cursor: pointer;
  }
  .shop__cart__buy-button:hover{
    box-shadow: none;
  }
  .shop__cart__buy-button:active{
    transform: scale(0.98);

  }
  .cart__item_tip{
    top: 83%;
  }






  @keyframes tremor {
    0%, 25% {
      left: -1px;
      transform: translateX(-5%);
    }
    50%, 100% {
      left: 1px;
      transform: translateX(5%);
    }
  }
  .action-block__letters{
    display: flex;
    justify-content: center;
    align-items: center;
    margin-bottom: 15px;
  }
  .action-block__letter{
    width: 40px;
    height: 40px;

    font-size: 2.4rem;
    margin-right: 5px;

    cursor: pointer;
    -ms-user-select: none;

    -moz-user-select: none;
    -khtml-user-select: none;


    -webkit-user-select: none;
  }
  .action-block__button-send{
    display: block;

    margin: 0 5px 0 25px;

    width: 41px;
    height: 41px;

    background: url(assets/angle-right.png) center center no-repeat, rgba(255, 255, 255, 0.9);
    background-size: 17px 29px;

    border-radius: 3px;

    cursor: pointer;

    outline: none;
  }
  .action-block__button-send:active{
    transform: scale(0.98);
    outline: none;
  }
  @media (max-width: 600px) {
    .level{
      width: 55px;
      height: 55px;
      margin-right: 17px;
    }
  }
  @media (min-width: 1000px) {
    .rules__menu{
      font-size: 3.5rem;
    }
    .rules{
      font-size: 2rem;
      padding: 40px;
    }

    .advert {
      width: 20px;
      height: 20px;
    }



    .shop{
      width: 700px;
    }
    .shop__cart__item{
      width: 140px;
    }

    .blur{
      filter: blur(2px);
    }
    .games .blur{
      filter: blur(3px);
    }



    .levels-wrapper{
      margin: 0 auto;
    }
    .property, .levels-wrapper{
      max-width: 1200px;
      margin: 0 auto;
    }
    .level{
      width: 90px;
      height: 90px;

      margin-bottom: 40px;

      font-size: 4.8rem;
    }
    .level .menu__level_stars{
      bottom: -27px;
    }
    .level_star{
      width: 22px;
      height: 22px;
    }


    /*Игра*/
    .menu__button-back, .menu__button-next-level, .prev-location, .next-location{
      width: 40px;
      height: 40px;
    }
    .menu__words-amount{
      font-size: 2rem;
    }
    .menu__level{
      font-size: 2rem;
    }
    .close-level{
      background-size: 50%;
    }
    .level_star, .level_star.menu-star{
      width: 20px;
      height: 20px;
    }
    .menu__tip{
      width: 32px;
      height: 50px;
    }
    .menu__tip_count{
      font-size: 1rem;
    }
    .cart__item_tip{
      font-size: 1.3rem;
    }



    .words{
      margin-top: 60px;
      padding: 20px;
    }
    .words__letter{
      width: 40px;
      height: 40px;

      font-size: 2.2rem;
    }
    .action-block__letter{
      width: 60px;
      height: 60px;
      font-size: 3rem;
    }
    .action-block__button-send{
      width: 62px;
      height: 62px;
    }
    .action-block__done-word{
      font-size: 2.7rem;
    }
  }
</style>
